{
  "": [
    "--------------------------------------------------------------------------------------------",
    "Copyright (c) Microsoft Corporation. All rights reserved.",
    "Licensed under the MIT License. See License.txt in the project root for license information.",
    "--------------------------------------------------------------------------------------------",
    "Do not edit this file. It is machine generated."
  ],
  "version": "1.0.0",
  "contents": {
    "package": {
      "add.eventListener.breakpoint": "Chuyển đổi điểm ngắt trình nghe sự kiện",
      "add.xhr.breakpoint": "Thêm điểm ngắt XHR/Fetch",
      "attach.node.process": "Đính kèm vào quy trình Node",
      "base.cascadeTerminateToConfigurations.label": "Danh sách các phiên gỡ lỗi cũng sẽ bị dừng khi phiên gỡ lỗi này kết thúc.",
      "base.enableDWARF.label": "Chuyển đổi xem trình gỡ lỗi có cố gắng đọc các ký hiệu gỡ lỗi DWARF từ WebAssembly hay không, việc này có thể tốn nhiều tài nguyên. Yêu cầu tiện ích mở rộng 'ms-vscode.wasm-dwarf-debugging' để chạy.",
      "breakpoint.xhr.any": "Bất kỳ XHR/Fetch nào",
      "breakpoint.xhr.contains": "Ngắt khi URL chứa:",
      "browser.address.description": "Địa chỉ IP hoặc tên máy chủ mà trình duyệt được gỡ lỗi đang lắng nghe.",
      "browser.attach.port.description": "Cổng để gỡ lỗi trình duyệt từ xa, được chỉ định bằng `--remote-debugging-port` khi khởi động trình duyệt.",
      "browser.baseUrl.description": "URL cơ sở để phân giải đường dẫn. baseURL sẽ được cắt khi ánh xạ URL thành các tệp trên đĩa. Mặc định là miền của URL khởi chạy.",
      "browser.browserAttachLocation.description": "Buộc trình duyệt kết nối tại một vị trí. Trong không gian làm việc từ xa (ví dụ: qua ssh hoặc WSL), điều này có thể được sử dụng để kết nối trình duyệt trên máy từ xa thay vì cục bộ.",
      "browser.browserLaunchLocation.description": "Buộc trình duyệt khởi chạy tại một vị trí. Trong không gian làm việc từ xa (ví dụ: qua ssh hoặc WSL), điều này có thể được sử dụng để mở trình duyệt trên máy từ xa thay vì cục bộ.",
      "browser.cleanUp.description": "Hành động dọn dẹp sau khi phiên gỡ lỗi hoàn tất: 'Chỉ đóng tab đang được gỡ lỗi' và 'Đóng toàn bộ trình duyệt'.",
      "browser.cwd.description": "Thư mục làm việc tùy chọn cho tệp thực thi thời gian chạy.",
      "browser.disableNetworkCache.description": "Kiểm soát xem có bỏ qua bộ nhớ đệm mạng cho mọi yêu cầu hay không",
      "browser.env.description": "Một từ điển tùy chọn chứa các cặp khóa/giá trị môi trường cho trình duyệt.",
      "browser.file.description": "Tệp HTML cục bộ để mở trong trình duyệt",
      "browser.includeDefaultArgs.description": "Có bao gồm các đối số khởi chạy trình duyệt mặc định (để tắt các tính năng có thể gây khó khăn cho việc gỡ lỗi) trong khi khởi chạy hay không.",
      "browser.includeLaunchArgs.description": "Nâng cao: Có đặt bất kỳ đối số khởi chạy/gỡ lỗi mặc định nào trên trình duyệt hay không. Trình gỡ lỗi sẽ giả định rằng trình duyệt sẽ được gỡ lỗi qua đường ống, như được cung cấp bởi `--remote-debugging-pipe`.",
      "browser.inspectUri.description": "Định dạng để ghi đè inspectUri: Đây là một chuỗi mẫu nơi các khóa trong \"{dấu ngoặc nhọn}\" có thể được chèn. Các khóa có sẵn bao gồm:\r\n - \"url.*\" là địa chỉ đã phân tích của ứng dụng đang chạy, ví dụ: \"{url.port}\" và \"{url.hostname}\"\r\n - \"port\" là cổng gỡ lỗi mà Chrome đang lắng nghe.\r\n - \"browserInspectUri\" là URI kiểm tra trên trình duyệt đã khởi chạy\r\n - \"browserInspectUriPath\" là phần đường dẫn của URI kiểm tra trên trình duyệt đã khởi chạy (ví dụ: \"/devtools/browser/e9ec0098-306e-472a-8133-5e42488929c2\").\r\n - \"wsProtocol\" là giao thức websocket gợi ý. Đặt thành \"wss\" nếu URL gốc là \"https\", nếu không thì là \"ws\".\r\n",
      "browser.killBehavior.description": "Cấu hình cách chấm dứt quá trình trình duyệt khi dừng phiên với `cleanUp: wholeBrowser`. Có thể là:\r\n\r\n- forceful (mặc định): Tắt cây tiến trình một cách mạnh mẽ. Gửi SIGKILL trên posix hoặc `taskkill.exe /F` trên Windows.\r\n- polite: Tắt cây tiến trình một cách lịch sự. Các tiến trình hoạt động kém có thể tiếp tục chạy sau khi tắt theo cách này. Gửi SIGTERM trên posix hoặc `taskkill.exe` không có cờ `/F` (buộc) trên Windows.\r\n- none: Không có chấm dứt nào xảy ra.",
      "browser.launch.port.description": "Cổng trình duyệt lắng nghe. Mặc định là '0', điều này sẽ khiến trình duyệt gỡ lỗi qua đường ống, thường an toàn hơn và nên được chọn trừ khi bạn cần kết nối với trình duyệt từ các công cụ khác.",
      "browser.pathMapping.description": "Ánh xạ URL/đường dẫn đến thư mục cục bộ để phân giải các tập lệnh trong trình duyệt thành các tập lệnh trên đĩa",
      "browser.perScriptSourcemaps.description": "Có tải bản đồ nguồn riêng cho từng tập lệnh với tên cơ sở của tệp nguồn hay không. Điều này có thể được đặt để tối ưu hóa việc xử lý bản đồ nguồn khi xử lý số lượng lớn tập lệnh nhỏ. Nếu được đặt thành 'auto', nó sẽ được phát hiện khi các trường hợp sử dụng đã biết có thể được phát hiện.",
      "browser.profileStartup.description": "Nếu đúng, việc lập hồ sơ sẽ bắt đầu ngay sau khi quá trình khởi động",
      "browser.restart": "Có kết nối lại khi kết nối trình duyệt đóng hay không",
      "browser.revealPage": "Tab tiêu điểm",
      "browser.runtimeArgs.description": "Các đối số tùy chọn được truyền đến tệp thực thi thời gian chạy.",
      "browser.runtimeExecutable.description": "\"canary\", \"stable\", \"custom\" hoặc đường dẫn đến tệp thực thi trình duyệt. \"Custom\" có nghĩa là một trình bao bọc tùy chỉnh, bản dựng tùy chỉnh hoặc biến môi trường CHROME_PATH.",
      "browser.runtimeExecutable.edge.description": "\"canary\", \"stable\", \"dev'\", \"custom\" hoặc đường dẫn đến tệp thực thi trình duyệt. \"Custom\" có nghĩa là một trình bao bọc tùy chỉnh, bản dựng tùy chỉnh hoặc biến môi trường EDGE_PATH.",
      "browser.server.description": "Cấu hình máy chủ web để khởi động. Các cấu hình giống như tác vụ khởi chạy \"node\".",
      "browser.skipFiles.description": "Một mảng các tên tệp hoặc thư mục hoặc mẫu glob đường dẫn để bỏ qua khi gỡ lỗi. Cho phép các mẫu dấu hoa thị và phủ định, ví dụ: `[\"**/node_modules/**\", \"!**/node_modules/my-module/**\"]`",
      "browser.smartStep.description": "Tự động bước qua các dòng không được ánh xạ trong tệp bản đồ nguồn. Ví dụ: mã được TypeScript tự động tạo ra khi biên dịch async/await hoặc các tính năng khác.",
      "browser.sourceMapPathOverrides.description": "Một tập hợp các ánh xạ để ghi đè các vị trí tệp nguồn được mô tả trong bản đồ nguồn, ánh xạ chúng đến các vị trí tương ứng trên đĩa. Xem README để biết thêm chi tiết.",
      "browser.sourceMapRenames.description": "Có sử dụng các ánh xạ 'tên' trong bản đồ nguồn hay không. Điều này yêu cầu yêu cầu nội dung nguồn, có thể chậm khi sử dụng một số trình gỡ lỗi.",
      "browser.sourceMaps.description": "Sử dụng bản đồ nguồn JavaScript (nếu có).",
      "browser.targetSelection": "Có đính kèm vào tất cả các mục tiêu khớp với bộ lọc URL ('auto') hay yêu cầu chọn một ('pick').",
      "browser.timeout.description": "Số mili giây để thử lại kết nối với trình duyệt. Mặc định là 10000 ms.",
      "browser.url.description": "Sẽ tìm kiếm tab có URL chính xác này và đính kèm vào đó (nếu tìm thấy)",
      "browser.urlFilter.description": "Các trang sẽ được tìm kiếm bằng URL này, sau đó kết nối với trang đã tìm thấy. Có thể sử dụng ký tự đại diện *.",
      "browser.userDataDir.description": "Theo mặc định, trình duyệt được khởi chạy với một cấu hình người dùng riêng biệt trong thư mục tạm thời. Sử dụng tùy chọn này để ghi đè. Đặt thành false để khởi chạy bằng cấu hình người dùng mặc định. Nếu một phiên bản đã chạy từ `userDataDir` thì không thể khởi chạy trình duyệt mới.",
      "browser.vueComponentPaths": "Danh sách các mẫu glob tệp để tìm các thành phần \"*.vue\". Mặc định là tìm kiếm toàn bộ không gian làm việc. Điều này cần được chỉ định vì bản đồ nguồn của Vue yêu cầu tìm kiếm bổ sung trong Vue CLI 4. Có thể tắt xử lý đặc biệt này bằng cách đặt mục này thành một mảng trống.",
      "browser.webRoot.description": "Cài đặt này chỉ định đường dẫn tuyệt đối đến thư mục gốc của máy chủ web trong không gian làm việc. Được sử dụng để phân giải các đường dẫn như `/app.js` thành các tệp trên đĩa. Một cách viết tắt cho pathMapping cho \"/\"",
      "chrome.attach.description": "Đính kèm vào một phiên bản Chrome đã ở chế độ gỡ lỗi",
      "chrome.attach.label": "Chrome: Đính kèm",
      "chrome.label": "Ứng dụng Web (Chrome)",
      "chrome.launch.description": "Khởi chạy Chrome để gỡ lỗi URL",
      "chrome.launch.label": "Chrome: Khởi chạy",
      "commands.callersAdd.label": "Loại trừ người gọi",
      "commands.callersAdd.paletteLabel": "Loại trừ người gọi khỏi tạm dừng tại vị trí hiện tại",
      "commands.callersGoToCaller.label": "Đi tới vị trí người gọi",
      "commands.callersGoToTarget.label": "Đi tới vị trí mục tiêu",
      "commands.callersRemove.label": "Xóa người gọi bị loại trừ",
      "commands.callersRemoveAll.label": "Xóa tất cả người gọi bị loại trừ",
      "commands.disableSourceMapStepping.label": "Tắt bước qua bản đồ nguồn",
      "commands.enableSourceMapStepping.label": "Bật bước qua bản đồ nguồn",
      "commands.networkClear.label": "Xóa nhật ký mạng",
      "commands.networkCopyURI.label": "Sao chép URL yêu cầu",
      "commands.networkOpenBody.label": "Mở phần thân phản hồi",
      "commands.networkOpenBodyInHexEditor.label": "Mở phần thân phản hồi trong trình chỉnh sửa Hex",
      "commands.networkReplayXHR.label": "Phát lại yêu cầu",
      "commands.networkViewRequest.label": "Xem yêu cầu dưới dạng cURL",
      "configuration.autoAttachMode": "Cấu hình các quy trình được tự động đính kèm và gỡ lỗi khi \"#debug.node.autoAttach#\" được bật. Các quy trình node được khởi chạy với cờ \"--inspect\" luôn được đính kèm bất kể cài đặt này.",
      "configuration.autoAttachMode.always": "Tự động đính kèm vào mọi quy trình Node.js được khởi chạy trong thiết bị đầu cuối.",
      "configuration.autoAttachMode.disabled": "Tự động đính kèm bị tắt và không hiển thị trong thanh trạng thái.",
      "configuration.autoAttachMode.explicit": "Tự động đính kèm chỉ khi được cấp \"--inspect\".",
      "configuration.autoAttachMode.smart": "Tự động đính kèm khi các tập lệnh không nằm trong thư mục node_modules được chạy.",
      "configuration.autoAttachSmartPatterns": "Cấu hình các mẫu glob để xác định khi nào đính kèm với chế độ thông minh `#debug.javascript.autoAttachFilter#`. `$KNOWN_TOOLS$` được thay thế bằng danh sách tên của các trình chạy mã và thử nghiệm phổ biến. [Đọc thêm trong tài liệu VS Code](https://code.visualstudio.com/docs/nodejs/nodejs-debugging#_auto-attach-smart-patterns).",
      "configuration.automaticallyTunnelRemoteServer": "Khi gỡ lỗi ứng dụng web từ xa, cấu hình xem có tự động tạo đường hầm máy chủ từ xa đến máy cục bộ hay không.",
      "configuration.breakOnConditionalError": "Có dừng lại khi một điểm ngắt có điều kiện gây ra lỗi hay không.",
      "configuration.debugByLinkOptions": "Các tùy chọn được sử dụng khi nhấp vào liên kết từ bên trong thiết bị đầu cuối gỡ lỗi. Có thể đặt thành \"false\" để tắt hành vi này.",
      "configuration.defaultRuntimeExecutables": "Giá trị \"runtimeExecutable\" mặc định cho các cấu hình khởi chạy nếu không được chỉ định. Điều này có thể được sử dụng để cấu hình các đường dẫn tùy chỉnh cho cài đặt Node.js hoặc trình duyệt của bạn.",
      "configuration.enableNetworkView": "Bật chế độ xem mạng thử nghiệm cho các mục tiêu hỗ trợ nó.",
      "configuration.npmScriptLensLocation": "Vị trí mà các mã 'Chạy' và 'Gỡ lỗi' phải được hiển thị trên các tập lệnh npm. Nó có thể ở 'Tất cả', 'Trên tập lệnh', 'Trên phần tập lệnh' hoặc 'Không bao giờ' của phần tập lệnh.",
      "configuration.pickAndAttachOptions": "Các tùy chọn mặc định được sử dụng khi gỡ lỗi quy trình thông qua lệnh `Gỡ lỗi: Đính kèm vào quy trình Node.js`",
      "configuration.resourceRequestOptions": "Các tùy chọn yêu cầu có thể được sử dụng khi tải tài nguyên như bản đồ nguồn trong trình gỡ lỗi. Ví dụ: bạn có thể muốn cấu hình cài đặt này nếu bản đồ nguồn của bạn yêu cầu xác thực hoặc sử dụng chứng chỉ tự ký. Các tùy chọn được sử dụng để tạo yêu cầu bằng thư viện [`got`](https://github.com/sindresorhus/got).\r\n\r\nTrường hợp phổ biến là tắt xác minh chứng chỉ có thể được thực hiện bằng cách truyền `{ \"https\": { \"rejectUnauthorized\": false } }`.",
      "configuration.terminalOptions": "Các tùy chọn khởi chạy mặc định cho thiết bị đầu cuối gỡ lỗi JavaScript và tập lệnh npm.",
      "configuration.unmapMissingSources": "Cấu hình xem các tệp bản đồ nguồn có tự động bị hủy ánh xạ nếu chúng không thể đọc được tệp nguồn hay không. Nếu điều này là false (mặc định), lời nhắc sẽ được hiển thị.",
      "createDiagnostics.label": "Chẩn đoán sự cố điểm ngắt",
      "customDescriptionGenerator.description": "Tùy chỉnh mô tả văn bản mà trình gỡ lỗi hiển thị cho các đối tượng (biến cục bộ, v.v.). Ví dụ:\r\n      1. this.toString() // Sẽ gọi toString để in tất cả các đối tượng\r\n      2. this.customDescription ? this.customDescription() : defaultValue // Sử dụng phương thức customDescription nếu có sẵn nếu không trả về defaultValue\r\n      3. function (def) { return this.customDescription ? this.customDescription() : def } // Sử dụng phương thức customDescription nếu có sẵn nếu không trả về defaultValue\r\n      ",
      "customPropertiesGenerator.description": "Tùy chỉnh các thuộc tính được hiển thị cho các đối tượng trong trình gỡ lỗi (biến cục bộ, v.v.). Ví dụ:\r\n    1. { ...this, extraProperty: '12345' } // Thêm extraProperty 12345 vào tất cả các đối tượng\r\n    2. this.customProperties ? this.customProperties() : this // Sử dụng phương thức customProperties nếu có sẵn nếu không sử dụng các thuộc tính từ this (mặc định)\r\n    3. function () { return this.customProperties ? this.customProperties() : this } // Sử dụng phương thức customDescription nếu có sẵn nếu không trả về các thuộc tính mặc định\r\n\r\n    Lỗi thời: Đây là một triển khai tạm thời của tính năng này cho đến khi chúng tôi có thời gian để triển khai nó như được minh họa ở đây: https://github.com/microsoft/vscode/issues/102181",
      "debug.npm.edit": "Chỉnh sửa package.json",
      "debug.npm.noScripts": "Không tìm thấy tập lệnh npm nào trong package.json",
      "debug.npm.noWorkspaceFolder": "Cần mở thư mục không gian làm việc để gỡ lỗi tập lệnh npm.",
      "debug.npm.parseError": "Không thể đọc {0}: {1}",
      "debug.npm.script": "Gỡ lỗi tập lệnh npm",
      "debug.terminal.attach": "Đính kèm vào quy trình thiết bị đầu cuối Node.js",
      "debug.terminal.label": "Thiết bị đầu cuối gỡ lỗi JavaScript",
      "debug.terminal.program.description": "Chạy một lệnh trong thiết bị đầu cuối đã khởi chạy. Nếu không có lệnh nào được cung cấp, thiết bị đầu cuối sẽ mở mà không khởi chạy chương trình.",
      "debug.terminal.snippet.label": "Chạy \"npm start\" trong thiết bị đầu cuối gỡ lỗi",
      "debug.terminal.toggleAuto": "Chuyển đổi tự động đính kèm Node.js trong thiết bị đầu cuối",
      "debug.terminal.welcome": "[Thiết bị đầu cuối gỡ lỗi JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nBạn có thể sử dụng thiết bị đầu cuối gỡ lỗi JavaScript để gỡ lỗi các quy trình Node.js chạy trên dòng lệnh.",
      "debug.terminal.welcomeWithLink": "[Thiết bị đầu cuối gỡ lỗi JavaScript](command:extension.js-debug.createDebuggerTerminal)\r\n\r\nBạn có thể sử dụng thiết bị đầu cuối gỡ lỗi JavaScript để gỡ lỗi các quy trình Node.js chạy trên dòng lệnh.\r\n\r\n[Gỡ lỗi URL](command:extension.js-debug.debugLink)",
      "debug.unverifiedBreakpoints": "Không thể đặt một số điểm ngắt. Nếu bạn gặp sự cố, bạn có thể [khắc phục sự cố cấu hình khởi chạy của mình](command:extension.js-debug.createDiagnostics).",
      "debugLink.label": "Mở liên kết",
      "edge.address.description": "Khi gỡ lỗi Web View, địa chỉ IP hoặc tên máy chủ mà Web View đang lắng nghe. Nếu không được đặt, sẽ tự động phát hiện.",
      "edge.attach.description": "Đính kèm vào một phiên bản Edge đã ở chế độ gỡ lỗi",
      "edge.attach.label": "Edge: Đính kèm",
      "edge.label": "Ứng dụng Web (Edge)",
      "edge.launch.description": "Khởi chạy Microsoft Edge để gỡ lỗi URL",
      "edge.launch.label": "Edge: Khởi chạy",
      "edge.port.description": "Khi gỡ lỗi Web View, cổng mà trình gỡ lỗi Web View đang lắng nghe. Nếu không được đặt, sẽ tự động phát hiện.",
      "edge.useWebView.attach.description": "Một đối tượng chứa đường ống gỡ lỗi 'pipeName' của WebView2 được lưu trữ UWP. Đây là 'MyTestSharedMemory' khi đường ống '\\\\.\\pipe\\LOCAL\\MyTestSharedMemory' được tạo",
      "edge.useWebView.launch.description": "Nếu được đặt thành 'true', trình gỡ lỗi sẽ coi tệp thực thi thời gian chạy là ứng dụng máy chủ có WebView để cho phép bạn gỡ lỗi nội dung tập lệnh WebView.",
      "edit.xhr.breakpoint": "Chỉnh sửa điểm ngắt XHR/Fetch",
      "enableContentValidation.description": "Chuyển đổi xem có xác thực rằng nội dung tệp trên đĩa khớp với nội dung được tải trong thời gian chạy hay không. Điều này hữu ích và cần thiết trong nhiều trường hợp, nhưng có thể gây ra sự cố nếu bạn có chuyển đổi phía máy chủ của tập lệnh.",
      "errors.timeout": "{0}: Hết thời gian sau {1} ms",
      "extension.description": "Tiện ích mở rộng để gỡ lỗi các chương trình Node.js và Chrome.",
      "extensionHost.label": "Phát triển tiện ích mở rộng VS Code",
      "extensionHost.launch.config.name": "Khởi chạy tiện ích mở rộng",
      "extensionHost.launch.debugWebWorkerHost": "Cấu hình xem có nên cố gắng đính kèm vào máy chủ tiện ích mở rộng Web Worker hay không.",
      "extensionHost.launch.debugWebviews": "Cấu hình xem có nên cố gắng đính kèm vào WebViews trong phiên bản VS Code đã khởi chạy hay không. Điều này chỉ hoạt động cho VS Code trên máy tính để bàn.",
      "extensionHost.launch.env.description": "Các biến môi trường được truyền đến máy chủ tiện ích mở rộng.",
      "extensionHost.launch.rendererDebugOptions": "Các tùy chọn khởi chạy Chrome được sử dụng khi đính kèm vào quy trình trình kết xuất, với 'debugWebviews' hoặc 'debugWebWorkerHost'.",
      "extensionHost.launch.runtimeExecutable.description": "Đường dẫn tuyệt đối đến VS Code.",
      "extensionHost.launch.stopOnEntry.description": "Tự động dừng máy chủ tiện ích mở rộng sau khi khởi chạy.",
      "extensionHost.launch.testConfiguration": "Đường dẫn đến tệp cấu hình thử nghiệm cho [CLI thử nghiệm](https://code.visualstudio.com/api/working-with-extensions/testing-extension#quick-setup-the-test-cli).",
      "extensionHost.launch.testConfigurationLabel": "Một cấu hình duy nhất để chạy từ tệp. Nếu không được chỉ định, bạn có thể được yêu cầu chọn.",
      "extensionHost.snippet.launch.description": "Khởi chạy tiện ích mở rộng VS Code ở chế độ gỡ lỗi",
      "extensionHost.snippet.launch.label": "Phát triển tiện ích mở rộng VS Code",
      "getDiagnosticLogs.label": "Lưu nhật ký gỡ lỗi JS chẩn đoán",
      "longPredictionWarning.disable": "Không hiển thị nữa",
      "longPredictionWarning.message": "Cấu hình điểm ngắt mất một thời gian. Bạn có thể tăng tốc bằng cách cập nhật \"outFiles\" trong launch.json của mình.",
      "longPredictionWarning.noFolder": "Không có thư mục không gian làm việc nào được mở.",
      "longPredictionWarning.open": "Mở launch.json",
      "node.address.description": "Địa chỉ TCP/IP của quy trình để gỡ lỗi. Mặc định là \"localhost\".",
      "node.attach.attachExistingChildren.description": "Có cố gắng đính kèm vào các quy trình con đã sinh ra hay không.",
      "node.attach.attachSpawnedProcesses.description": "Có đặt biến môi trường để theo dõi các quy trình con đã sinh ra trong quá trình đính kèm hay không.",
      "node.attach.config.name": "Đính kèm",
      "node.attach.continueOnAttach": "Nếu đúng, chúng tôi sẽ tự động tiếp tục chương trình được khởi chạy và đợi \"--inspect-brk\"",
      "node.attach.processId.description": "ID quy trình để đính kèm.",
      "node.attach.restart.description": "Cố gắng kết nối lại với chương trình nếu kết nối bị ngắt. Nếu được đặt thành \"true\", nó sẽ luôn thử lại mỗi giây. Bạn có thể tùy chỉnh khoảng thời gian và số lần thử tối đa bằng cách chỉ định \"delay\" và \"maxAttempts\" trong một đối tượng.",
      "node.attachSimplePort.description": "Nếu được đặt, sẽ đính kèm vào quy trình thông qua cổng đã cho. Điều này thường không còn cần thiết cho các chương trình Node.js và không cho phép gỡ lỗi các quy trình con, nhưng nó có thể hữu ích trong các kịch bản phức tạp hơn như với Deno và khởi chạy Docker. Nếu được đặt thành 0, một cổng ngẫu nhiên sẽ được chọn và --inspect-brk sẽ tự động được thêm vào các đối số khởi chạy.",
      "node.console.title": "Bảng điều khiển gỡ lỗi Node",
      "node.disableOptimisticBPs.description": "Không đặt điểm ngắt trong bất kỳ tệp nào trừ khi tệp đó đã tải bản đồ nguồn.",
      "node.enableTurboSourcemaps.description": "Cấu hình xem có sử dụng cơ chế phát hiện bản đồ nguồn mới, nhanh hơn hay không",
      "node.experimentalNetworking.description": "Bật kiểm tra thử nghiệm trong Node.js. Nếu được đặt thành `auto`, tính năng này sẽ được bật cho các phiên bản Node.js hỗ trợ nó. Có thể đặt thành `on` hoặc `off` để bật hoặc tắt rõ ràng.",
      "node.killBehavior.description": "Cấu hình cách chấm dứt quy trình gỡ lỗi khi dừng phiên. Có thể là:\r\n\r\n- forceful (mặc định): Tắt cây tiến trình một cách mạnh mẽ. Gửi SIGKILL trên posix hoặc \"taskkill.exe /F\" trên Windows.\r\n- polite: Tắt cây tiến trình một cách lịch sự. Có thể xảy ra trường hợp các tiến trình hoạt động kém tiếp tục chạy sau khi tắt theo cách này. Gửi SIGTERM trên posix hoặc \"taskkill.exe\" không có cờ \"/F\" (buộc) trên Windows.\r\n- none: Không có chấm dứt nào xảy ra.",
      "node.label": "Node.js",
      "node.launch.args.description": "Các đối số dòng lệnh được truyền đến chương trình.\r\n\r\nCó thể là một mảng chuỗi hoặc một chuỗi đơn. Khi khởi chạy chương trình trong một thiết bị đầu cuối, việc đặt thuộc tính này thành một chuỗi đơn sẽ dẫn đến việc các đối số không được thoát bởi shell.",
      "node.launch.autoAttachChildProcesses.description": "Tự động đính kèm trình gỡ lỗi vào các quy trình con mới.",
      "node.launch.config.name": "Khởi chạy",
      "node.launch.console.description": "Vị trí khởi chạy mục tiêu gỡ lỗi.",
      "node.launch.console.externalTerminal.description": "Thiết bị đầu cuối bên ngoài có thể được cấu hình thông qua cài đặt người dùng",
      "node.launch.console.integratedTerminal.description": "Thiết bị đầu cuối tích hợp của VS Code",
      "node.launch.console.internalConsole.description": "Bảng điều khiển gỡ lỗi VS Code (không hỗ trợ đọc đầu vào từ chương trình)",
      "node.launch.cwd.description": "Đường dẫn tuyệt đối đến thư mục làm việc của chương trình đang được gỡ lỗi. Nếu localRoot được đặt, cwd sẽ khớp với giá trị đó, nếu không nó sẽ trở về thư mục không gian làm việc",
      "node.launch.env.description": "Các biến môi trường được truyền đến chương trình. Giá trị `null` xóa biến khỏi môi trường.",
      "node.launch.envFile.description": "Đường dẫn tuyệt đối đến tệp chứa định nghĩa biến môi trường.",
      "node.launch.logging": "Cấu hình nhật ký sự kiện",
      "node.launch.logging.cdp": "Đường dẫn tệp nhật ký cho các thông báo giao thức Chrome DevTools",
      "node.launch.logging.dap": "Đường dẫn đến tệp nhật ký cho các thông báo giao thức Bộ điều hợp gỡ lỗi",
      "node.launch.outputCapture.description": "Nơi thu thập thông báo đầu ra: nếu được đặt thành `console`, nó là API gỡ lỗi mặc định, nếu `std`, nó là các luồng stdout/stderr.",
      "node.launch.program.description": "Đường dẫn tuyệt đối đến chương trình. Giá trị được tạo ra bằng cách nhìn vào package.json và các tệp đang mở được đoán. Chỉnh sửa thuộc tính này.",
      "node.launch.restart.description": "Cố gắng khởi động lại chương trình nếu nó thoát với mã thoát khác 0.",
      "node.launch.runtimeArgs.description": "Các đối số tùy chọn được truyền đến tệp thực thi thời gian chạy.",
      "node.launch.runtimeExecutable.description": "Thời gian chạy để sử dụng. Nên là đường dẫn tuyệt đối hoặc tên của thời gian chạy có sẵn trên PATH. Mặc định là \"node\".",
      "node.launch.runtimeSourcemapPausePatterns": "Danh sách các mẫu để chèn điểm ngắt điểm vào thủ công. Điều này hữu ích để trình gỡ lỗi đặt điểm ngắt khi bản đồ nguồn không tồn tại hoặc không thể phát hiện được trước khi khởi động, ví dụ: [sử dụng khung công tác không máy chủ](https://github.com/microsoft/vscode-js-debug/issues/492).",
      "node.launch.runtimeVersion.description": "Phiên bản thời gian chạy \"node\" để sử dụng. Yêu cầu \"nvm\".",
      "node.launch.useWSL.deprecation": "\"useWSL\" đã bị lỗi thời và sẽ ngừng được hỗ trợ. Vui lòng sử dụng tiện ích mở rộng \"Remote - WSL\" thay thế.",
      "node.launch.useWSL.description": "Sử dụng Hệ thống con Windows cho Linux.",
      "node.localRoot.description": "Đường dẫn đến thư mục cục bộ chứa chương trình.",
      "node.pauseForSourceMap.description": "Có đợi bản đồ nguồn của mọi tập lệnh đến được tải hay không. Điều này có chi phí hiệu suất, và có thể tắt an toàn khi bạn không bị thiếu dung lượng đĩa miễn là rootPath không bị tắt.",
      "node.port.description": "Cổng gỡ lỗi để đính kèm. Mặc định là 9229.",
      "node.processattach.config.name": "Đính kèm vào quy trình",
      "node.profileStartup.description": "Nếu đúng, việc lập hồ sơ sẽ bắt đầu ngay sau khi quá trình khởi động",
      "node.remote.host.header.description": "Tiêu đề máy chủ rõ ràng để sử dụng khi kết nối với Websocket của trình kiểm tra. Nếu không được chỉ định, tiêu đề máy chủ sẽ được đặt thành \"localhost\". Điều này hữu ích khi trình kiểm tra đang chạy phía sau một proxy chỉ chấp nhận các tiêu đề máy chủ cụ thể.",
      "node.remoteRoot.description": "Đường dẫn tuyệt đối đến thư mục từ xa chứa chương trình.",
      "node.resolveSourceMapLocations.description": "Danh sách các mẫu khớp nhỏ cho các vị trí (thư mục và URL) mà bản đồ nguồn có thể được sử dụng để phân giải các tệp cục bộ. Điều này có thể được sử dụng để tránh gây ra lỗi ngắt trong mã bản đồ nguồn bên ngoài. Sử dụng các mẫu có tiền tố \"!\" để loại trừ các ngắt đó. Cũng có thể đặt thành một mảng trống hoặc null để tránh giới hạn.",
      "node.showAsyncStacks.description": "Hiển thị các lệnh gọi không đồng bộ đã dẫn đến ngăn xếp cuộc gọi hiện tại.",
      "node.snippet.attach.description": "Đính kèm vào chương trình node đang chạy",
      "node.snippet.attach.label": "Node.js: Đính kèm",
      "node.snippet.attachProcess.description": "Mở trình chọn quy trình và chọn quy trình node để đính kèm",
      "node.snippet.attachProcess.label": "Node.js: Đính kèm vào quy trình",
      "node.snippet.electron.description": "Gỡ lỗi quy trình chính của Electron",
      "node.snippet.electron.label": "Node.js: Quy trình chính của Electron",
      "node.snippet.gulp.description": "Gỡ lỗi tác vụ Gulp (đảm bảo Gulp cục bộ đã được cài đặt trong dự án của bạn)",
      "node.snippet.gulp.label": "Node.js: Tác vụ Gulp",
      "node.snippet.launch.description": "Khởi chạy chương trình node ở chế độ gỡ lỗi",
      "node.snippet.launch.label": "Node.js: Khởi chạy chương trình",
      "node.snippet.mocha.description": "Gỡ lỗi kiểm thử mocha",
      "node.snippet.mocha.label": "Node.js: Kiểm thử Mocha",
      "node.snippet.nodemon.description": "Sử dụng nodemon để khởi động lại phiên gỡ lỗi khi nguồn thay đổi",
      "node.snippet.nodemon.label": "Node.js: Cài đặt Nodemon",
      "node.snippet.npm.description": "Khởi chạy chương trình node thông qua tập lệnh npm \"debug\"",
      "node.snippet.npm.label": "Node.js: Khởi chạy thông qua npm",
      "node.snippet.remoteattach.description": "Đính kèm vào cổng gỡ lỗi của chương trình node từ xa",
      "node.snippet.remoteattach.label": "Node.js: Đính kèm vào chương trình từ xa",
      "node.snippet.yo.description": "Gỡ lỗi trình tạo yeoman (cài đặt bằng cách chạy \"npm link\" trong thư mục dự án của bạn)",
      "node.snippet.yo.label": "Node.js: Trình tạo Yeoman",
      "node.sourceMapPathOverrides.description": "Một tập hợp các ánh xạ để ghi đè các vị trí của tệp nguồn được mô tả trong bản đồ nguồn đến các vị trí của chúng trên đĩa.",
      "node.sourceMaps.description": "Sử dụng bản đồ nguồn JavaScript (nếu có).",
      "node.stopOnEntry.description": "Tự động dừng chương trình sau khi khởi chạy.",
      "node.timeout.description": "Số mili giây để thử lại kết nối với Node.js. Mặc định là 10000 ms.",
      "node.versionHint.description": "Cho phép chỉ định rõ ràng phiên bản nút đang chạy, điều này có thể được sử dụng để tắt hoặc bật một số hành vi khi phát hiện phiên bản tự động không khả dụng.",
      "node.websocket.address.description": "Địa chỉ websocket chính xác để đính kèm. Nếu không được chỉ định, nó sẽ được phát hiện từ địa chỉ và cổng.",
      "openEdgeDevTools.label": "Mở công cụ dành cho nhà phát triển trình duyệt",
      "outFiles.description": "Nếu bản đồ nguồn được bật, các mẫu glob này chỉ định các tệp JavaScript đã tạo. Nếu một mẫu bắt đầu bằng `!`, các tệp đó sẽ bị loại trừ. Nếu không được chỉ định, mã được tạo phải nằm trong cùng thư mục với nguồn của nó.",
      "pretty.print.script": "In đẹp để gỡ lỗi",
      "profile.start": "Lấy hồ sơ hiệu suất",
      "profile.stop": "Dừng hồ sơ hiệu suất",
      "remove.eventListener.breakpoint.all": "Xóa tất cả điểm ngắt trình nghe sự kiện",
      "remove.xhr.breakpoint": "Xóa điểm ngắt XHR/Fetch",
      "remove.xhr.breakpoint.all": "Xóa tất cả điểm ngắt XHR/Fetch",
      "requestCDPProxy.label": "Yêu cầu proxy CDP cho phiên gỡ lỗi",
      "skipFiles.description": "Một mảng các mẫu glob cho các tệp để bỏ qua khi gỡ lỗi. Mẫu \"<node_internals>/**\" khớp với tất cả các mô-đun nội bộ của Node.js.",
      "smartStep.description": "Tự động bước qua mã được tạo không thể ánh xạ lại về nguồn gốc.",
      "start.with.stop.on.entry": "Bắt đầu gỡ lỗi và dừng khi nhập",
      "startWithStopOnEntry.label": "Bắt đầu gỡ lỗi và dừng khi nhập",
      "timeouts.generalDescription": "Thời gian chờ cho một số thao tác gỡ lỗi.",
      "timeouts.generalDescription.markdown": "Thời gian chờ cho một số thao tác gỡ lỗi.",
      "timeouts.hoverEvaluation.description": "Thời gian trước khi việc đánh giá giá trị của biểu tượng di chuột bị hủy. Nếu đặt thành 0, việc đánh giá di chuột sẽ không bao giờ hết thời gian.",
      "timeouts.sourceMaps.description": "Thời gian chờ liên quan đến các thao tác bản đồ nguồn.",
      "timeouts.sourceMaps.sourceMapCumulativePause.description": "Thời gian bổ sung (bằng mili giây) mà mỗi phiên đợi bản đồ nguồn được xử lý sau khi thời gian tối thiểu (sourceMapMinPause) đã hết",
      "timeouts.sourceMaps.sourceMapMinPause.description": "Thời gian tối thiểu (bằng mili giây) để đợi mỗi bản đồ nguồn được xử lý khi phân tích một tập lệnh",
      "toggle.skipping.this.file": "Chuyển đổi bỏ qua tệp này",
      "trace.boolean.description": "Theo dõi có thể được đặt thành \"true\" để ghi nhật ký chẩn đoán vào đĩa.",
      "trace.description": "Cấu hình đầu ra chẩn đoán nào được tạo.",
      "trace.logFile.description": "Cấu hình nơi nhật ký đĩa được ghi.",
      "trace.stdio.description": "Có trả về dữ liệu theo dõi từ ứng dụng hoặc trình duyệt đã khởi chạy hay không.",
      "workspaceTrust.description": "Cần có sự tin cậy để gỡ lỗi mã trong không gian làm việc này."
    },
    "bundle": {
      "A profiling session is already running, would you like to stop it and start a new session?": "Một phiên lập hồ sơ đã chạy, bạn có muốn dừng nó và bắt đầu một phiên mới không?",
      "Add XHR Breakpoint": "Thêm điểm ngắt XHR",
      "Add new URL...": "Thêm URL mới...",
      "Adjust glob pattern(s) in the 'outFiles' attribute so that they cover the generated JavaScript.": "Điều chỉnh (các) mẫu glob trong thuộc tính 'outFiles' để chúng bao gồm JavaScript được tạo.",
      "Always": "Luôn luôn",
      "Always in this Workspace": "Luôn luôn trong Không gian làm việc này",
      "An error occurred taking a profile from the target.": "Đã xảy ra lỗi khi lấy hồ sơ từ mục tiêu.",
      "Animation Frame Fired": "Khung hình động đã kích hoạt",
      "Any XHR or fetch": "Bất kỳ XHR hoặc fetch nào",
      "Assertion failed": "Khẳng định thất bại",
      "Attach to process: '{0}' doesn't look like a process id.": "Đính kèm vào quy trình: '{0}' không giống một id quy trình.",
      "Attach to process: cannot enable debug mode for process '{0}' ({1}).": "Đính kèm vào quy trình: không thể bật chế độ gỡ lỗi cho quy trình '{0}' ({1}).",
      "Attribute 'runtimeVersion' requires Node.js version manager 'nvm-windows' or 'nvs'.": "Thuộc tính 'runtimeVersion' yêu cầu trình quản lý phiên bản Node.js 'nvm-windows' hoặc 'nvs'.",
      "Attribute 'runtimeVersion' requires Node.js version manager 'nvs', 'nvm' or 'fnm' to be installed.": "Thuộc tính 'runtimeVersion' yêu cầu trình quản lý phiên bản Node.js 'nvs', 'nvm' hoặc 'fnm' phải được cài đặt.",
      "Attribute 'runtimeVersion' with a flavor/architecture requires 'nvs' to be installed.": "Thuộc tính 'runtimeVersion' với một phiên bản/kiến trúc yêu cầu 'nvs' phải được cài đặt.",
      "Bidder Bidding Phase Start": "Người trả giá bắt đầu giai đoạn đấu thầu",
      "Bidder Reporting Phase Start": "Người trả giá bắt đầu giai đoạn báo cáo",
      "Block": "Khối",
      "Break when URL Contains": "Ngắt khi URL chứa",
      "Breaks on all throw errors, even if they're caught later.": "Ngắt trên tất cả các lỗi throw, ngay cả khi chúng được bắt sau đó.",
      "Breaks only on errors or promise rejections that are not handled.": "Chỉ ngắt trên các lỗi hoặc từ chối promise không được xử lý.",
      "Browser connection failed, will retry: {0}": "Kết nối trình duyệt thất bại, sẽ thử lại: {0}",
      "CPU Profile": "Hồ sơ CPU",
      "CPU profile saved as \"{0}\" in your workspace folder": "Hồ sơ CPU được lưu dưới dạng \"{0}\" trong thư mục không gian làm việc của bạn",
      "CSP violation \"{0}\"": "Vi phạm CSP \"{0}\"",
      "Can't find Node.js binary \"{0}\": {1}. Make sure Node.js is installed and in your PATH, or set the \"runtimeExecutable\" in your launch.json": "Không thể tìm thấy tệp nhị phân Node.js \"{0}\": {1}. Hãy đảm bảo Node.js đã được cài đặt và nằm trong PATH của bạn, hoặc đặt \"runtimeExecutable\" trong launch.json của bạn",
      "Can't load environment variables from file ({0}).": "Không thể tải các biến môi trường từ tệp ({0}).",
      "Cancel Animation Frame": "Hủy khung hình động",
      "Cannot connect to the target at {0}: {1}": "Không thể kết nối với mục tiêu tại {0}: {1}",
      "Cannot find `{0}` installed in {1}": "Không thể tìm thấy `{0}` được cài đặt trong {1}",
      "Cannot find a program to debug": "Không thể tìm thấy chương trình để gỡ lỗi",
      "Cannot find test configuration with label `{0}`, got: {1}": "Không thể tìm thấy cấu hình kiểm thử với nhãn `{0}`, đã nhận: {1}",
      "Cannot launch debug target in terminal ({0}).": "Không thể khởi chạy mục tiêu gỡ lỗi trong terminal ({0}).",
      "Cannot restart asynchronous frame": "Không thể khởi động lại khung không đồng bộ",
      "Cannot set an empty value": "Không thể đặt giá trị trống",
      "Catch Block": "Khối bắt lỗi",
      "Caught Exceptions": "Các ngoại lệ đã bắt",
      "Close AudioContext": "Đóng AudioContext",
      "Closure": "Bao đóng",
      "Closure ({0})": "Bao đóng ({0})",
      "Console profile started": "Hồ sơ bảng điều khiển đã bắt đầu",
      "Could not connect to any UWP Webview pipe. Make sure your webview is hosted in debug mode, and that the `pipeName` in your `launch.json` is correct.": "Không thể kết nối với bất kỳ đường ống UWP Webview nào. Hãy đảm bảo webview của bạn được lưu trữ ở chế độ gỡ lỗi và `pipeName` trong `launch.json` của bạn là chính xác.",
      "Could not find a location for the variable": "Không thể tìm thấy vị trí cho biến",
      "Could not query the provided object": "Không thể truy vấn đối tượng được cung cấp",
      "Could not read source map for {0}: {1}": "Không thể đọc bản đồ nguồn cho {0}: {1}",
      "Could not read {0}: {1}": "Không thể đọc {0}: {1}",
      "Create AudioContext": "Tạo AudioContext",
      "Create canvas context": "Tạo ngữ cảnh canvas",
      "Debug Anyway": "Dù sao cũng gỡ lỗi",
      "Debug URL": "Gỡ lỗi URL",
      "Details": "Chi tiết",
      "Don't show again": "Không hiển thị lại",
      "Duration": "Thời lượng",
      "Duration of Profile": "Thời lượng của hồ sơ",
      "Edit XHR Breakpoint": "Chỉnh sửa điểm ngắt XHR",
      "Edit package.json": "Chỉnh sửa package.json",
      "Enables Node.js [auto attach]({0}) debugging in \"{1}\" mode/{Locked='[auto attach]({0})'}the 2nd placeholder is the setting value": "Bật gỡ lỗi [tự động đính kèm]({0}) Node.js ở chế độ \"{1}\"/{Đã khóa='[tự động đính kèm]({0})'}chỗ giữ chỗ thứ 2 là giá trị cài đặt",
      "Enter a URL or a pattern to match": "Nhập URL hoặc mẫu để khớp",
      "Eval": "Đánh giá",
      "Frame could not be restarted": "Không thể khởi động lại khung",
      "Generates a .cpuprofile file you can open in VS Code or the Edge/Chrome devtools": "Tạo tệp .cpuprofile bạn có thể mở trong VS Code hoặc các công cụ dành cho nhà phát triển Edge/Chrome",
      "Generates a .heapprofile file you can open in VS Code or the Edge/Chrome devtools": "Tạo tệp .heapprofile bạn có thể mở trong VS Code hoặc các công cụ dành cho nhà phát triển Edge/Chrome",
      "Generates a .heapsnapshot file you can open in VS Code or the Edge/Chrome devtools": "Tạo tệp .heapsnapshot bạn có thể mở trong VS Code hoặc các công cụ dành cho nhà phát triển Edge/Chrome",
      "Global": "Toàn cục",
      "Globals": "Toàn cục",
      "Got it!": "Đã hiểu!",
      "Heap Profile": "Hồ sơ Heap",
      "Heap Snapshot": "Ảnh chụp Heap",
      "How long to run the profile": "Thời gian chạy hồ sơ",
      "Ignore": "Bỏ qua",
      "Installation complete! The extension will be used after you restart your debug session.": "Cài đặt hoàn tất! Tiện ích mở rộng sẽ được sử dụng sau khi bạn khởi động lại phiên gỡ lỗi của mình.",
      "Installing the DWARF debugger...": "Đang cài đặt trình gỡ lỗi DWARF...",
      "Invalid expression": "Biểu thức không hợp lệ",
      "Invalid hit condition \"{0}\". Expected an expression like \"> 42\" or \"== 2\".": "Điều kiện truy cập \"{0}\" không hợp lệ. Mong đợi một biểu thức như \"> 42\" hoặc \"== 2\".",
      "It looks like a browser is already running from {0}. Please close it before trying to debug, otherwise VS Code may not be able to connect to it.": "Có vẻ như một trình duyệt đã chạy từ {0}. Vui lòng đóng nó trước khi cố gắng gỡ lỗi, nếu không VS Code có thể không thể kết nối với nó.",
      "It looks like your debug session has already ended. Try debugging again, then run the \"Debug: Diagnose Breakpoint Problems\" command.": "Có vẻ như phiên gỡ lỗi của bạn đã kết thúc. Hãy thử gỡ lỗi lại, sau đó chạy lệnh \"Gỡ lỗi: Chẩn đoán sự cố điểm ngắt\".",
      "It's taking a while to configure your breakpoints. You can speed this up by updating the 'outFiles' in your launch.json.": "Mất một thời gian để cấu hình các điểm ngắt của bạn. Bạn có thể tăng tốc điều này bằng cách cập nhật 'outFiles' trong launch.json của mình.",
      "JavaScript Debug Terminal": "Thiết bị đầu cuối gỡ lỗi JavaScript",
      "JavaScript debug adapter": "Bộ điều hợp gỡ lỗi JavaScript",
      "Launch Chrome against localhost": "Khởi chạy Chrome chống lại localhost",
      "Launch Edge against localhost": "Khởi chạy Edge chống lại localhost",
      "Launch Program": "Khởi chạy chương trình",
      "Launch configuration created based on 'package.json'.": "Cấu hình khởi chạy đã được tạo dựa trên 'package.json'.",
      "Launch configuration for '{0}' project created.": "Đã tạo cấu hình khởi chạy cho dự án '{0}'.",
      "Local": "Cục bộ",
      "Locals": "Cục bộ",
      "Lost connection to debugee, reconnecting in {0}ms\r\n": "Mất kết nối với debugee, đang kết nối lại sau {0}ms\r\n",
      "Manual": "Thủ công",
      "Missing source information. Did you set \"originalUrl\" or \"source\"?": "Thiếu thông tin nguồn. Bạn đã đặt \"originalUrl\" hoặc \"source\" chưa?",
      "Module": "Mô-đun",
      "Networking not available.": "Mạng không khả dụng.",
      "Never": "Không bao giờ",
      "No": "Không",
      "No npm scripts found in the workspace folder.": "Không tìm thấy tập lệnh npm nào trong thư mục không gian làm việc.",
      "No npm scripts found in your package.json": "Không tìm thấy tập lệnh npm nào trong package.json của bạn",
      "No package.json files found in your workspace.": "Không tìm thấy tệp package.json nào trong không gian làm việc của bạn.",
      "No workspace folder open.": "Không có thư mục không gian làm việc nào được mở.",
      "Node Attributes": "Thuộc tính Node",
      "Node.js version '{0}' not installed using version manager {1}.": "Phiên bản Node.js '{0}' không được cài đặt bằng trình quản lý phiên bản {1}.",
      "Not Now": "Không phải bây giờ",
      "Only objects can be queried": "Chỉ có thể truy vấn các đối tượng",
      "Open launch.json": "Mở launch.json",
      "Output has been truncated to the first {0} characters. Run `{1}` to copy the full output.": "Đầu ra đã bị cắt bớt thành {0} ký tự đầu tiên. Chạy `{1}` để sao chép toàn bộ đầu ra.",
      "Parameters": "Tham số",
      "Paused": "Đã tạm dừng",
      "Paused before Out Of Memory exception": "Đã tạm dừng trước ngoại lệ hết bộ nhớ",
      "Paused on Content Security Policy violation instrumentation breakpoint, directive \"{0}\"": "Đã tạm dừng tại điểm ngắt công cụ vi phạm chính sách bảo mật nội dung, chỉ thị \"{0}\"",
      "Paused on DOM breakpoint": "Đã tạm dừng tại điểm ngắt DOM",
      "Paused on WebGL Error instrumentation breakpoint, error \"{0}\"": "Đã tạm dừng tại điểm ngắt công cụ lỗi WebGL, lỗi \"{0}\"",
      "Paused on XMLHttpRequest or fetch": "Đã tạm dừng trên XMLHttpRequest hoặc fetch",
      "Paused on assert": "Đã tạm dừng trên assert",
      "Paused on breakpoint": "Đã tạm dừng tại điểm ngắt",
      "Paused on debug() call": "Đã tạm dừng tại lệnh gọi debug()",
      "Paused on debugger statement": "Đã tạm dừng tại câu lệnh debugger",
      "Paused on event listener": "Đã tạm dừng trên trình nghe sự kiện",
      "Paused on event listener breakpoint \"{0}\", triggered on \"{1}\"": "Đã tạm dừng tại điểm ngắt trình nghe sự kiện \"{0}\", được kích hoạt trên \"{1}\"",
      "Paused on exception": "Đã tạm dừng tại ngoại lệ",
      "Paused on frame entry": "Đã tạm dừng trên mục nhập khung",
      "Paused on instrumentation breakpoint": "Đã tạm dừng trên điểm ngắt công cụ",
      "Paused on instrumentation breakpoint \"{0}\"": "Đã tạm dừng trên điểm ngắt công cụ \"{0}\"",
      "Paused on {0}": "Đã tạm dừng trên {0}",
      "Pick Breakpoint": "Chọn điểm ngắt",
      "Pick the node.js process to attach to": "Chọn quy trình node.js để đính kèm",
      "Please enter a number": "Vui lòng nhập một số",
      "Please enter a number greater than 1": "Vui lòng nhập một số lớn hơn 1",
      "Please stop the running profile before starting a new one.": "Vui lòng dừng hồ sơ đang chạy trước khi bắt đầu hồ sơ mới.",
      "Process picker failed ({0})": "Trình chọn quy trình thất bại ({0})",
      "Profile duration in seconds, e.g \"5\"": "Thời lượng hồ sơ tính bằng giây, ví dụ \"5\"",
      "Profiling": "Lập hồ sơ",
      "Profiling with breakpoints enabled can change the performance of your code. It can be useful to validate your findings with the \"duration\" or \"manual\" termination conditions.": "Lập hồ sơ với các điểm ngắt được bật có thể thay đổi hiệu suất mã của bạn. Có thể hữu ích khi xác thực các phát hiện của bạn bằng các điều kiện kết thúc \"thời lượng\" hoặc \"thủ công\".",
      "Read More": "Đọc thêm",
      "Request Animation Frame": "Yêu cầu khung hình động",
      "Resume AudioContext": "Tiếp tục AudioContext",
      "Return value": "Giá trị trả về",
      "Run Current File": "Chạy tệp hiện tại",
      "Run Node.js tool": "Chạy công cụ Node.js",
      "Run Script: {0}": "Chạy tập lệnh: {0}",
      "Run Script: {0} ({1})": "Chạy tập lệnh: {0} ({1})",
      "Run for a specific amount of time": "Chạy trong một khoảng thời gian cụ thể",
      "Run until a specific breakpoint is hit": "Chạy cho đến khi đạt được một điểm ngắt cụ thể",
      "Run until manually stopped": "Chạy cho đến khi dừng thủ công",
      "Runs a Node.js command-line installed in the workspace node_modules.": "Chạy một dòng lệnh Node.js được cài đặt trong node_modules của không gian làm việc.",
      "Saving": "Đang lưu",
      "Script": "Tập lệnh",
      "Script Blocked by Content Security Policy": "Tập lệnh bị chặn bởi Chính sách bảo mật nội dung",
      "Script First Statement": "Tập lệnh câu lệnh đầu tiên",
      "Select a tab": "Chọn một tab",
      "Select a tool to run": "Chọn một công cụ để chạy",
      "Select current working directory for new terminal": "Chọn thư mục làm việc hiện tại cho thiết bị đầu cuối mới",
      "Select test configuration to run": "Chọn cấu hình kiểm thử để chạy",
      "Select the page where you want to open the devtools": "Chọn trang bạn muốn mở công cụ dành cho nhà phát triển",
      "Select the session you want to inspect:": "Chọn phiên bạn muốn kiểm tra:",
      "Seller Reporting Phase Start": "Người bán bắt đầu giai đoạn báo cáo",
      "Seller Scoring Phase Start": "Người bán bắt đầu giai đoạn chấm điểm",
      "Set innerHTML": "Đặt innerHTML",
      "Skipped by skipFiles": "Bỏ qua bởi skipFiles",
      "Skipped by smartStep": "Bỏ qua bởi smartStep",
      "Some breakpoints might not work in your version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes. Details: https://aka.ms/AAcsvqm": "Một số điểm ngắt có thể không hoạt động trong phiên bản Node.js của bạn. Chúng tôi khuyên bạn nên nâng cấp để nhận các bản sửa lỗi, cải thiện hiệu suất và bảo mật mới nhất. Chi tiết: https://aka.ms/AAcsvqm",
      "Source not a source map": "Nguồn không phải là bản đồ nguồn",
      "Source not found": "Không tìm thấy nguồn",
      "Stack frame not found": "Không tìm thấy khung ngăn xếp",
      "Starting profile...": "Đang bắt đầu lập hồ sơ...",
      "Stopping profile...": "Đang dừng lập hồ sơ...",
      "Suspend AudioContext": "Tạm dừng AudioContext",
      "Syntax error setting breakpoint with condition {0} on line {1}: {2}": "Lỗi cú pháp khi đặt điểm ngắt với điều kiện {0} trên dòng {1}: {2}",
      "Target page not found. You may need to update your \"urlFilter\" to match the page you want to debug.": "Không tìm thấy trang mục tiêu. Bạn có thể cần cập nhật \"urlFilter\" của mình để khớp với trang bạn muốn gỡ lỗi.",
      "The Node version in \"{0}\" is outdated (version {1}), we require at least Node 8.x.": "Phiên bản Node trong \"{0}\" đã lỗi thời (phiên bản {1}), chúng tôi yêu cầu ít nhất Node 8.x.",
      "The URL provided is invalid": "URL được cung cấp không hợp lệ",
      "The browser process exited with code {0} before connecting to the debug server. Make sure the `runtimeExecutable` is configured correctly and that it can run without errors.": "Quá trình trình duyệt đã thoát với mã {0} trước khi kết nối với máy chủ gỡ lỗi. Đảm bảo `runtimeExecutable` được cấu hình chính xác và nó có thể chạy mà không có lỗi.",
      "The configured `cwd` {0} does not exist.": "`cwd` đã cấu hình {0} không tồn tại.",
      "The configured `cwd` {0} is not a folder.": "`cwd` đã cấu hình {0} không phải là một thư mục.",
      "This is a missing file path referenced by a sourcemap. Would you like to debug the compiled version instead?": "Đây là đường dẫn tệp bị thiếu được tham chiếu bởi một bản đồ nguồn. Bạn có muốn gỡ lỗi phiên bản đã biên dịch thay thế không?",
      "Thread is not paused": "Luồng chưa được tạm dừng",
      "Thread is not paused on exception": "Luồng không bị tạm dừng trên ngoại lệ",
      "Thread not found": "Không tìm thấy luồng",
      "Type of profile": "Loại hồ sơ",
      "URL contains \"{0}\"": "URL chứa \"{0}\"",
      "UWP webview debugging is not available on your platform.": "Gỡ lỗi UWP webview không khả dụng trên nền tảng của bạn.",
      "Unable to attach to browser": "Không thể đính kèm vào trình duyệt",
      "Unable to evaluate": "Không thể đánh giá",
      "Unable to evaluate on async stack frame": "Không thể đánh giá trên khung ngăn xếp không đồng bộ",
      "Unable to find an installation of the browser on your system. Try installing it, or providing an absolute path to the browser in the \"runtimeExecutable\" in your launch.json.": "Không thể tìm thấy cài đặt trình duyệt trên hệ thống của bạn. Hãy thử cài đặt nó hoặc cung cấp đường dẫn tuyệt đối đến trình duyệt trong \"runtimeExecutable\" trong launch.json của bạn.",
      "Unable to find {0} version {1}. Available auto-discovered versions are: {2}. You can set the \"runtimeExecutable\" in your launch.json to one of these, or provide an absolute path to the browser executable.": "Không thể tìm thấy {0} phiên bản {1}. Các phiên bản tự động phát hiện có sẵn là: {2}. Bạn có thể đặt \"runtimeExecutable\" trong launch.json của mình thành một trong số này hoặc cung cấp đường dẫn tuyệt đối đến tệp thực thi trình duyệt.",
      "Unable to launch browser: \"{0}\"": "Không thể khởi chạy trình duyệt: \"{0}\"",
      "Unable to pause": "Không thể tạm dừng",
      "Unable to pretty print": "Không thể in đẹp",
      "Unable to resume": "Không thể tiếp tục",
      "Unable to retrieve source content": "Không thể truy xuất nội dung nguồn",
      "Unable to set variable value": "Không thể đặt giá trị biến",
      "Unable to step in": "Không thể bước vào",
      "Unable to step next": "Không thể bước tiếp theo",
      "Unable to step out": "Không thể bước ra",
      "Unbound breakpoint": "Điểm ngắt chưa liên kết",
      "Uncaught Exceptions": "Các ngoại lệ chưa được bắt",
      "Unknown error": "Lỗi không xác định",
      "VS Code can provide better debugging experience for WebAssembly via \"DWARF Debugging\" extension. Would you like to install it?/\"DWARF Debugging\" is the extension name and should not be localized.": "VS Code có thể cung cấp trải nghiệm gỡ lỗi tốt hơn cho WebAssembly thông qua tiện ích mở rộng \"DWARF Debugging\". Bạn có muốn cài đặt nó không?/\"DWARF Debugging\" là tên tiện ích mở rộng và không nên bản địa hóa.",
      "Variable not found": "Không tìm thấy biến",
      "Variables not available in async stacks": "Các biến không có sẵn trong ngăn xếp không đồng bộ",
      "WARNING: Processing source-maps of {0} took longer than {1} ms so we continued execution without waiting for all the breakpoints for the script to be set.": "CẢNH BÁO: Xử lý bản đồ nguồn của {0} mất hơn {1} ms nên chúng tôi tiếp tục thực thi mà không đợi tất cả các điểm ngắt cho tập lệnh được đặt.",
      "We can't launch a browser in debug mode from here. If you want to debug this webpage, open this workspace from VS Code on your desktop.": "Chúng tôi không thể khởi chạy trình duyệt ở chế độ gỡ lỗi từ đây. Nếu bạn muốn gỡ lỗi trang web này, hãy mở không gian làm việc này từ VS Code trên máy tính của bạn.",
      "We can't launch a browser in debug mode from here. Open this workspace in VS Code on your desktop to enable debugging.": "Chúng tôi không thể khởi chạy trình duyệt ở chế độ gỡ lỗi từ đây. Mở không gian làm việc này trong VS Code trên máy tính của bạn để bật gỡ lỗi.",
      "WebGL Error Fired": "Lỗi WebGL đã kích hoạt",
      "WebGL Warning Fired": "Cảnh báo WebGL đã kích hoạt",
      "With Block": "Với khối",
      "Would you like to save a configuration in your launch.json for easy access later?": "Bạn có muốn lưu cấu hình trong launch.json của mình để dễ dàng truy cập sau này không?",
      "XHR/Fetch URLs": "URL XHR/Fetch",
      "Yes": "Có",
      "You may install the `{}` module via npm for enhanced WebAssembly debugging": "Bạn có thể cài đặt mô-đun `{}` qua npm để gỡ lỗi WebAssembly nâng cao",
      "You need to open a workspace folder to debug npm scripts.": "Bạn cần mở một thư mục không gian làm việc để gỡ lỗi các tập lệnh npm.",
      "You're running an outdated version of Node.js. We recommend upgrading for the latest bug, performance, and security fixes.": "Bạn đang chạy phiên bản Node.js lỗi thời. Chúng tôi khuyên bạn nên nâng cấp để có các bản sửa lỗi, cải thiện hiệu suất và bảo mật mới nhất.",
      "an old debug session": "một phiên gỡ lỗi cũ",
      "breakpoint.provisionalBreakpoint": "breakpoint.provisionalBreakpoint",
      "path does not exist": "đường dẫn không tồn tại",
      "process id: {0} ({1})": "id quy trình: {0} ({1})",
      "process id: {0}, debug port: {1} ({2})": "id quy trình: {0}, cổng gỡ lỗi: {1} ({2})",
      "setInterval fired": "setInterval đã kích hoạt",
      "setTimeout fired": "setTimeout đã kích hoạt",
      "the configured userDataDir": "userDataDir đã cấu hình",
      "{0} (couldn't describe: {1})": "{0} (không thể mô tả: {1})",
      "{0} Click to Stop Profiling": "{0} Nhấp để dừng lập hồ sơ",
      "{0} Click to Stop Profiling ({1} sessions)": "{0} Nhấp để dừng lập hồ sơ ({1} phiên)",
      "{0} Click to Stop Profiling ({1})": "{0} Nhấp để dừng lập hồ sơ ({1})"
    }
  }
}
