{
  "": [
    "--------------------------------------------------------------------------------------------",
    "Copyright (c) Microsoft Corporation. All rights reserved.",
    "Licensed under the MIT License. See License.txt in the project root for license information.",
    "--------------------------------------------------------------------------------------------",
    "Do not edit this file. It is machine generated."
  ],
  "version": "1.0.0",
  "contents": {
    "bundle": {
      "\"store\" a boolean test for later evaluation in a guard or if().": "\"store\" một kiểm tra boolean để đánh giá sau này trong một guard hoặc if().",
      "'from' expected": "Mong đợi 'from'",
      "'in' expected": "Mong đợi 'in'",
      "'through' or 'to' expected": "Mong đợi 'through' hoặc 'to'",
      "'{0}'": "'{0}'",
      "( expected": "Mong đợi (",
      ") expected": "Mong đợi )",
      "<undefined>": "<không xác định>",
      "@font-face": "@font-face",
      "@font-face rule must define 'src' and 'font-family' properties": "Quy tắc @font-face phải định nghĩa thuộc tính 'src' và 'font-family'.",
      "@keyframes {0}": "@keyframes {0}",
      "A list of properties that are not validated against the `unknownProperties` rule.": "Danh sách các thuộc tính không được xác thực theo quy tắc `unknownProperties`.",
      "Adds quotes to a string.": "Thêm dấu ngoặc kép vào một chuỗi.",
      "Also define the standard property '{0}' for compatibility": "Cũng định nghĩa thuộc tính chuẩn '{0}' để tương thích",
      "Always define standard rule '@keyframes' when defining keyframes.": "Luôn định nghĩa quy tắc chuẩn '@keyframes' khi định nghĩa keyframe.",
      "Always include all vendor specific properties: Missing: {0}": "Luôn bao gồm tất cả các thuộc tính riêng của nhà cung cấp: Thiếu: {0}",
      "Always include all vendor specific rules: Missing: {0}": "Luôn bao gồm tất cả các quy tắc riêng của nhà cung cấp: Thiếu: {0}",
      "Appends a single value onto the end of a list.": "Nối một giá trị duy nhất vào cuối danh sách.",
      "Appends selectors to one another without spaces in between.": "Nối các bộ chọn vào nhau mà không có khoảng trắng ở giữa.",
      "Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Tránh sử dụng !important. Nó là dấu hiệu cho thấy độ đặc hiệu của toàn bộ CSS đã mất kiểm soát và cần được cấu trúc lại.",
      "Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Tránh sử dụng 'float'. Float dẫn đến CSS dễ vỡ, dễ bị hỏng nếu một khía cạnh của bố cục thay đổi.",
      "Causes one or more rules to be emitted at the root of the document.": "Khiến một hoặc nhiều quy tắc được phát ra ở gốc tài liệu.",
      "Changes one or more properties of a color.": "Thay đổi một hoặc nhiều thuộc tính của một màu.",
      "Changes the alpha component for a color.": "Thay đổi thành phần alpha cho một màu.",
      "Changes the hue of a color.": "Thay đổi tông màu của một màu.",
      "Character entity representing '{0}'": "Thực thể ký tự đại diện cho '{0}'",
      "Character entity representing '{0}', unicode equivalent '{1}'": "Thực thể ký tự đại diện cho '{0}', tương đương unicode '{1}'",
      "Closing bracket expected.": "Mong đợi dấu ngoặc đóng.",
      "Closing bracket missing.": "Thiếu dấu ngoặc đóng.",
      "Combines several lists into a single multidimensional list.": "Kết hợp nhiều danh sách thành một danh sách đa chiều duy nhất.",
      "Configure": "Cấu hình",
      "Converts a color into the format understood by IE filters.": "Chuyển đổi một màu sang định dạng được hiểu bởi bộ lọc IE.",
      "Converts a color to grayscale.": "Chuyển đổi một màu sang thang độ xám.",
      "Converts a string to lower case.": "Chuyển đổi một chuỗi sang chữ thường.",
      "Converts a string to upper case.": "Chuyển đổi một chuỗi sang chữ hoa.",
      "Converts a unitless number to a percentage.": "Chuyển đổi một số không có đơn vị thành một tỷ lệ phần trăm.",
      "Creates a Color from hue, saturation, and lightness values.": "Tạo một Màu từ các giá trị tông màu, độ bão hòa và độ sáng.",
      "Creates a Color from hue, saturation, lightness, and alpha values.": "Tạo một Màu từ các giá trị tông màu, độ bão hòa, độ sáng và alpha.",
      "Creates a Color from hue, white, and black values.": "Tạo một Màu từ các giá trị tông màu, trắng và đen.",
      "Creates a Color from lightness, a, and b values.": "Tạo một Màu từ các giá trị độ sáng, a và b.",
      "Creates a Color from lightness, chroma, and hue values.": "Tạo một Màu từ các giá trị độ sáng, sắc độ và tông màu.",
      "Creates a Color from red, green, and blue values.": "Tạo một Màu từ các giá trị đỏ, xanh lá cây và xanh lam.",
      "Creates a Color from red, green, blue, and alpha values.": "Tạo một Màu từ các giá trị đỏ, xanh lá cây, xanh lam và alpha.",
      "Creates a Color from the hue, saturation, and lightness values of another Color.": "Tạo một Màu từ các giá trị tông màu, độ bão hòa và độ sáng của một Màu khác.",
      "Creates a Color from the hue, white, and black values of another Color.": "Tạo một Màu từ các giá trị tông màu, trắng và đen của một Màu khác.",
      "Creates a Color from the lightness, a, and b values of another Color.": "Tạo một Màu từ các giá trị độ sáng, a và b của một Màu khác.",
      "Creates a Color from the lightness, chroma, and hue values of another Color.": "Tạo một Màu từ các giá trị độ sáng, sắc độ và tông màu của một Màu khác.",
      "Creates a Color from the red, green, and blue values of another Color.": "Tạo một Màu từ các giá trị đỏ, xanh lá cây và xanh lam của một Màu khác.",
      "Creates a Color in a specific color space from red, green, and blue values.": "Tạo một Màu trong không gian màu cụ thể từ các giá trị đỏ, xanh lá cây và xanh lam.",
      "Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Tạo một Màu trong không gian màu cụ thể từ các giá trị đỏ, xanh lá cây và xanh lam của một Màu khác.",
      "Defines complex operations that can be re-used throughout stylesheets.": "Định nghĩa các phép toán phức tạp có thể được sử dụng lại trong toàn bộ bảng định kiểu.",
      "Defines styles that can be re-used throughout the stylesheet with `@include`.": "Định nghĩa các kiểu có thể được sử dụng lại trong toàn bộ bảng định kiểu với `@include`.",
      "Do not use duplicate style definitions": "Không sử dụng định nghĩa kiểu trùng lặp",
      "Do not use empty rulesets": "Không sử dụng bộ quy tắc trống",
      "Do not use width or height when using padding or border": "Không sử dụng width hoặc height khi sử dụng padding hoặc border",
      "Dynamically calls a Sass function.": "Gọi động một hàm Sass.",
      "Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Vòng lặp `each` đặt `$var` thành từng mục trong danh sách hoặc bản đồ, sau đó xuất các kiểu mà nó chứa bằng cách sử dụng giá trị đó của `$var`.",
      "End tag name expected.": "Mong đợi tên thẻ kết thúc.",
      "Exposes the details of Sass’s inner workings.": "Tiết lộ chi tiết hoạt động bên trong của Sass.",
      "Extends $extendee with $extender within $selector.": "Mở rộng $extendee với $extender trong $selector.",
      "Extracts a substring from $string.": "Trích xuất một chuỗi con từ $string.",
      "Finds the maximum of several numbers.": "Tìm số lớn nhất trong nhiều số.",
      "Finds the minimum of several numbers.": "Tìm số nhỏ nhất trong nhiều số.",
      "Fluidly scales one or more properties of a color.": "Thay đổi tỷ lệ linh hoạt một hoặc nhiều thuộc tính của một màu.",
      "Folding Region End": "Kết thúc vùng gấp",
      "Folding Region Start": "Bắt đầu vùng gấp",
      "For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Vòng lặp `for` lặp đi lặp lại một tập hợp các kiểu cho mỗi `$var` trong mệnh đề `from/through` hoặc `from/to`.",
      "Generates new colors based on existing ones, making it easy to build color themes.": "Tạo màu mới dựa trên các màu hiện có, giúp dễ dàng xây dựng chủ đề màu sắc.",
      "Gets the blue component of a color.": "Lấy thành phần màu xanh lam của một màu.",
      "Gets the green component of a color.": "Lấy thành phần màu xanh lá cây của một màu.",
      "Gets the hue component of a color.": "Lấy thành phần tông màu của một màu.",
      "Gets the lightness component of a color.": "Lấy thành phần độ sáng của một màu.",
      "Gets the opacity component of a color.": "Lấy thành phần độ mờ của một màu.",
      "Gets the red component of a color.": "Lấy thành phần màu đỏ của một màu.",
      "Gets the saturation component of a color.": "Lấy thành phần độ bão hòa của một màu.",
      "HTML Language Server": "Máy chủ ngôn ngữ HTML",
      "Hex colors must consist of three, four, six or eight hex numbers": "Màu hex phải bao gồm ba, bốn, sáu hoặc tám số hex",
      "IE hacks are only necessary when supporting IE7 and older": "Các bản hack IE chỉ cần thiết khi hỗ trợ IE7 trở xuống",
      "Import statements do not load in parallel": "Các câu lệnh import không tải song song",
      "Includes the body if the expression does not evaluate to `false` or `null`.": "Bao gồm phần thân nếu biểu thức không đánh giá thành `false` hoặc `null`.",
      "Includes the styles defined by another mixin into the current rule.": "Bao gồm các kiểu được định nghĩa bởi một mixin khác vào quy tắc hiện tại.",
      "Increases or decreases one or more components of a color.": "Tăng hoặc giảm một hoặc nhiều thành phần của một màu.",
      "Inherits the styles of another selector.": "Thừa hưởng các kiểu của một bộ chọn khác.",
      "Inserts $insert into $string at $index.": "Chèn $insert vào $string tại $index.",
      "Invalid number of parameters": "Số tham số không hợp lệ",
      "Joins together two lists into one.": "Kết hợp hai danh sách thành một.",
      "Lets you access and modify values in lists.": "Cho phép bạn truy cập và sửa đổi các giá trị trong danh sách.",
      "Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Tải một stylesheet Sass và làm cho các mixin, hàm và biến của nó khả dụng khi stylesheet này được tải bằng quy tắc @use.",
      "Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Tải các mixin, hàm và biến từ các stylesheet Sass khác dưới dạng 'module', và kết hợp CSS từ nhiều stylesheet với nhau.",
      "Makes a color darker.": "Làm màu tối hơn.",
      "Makes a color less saturated.": "Làm màu ít bão hòa hơn.",
      "Makes a color lighter.": "Làm màu sáng hơn.",
      "Makes a color more opaque.": "Làm màu mờ hơn.",
      "Makes a color more saturated.": "Làm màu bão hòa hơn.",
      "Makes a color more transparent.": "Làm màu trong suốt hơn.",
      "Makes it easy to combine, search, or split apart strings.": "Giúp dễ dàng kết hợp, tìm kiếm hoặc tách các chuỗi.",
      "Makes it possible to look up the value associated with a key in a map, and much more.": "Giúp có thể tra cứu giá trị liên quan đến một khóa trong một bản đồ, và nhiều hơn nữa.",
      "Merges two maps together into a new map.": "Gộp hai bản đồ lại với nhau thành một bản đồ mới.",
      "Mix two colors together in a polar color space.": "Trộn hai màu với nhau trong không gian màu cực.",
      "Mix two colors together in a rectangular color space.": "Trộn hai màu với nhau trong không gian màu hình chữ nhật.",
      "Mixes two colors together.": "Trộn hai màu với nhau.",
      "Nests selector beneath one another like they would be nested in the stylesheet.": "Lồng các bộ chọn bên dưới nhau như cách chúng sẽ được lồng trong bảng định kiểu.",
      "No unit for zero needed": "Không cần đơn vị cho số không",
      "Parses a selector into the format returned by &.": "Phân tích cú pháp một bộ chọn thành định dạng được trả về bởi &.",
      "Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "In giá trị của một biểu thức ra luồng lỗi tiêu chuẩn. Hữu ích cho việc gỡ lỗi các tệp Sass phức tạp.",
      "Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "In giá trị của một biểu thức ra luồng lỗi tiêu chuẩn. Hữu ích cho các thư viện cần cảnh báo người dùng về việc không dùng nữa hoặc phục hồi từ các lỗi sử dụng mixin nhỏ. Các cảnh báo có thể được tắt bằng tùy chọn dòng lệnh `--quiet` hoặc tùy chọn Sass `:quiet`.",
      "Property is ignored due to the display.": "Thuộc tính bị bỏ qua do hiển thị.",
      "Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Thuộc tính bị bỏ qua do hiển thị. Với 'display: block', không nên sử dụng vertical-align.",
      "Provides access to Sass’s powerful selector engine.": "Cung cấp quyền truy cập vào công cụ chọn mạnh mẽ của Sass.",
      "Provides functions that operate on numbers.": "Cung cấp các hàm hoạt động trên số.",
      "Removes quotes from a string.": "Xóa dấu ngoặc kép khỏi một chuỗi.",
      "Rename to '{0}'": "Đổi tên thành '{0}'",
      "Replaces $original with $replacement within $selector.": "Thay thế $original bằng $replacement trong $selector.",
      "Replaces the nth item in a list.": "Thay thế mục thứ n trong danh sách.",
      "Returns a list of all keys in a map.": "Trả về một danh sách tất cả các khóa trong một bản đồ.",
      "Returns a list of all values in a map.": "Trả về một danh sách tất cả các giá trị trong một bản đồ.",
      "Returns a new map with keys removed.": "Trả về một bản đồ mới với các khóa đã bị xóa.",
      "Returns a random number.": "Trả về một số ngẫu nhiên.",
      "Returns a specific item in a list.": "Trả về một mục cụ thể trong danh sách.",
      "Returns the absolute value of a number.": "Trả về giá trị tuyệt đối của một số.",
      "Returns the complement of a color.": "Trả về màu bổ sung của một màu.",
      "Returns the index of the first occurance of $substring in $string.": "Trả về chỉ mục của lần xuất hiện đầu tiên của $substring trong $string.",
      "Returns the inverse of a color.": "Trả về màu đảo ngược của một màu.",
      "Returns the keywords passed to a function that takes variable arguments.": "Trả về các từ khóa được truyền cho một hàm nhận đối số biến.",
      "Returns the length of a list.": "Trả về độ dài của một danh sách.",
      "Returns the number of characters in a string.": "Trả về số ký tự trong một chuỗi.",
      "Returns the position of a value within a list.": "Trả về vị trí của một giá trị trong danh sách.",
      "Returns the separator of a list.": "Trả về dấu phân cách của một danh sách.",
      "Returns the simple selectors that comprise a compound selector.": "Trả về các bộ chọn đơn giản cấu thành một bộ chọn phức hợp.",
      "Returns the string representation of a value as it would be represented in Sass.": "Trả về biểu diễn chuỗi của một giá trị như nó sẽ được biểu diễn trong Sass.",
      "Returns the type of a value.": "Trả về kiểu của một giá trị.",
      "Returns the unit(s) associated with a number.": "Trả về đơn vị (các) liên quan đến một số.",
      "Returns the value in a map associated with a given key.": "Trả về giá trị trong một bản đồ liên quan đến một khóa đã cho.",
      "Returns whether $super matches all the elements $sub does, and possibly more.": "Trả về liệu $super có khớp với tất cả các phần tử mà $sub khớp, và có thể nhiều hơn.",
      "Returns whether a feature exists in the current Sass runtime.": "Trả về liệu một tính năng có tồn tại trong thời gian chạy Sass hiện tại hay không.",
      "Returns whether a function with the given name exists.": "Trả về liệu một hàm có tên đã cho có tồn tại hay không.",
      "Returns whether a map has a value associated with a given key.": "Trả về liệu một bản đồ có giá trị liên quan đến một khóa đã cho hay không.",
      "Returns whether a mixin with the given name exists.": "Trả về liệu một mixin có tên đã cho có tồn tại hay không.",
      "Returns whether a number has units.": "Trả về liệu một số có đơn vị hay không.",
      "Returns whether a variable with the given name exists in the current scope.": "Trả về liệu một biến có tên đã cho có tồn tại trong phạm vi hiện tại hay không.",
      "Returns whether a variable with the given name exists in the global scope.": "Trả về liệu một biến có tên đã cho có tồn tại trong phạm vi toàn cục hay không.",
      "Returns whether two numbers can be added, subtracted, or compared.": "Trả về liệu hai số có thể được cộng, trừ hoặc so sánh hay không.",
      "Rounds a number down to the previous whole number.": "Làm tròn một số xuống số nguyên trước đó.",
      "Rounds a number to the nearest whole number.": "Làm tròn một số đến số nguyên gần nhất.",
      "Rounds a number up to the next whole number.": "Làm tròn một số lên số nguyên tiếp theo.",
      "Sass documentation": "Tài liệu Sass",
      "Selector Specificity": "Độ đặc hiệu của bộ chọn",
      "Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Các bộ chọn không nên chứa ID vì các quy tắc này quá gắn chặt với HTML.",
      "Simple HTML5 starting point": "Điểm khởi đầu HTML5 đơn giản",
      "Start tag name expected.": "Mong đợi tên thẻ bắt đầu.",
      "Tag name must directly follow the open bracket.": "Tên thẻ phải trực tiếp theo sau dấu ngoặc mở.",
      "The universal selector (*) is known to be slow": "Bộ chọn tổng quát (*) được biết là chậm",
      "Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Ném giá trị của một biểu thức dưới dạng lỗi nghiêm trọng với dấu vết ngăn xếp. Hữu ích cho việc xác thực các đối số cho mixin và hàm.",
      "URI expected": "Mong đợi URI",
      "URL encodes a string": "Mã hóa URL một chuỗi",
      "Unexpected character in tag.": "Ký tự không mong đợi trong thẻ.",
      "Unifies two selectors to produce a selector that matches elements matched by both.": "Thống nhất hai bộ chọn để tạo ra một bộ chọn khớp với các phần tử được cả hai khớp.",
      "Unknown at-rule.": "Quy tắc @ không xác định.",
      "Unknown property.": "Thuộc tính không xác định.",
      "Unknown property: '{0}'": "Thuộc tính không xác định: '{0}'",
      "Unknown vendor specific property.": "Thuộc tính riêng của nhà cung cấp không xác định.",
      "VS Code now has built-in support for auto-renaming tags. Do you want to enable it?": "VS Code hiện có hỗ trợ tích hợp sẵn để tự động đổi tên thẻ. Bạn có muốn bật nó không?",
      "When using a vendor-specific prefix also include the standard property": "Khi sử dụng tiền tố dành riêng cho nhà cung cấp, cũng bao gồm thuộc tính tiêu chuẩn",
      "When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Khi sử dụng tiền tố dành riêng cho nhà cung cấp, hãy đảm bảo cũng bao gồm tất cả các thuộc tính dành riêng cho nhà cung cấp khác",
      "While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Vòng lặp `while` nhận một biểu thức và lặp đi lặp lại các kiểu lồng nhau cho đến khi câu lệnh đánh giá thành `false`.",
      "[ expected": "Mong đợi [",
      "] expected": "Mong đợi ]",
      "absolute value of a number": "giá trị tuyệt đối của một số",
      "arccosine - inverse of cosine function": "arccosin - hàm ngược của hàm cosin",
      "arcsine - inverse of sine function": "arcsin - hàm ngược của hàm sin",
      "arctangent - inverse of tangent function": "arctangent - hàm ngược của hàm tangent",
      "argument from '{0}'": "đối số từ '{0}'",
      "at-rule or selector expected": "Mong đợi quy tắc @ hoặc bộ chọn",
      "at-rule unknown": "Quy tắc @ không xác định",
      "bind the evaluation of a ruleset to each member of a list.": "Gắn kết việc đánh giá một tập hợp các quy tắc với mỗi thành viên của một danh sách.",
      "calculates square root of a number": "tính căn bậc hai của một số",
      "colon expected": "Mong đợi dấu hai chấm",
      "comma expected": "Mong đợi dấu phẩy",
      "condition expected": "Mong đợi điều kiện",
      "converts numbers from one type into another": "chuyển đổi số từ loại này sang loại khác",
      "converts to a %, e.g. 0.5 > 50%": "chuyển đổi thành %, ví dụ 0.5 > 50%",
      "cosine function": "hàm cosin",
      "creates a #AARRGGBB": "tạo một #AARRGGBB",
      "creates a color": "tạo một màu",
      "css.builtin.lab": "css.builtin.lab",
      "dot expected": "Mong đợi dấu chấm",
      "escape string content": "thoát nội dung chuỗi",
      "expression expected": "Mong đợi biểu thức.",
      "first argument modulus second argument": "số dư của đối số thứ nhất chia cho đối số thứ hai",
      "first argument raised to the power of the second argument": "đối số thứ nhất lũy thừa đối số thứ hai",
      "generate a list spanning a range of values": "tạo một danh sách bao gồm một dải giá trị",
      "identifier expected": "Mong đợi định danh",
      "identifier or variable expected": "Mong đợi định danh hoặc biến",
      "identifier or wildcard expected": "Mong đợi định danh hoặc ký tự đại diện",
      "inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "inline-block bị bỏ qua do float. Nếu 'float' có giá trị khác 'none', hộp sẽ được float và 'display' được coi là 'block'",
      "inlines a resource and falls back to `url()`": "nội tuyến một tài nguyên và quay lại `url()`",
      "media query expected": "Mong đợi truy vấn phương tiện",
      "number expected": "Mong đợi số",
      "operator expected": "Mong đợi toán tử",
      "page directive or declaraton expected": "Mong đợi chỉ thị trang hoặc khai báo",
      "parses a string to a color": "phân tích cú pháp một chuỗi thành một màu",
      "percentage expected": "Mong đợi tỷ lệ phần trăm",
      "property value expected": "Mong đợi giá trị thuộc tính",
      "remove or change the unit of a dimension": "xóa hoặc thay đổi đơn vị của một kích thước",
      "return `@color` 10% points darker": "trả về `@color` tối hơn 10% điểm",
      "return `@color` 10% points less saturated": "trả về `@color` ít bão hòa hơn 10% điểm",
      "return `@color` 10% points less transparent": "trả về `@color` ít trong suốt hơn 10% điểm",
      "return `@color` 10% points lighter": "trả về `@color` sáng hơn 10% điểm",
      "return `@color` 10% points more saturated": "trả về `@color` bão hòa hơn 10% điểm",
      "return `@color` 10% points more transparent": "trả về `@color` trong suốt hơn 10% điểm",
      "return `@color` with 50% transparency": "trả về `@color` với độ trong suốt 50%",
      "return `@color` with a 10 degree larger in hue": "trả về `@color` với tông màu lớn hơn 10 độ",
      "return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "trả về `@darkcolor` nếu `@color1 lớn hơn 43% luma` nếu không thì trả về `@lightcolor`, xem ghi chú",
      "return a mix of `@color1` and `@color2`": "trả về sự kết hợp giữa `@color1` và `@color2`",
      "returns a grey, 100% desaturated color": "trả về màu xám, màu hoàn toàn khử bão hòa",
      "returns a value at the specified position in the list": "trả về một giá trị tại vị trí được chỉ định trong danh sách",
      "returns one of two values depending on a condition.": "trả về một trong hai giá trị tùy thuộc vào một điều kiện.",
      "returns pi": "trả về pi",
      "returns the `alpha` channel of `@color`": "trả về kênh `alpha` của `@color`",
      "returns the `blue` channel of `@color`": "trả về kênh `blue` của `@color`",
      "returns the `green` channel of `@color`": "trả về kênh `green` của `@color`",
      "returns the `hue` channel of `@color` in the HSL space": "trả về kênh `hue` của `@color` trong không gian HSL",
      "returns the `hue` channel of `@color` in the HSV space": "trả về kênh `hue` của `@color` trong không gian HSV",
      "returns the `lightness` channel of `@color` in the HSL space": "trả về kênh `lightness` của `@color` trong không gian HSL",
      "returns the `luma` value (perceptual brightness) of `@color`": "trả về giá trị `luma` (độ sáng cảm nhận) của `@color`",
      "returns the `red` channel of `@color`": "trả về kênh `red` của `@color`",
      "returns the `saturation` channel of `@color` in the HSL space": "trả về kênh `saturation` của `@color` trong không gian HSL",
      "returns the `saturation` channel of `@color` in the HSV space": "trả về kênh `saturation` của `@color` trong không gian HSV",
      "returns the `value` channel of `@color` in the HSV space": "trả về kênh `value` của `@color` trong không gian HSV",
      "returns the lowest of one or more values": "trả về giá trị thấp nhất của một hoặc nhiều giá trị",
      "returns the number of elements in a value list": "trả về số lượng phần tử trong danh sách giá trị",
      "rounds a number to a number of places": "làm tròn một số đến một số vị trí",
      "rounds down to an integer": "làm tròn xuống số nguyên",
      "rounds up to an integer": "làm tròn lên số nguyên",
      "selector expected": "Mong đợi bộ chọn",
      "semi-colon expected": "Mong đợi dấu chấm phẩy",
      "sine function": "hàm sin",
      "string literal expected": "Mong đợi hằng chuỗi",
      "string replace": "thay thế chuỗi",
      "tangent function": "hàm tangent",
      "term expected": "Mong đợi thuật ngữ",
      "unknown keyword": "Từ khóa không xác định",
      "uri or string expected": "Mong đợi URI hoặc chuỗi",
      "variable name expected": "Mong đợi tên biến",
      "variable value expected": "Mong đợi giá trị biến",
      "whitespace expected": "Mong đợi khoảng trắng",
      "wildcard expected": "Mong đợi ký tự đại diện",
      "{ expected": "Mong đợi {",
      "{0}, '{1}'": "{0}, '{1}'",
      "} expected": "Mong đợi }"
    },
    "package": {
      "description": "Cung cấp hỗ trợ ngôn ngữ phong phú cho các tệp HTML và Handlebar",
      "displayName": "Tính năng ngôn ngữ HTML",
      "html.autoClosingTags": "Bật/tắt tự động đóng thẻ HTML.",
      "html.autoCreateQuotes": "Bật/tắt tự động tạo dấu ngoặc kép cho gán thuộc tính HTML. Loại dấu ngoặc kép có thể được cấu hình bằng `#html.completion.attributeDefaultValue#`.",
      "html.completion.attributeDefaultValue": "Kiểm soát giá trị mặc định của thuộc tính khi chấp nhận hoàn thành.",
      "html.completion.attributeDefaultValue.doublequotes": "Giá trị thuộc tính được đặt thành \"\".",
      "html.completion.attributeDefaultValue.empty": "Không có giá trị thuộc tính nào được đặt.",
      "html.completion.attributeDefaultValue.singlequotes": "Giá trị thuộc tính được đặt thành ''.",
      "html.customData.desc": "Danh sách các đường dẫn tệp tương đối đến các tệp JSON ở [định dạng dữ liệu tùy chỉnh](https://github.com/microsoft/vscode-html-languageservice/blob/master/docs/customData.md).\r\n\r\nVS Code sẽ tải dữ liệu tùy chỉnh khi khởi động để nâng cao hỗ trợ HTML của nó cho các thẻ HTML, thuộc tính và giá trị thuộc tính tùy chỉnh mà bạn đã chỉ định trong các tệp JSON.\r\n\r\nCác đường dẫn tệp này tương đối với không gian làm việc và chỉ cài đặt thư mục không gian làm việc mới được xem xét.",
      "html.format.contentUnformatted.desc": "Danh sách các thẻ (phân cách bằng dấu phẩy) mà nội dung bên trong sẽ không được định dạng lại. 'null' mặc định cho thẻ 'pre'.",
      "html.format.enable.desc": "Bật hoặc tắt trình định dạng HTML mặc định.",
      "html.format.extraLiners.desc": "Danh sách các thẻ (phân cách bằng dấu phẩy) mà trước chúng sẽ có thêm dòng mới. Nếu 'null', mặc định bao gồm `'head, body, /html'`.",
      "html.format.indentHandlebars.desc": "Định dạng và thụt lề `{{#foo}}` và `{{/foo}}`.",
      "html.format.indentInnerHtml.desc": "Thụt lề các phần ``<head>`` và ``<body>``.",
      "html.format.maxPreserveNewLines.desc": "Số lượng dòng mới tối đa được giữ lại trong một khối. Nếu 'null', không có giới hạn.",
      "html.format.preserveNewLines.desc": "Kiểm soát liệu các dòng mới hiện có trước các phần tử có nên được giữ lại hay không. Chỉ áp dụng cho trước các phần tử, không áp dụng cho bên trong thẻ hoặc văn bản.",
      "html.format.templating.desc": "Chấp nhận các thẻ ngôn ngữ khuôn mẫu django, erb, handlebars và php.",
      "html.format.unformatted.desc": "Danh sách các thẻ (phân cách bằng dấu phẩy) mà nội dung bên trong sẽ không được định dạng lại. Nếu 'null', mặc định bao gồm tất cả các thẻ được liệt kê tại https://www.w3.org/TR/html5/dom.html#phrasing-content.",
      "html.format.unformattedContentDelimiter.desc": "Giữ nguyên nội dung văn bản giữa các chuỗi này.",
      "html.format.wrapAttributes.alignedmultiple": "Khi vượt quá độ dài ngắt dòng, các thuộc tính sẽ được căn chỉnh theo chiều dọc.",
      "html.format.wrapAttributes.auto": "Chỉ ngắt dòng các thuộc tính khi vượt quá độ dài dòng.",
      "html.format.wrapAttributes.desc": "Ngắt dòng các thuộc tính.",
      "html.format.wrapAttributes.force": "Ngắt dòng mỗi thuộc tính ngoại trừ thuộc tính đầu tiên.",
      "html.format.wrapAttributes.forcealign": "Ngắt dòng mỗi thuộc tính ngoại trừ thuộc tính đầu tiên và giữ căn chỉnh.",
      "html.format.wrapAttributes.forcemultiline": "Ngắt dòng mỗi thuộc tính.",
      "html.format.wrapAttributes.preserve": "Giữ nguyên bao gói thuộc tính.",
      "html.format.wrapAttributes.preservealigned": "Giữ nguyên bao gói thuộc tính, nhưng căn chỉnh.",
      "html.format.wrapAttributesIndentSize.desc": "Thụt lề các thuộc tính đã ngắt dòng theo N ký tự. Sử dụng 'null' để sử dụng kích thước thụt lề mặc định. Thuộc tính này bị bỏ qua nếu `#html.format.wrapAttributes#` được đặt thành 'aligned'.",
      "html.format.wrapLineLength.desc": "Số ký tự tối đa trên mỗi dòng (0 = tắt).",
      "html.hover.documentation": "Hiển thị tài liệu thẻ và thuộc tính trong hover.",
      "html.hover.references": "Hiển thị các tham chiếu từ MDN trong hover.",
      "html.mirrorCursorOnMatchingTag": "Bật/tắt con trỏ phản chiếu trên thẻ HTML khớp.",
      "html.mirrorCursorOnMatchingTagDeprecationMessage": "Đã lỗi thời, vui lòng sử dụng \"editor.linkedEditing\" thay thế",
      "html.suggest.html5.desc": "Cấu hình liệu hỗ trợ ngôn ngữ HTML tích hợp sẵn có gợi ý thẻ, thuộc tính và giá trị HTML5 hay không.",
      "html.trace.server.desc": "Theo dõi giao tiếp giữa VS Code và máy chủ ngôn ngữ HTML.",
      "html.validate.scripts": "Cấu hình liệu hỗ trợ ngôn ngữ HTML tích hợp sẵn có xác thực các script nhúng hay không.",
      "html.validate.styles": "Cấu hình liệu hỗ trợ ngôn ngữ HTML tích hợp sẵn có xác thực các kiểu nhúng hay không."
    }
  }
}
