{
  "": [
    "--------------------------------------------------------------------------------------------",
    "Copyright (c) Microsoft Corporation. All rights reserved.",
    "Licensed under the MIT License. See License.txt in the project root for license information.",
    "--------------------------------------------------------------------------------------------",
    "Do not edit this file. It is machine generated."
  ],
  "version": "1.0.0",
  "contents": {
    "bundle": {
      "Checkout on vscode.dev": "Checkout trên vscode.dev",
      "Commit Changes": "Commit thay đổi",
      "Copy Anyway": "Dù sao cũng sao chép",
      "Copy vscode.dev Link": "Sao chép liên kết vscode.dev",
      "Create Fork": "Tạo Fork",
      "Create GitHub fork": "Tạo fork GitHub",
      "Create PR": "Tạo PR",
      "Creating GitHub Pull Request...": "Đang tạo Yêu cầu kéo GitHub...",
      "Creating first commit": "Đang tạo commit đầu tiên",
      "Forking \"{0}/{1}\"...": "Đang fork \"{0}/{1}\"...",
      "Learn More": "Tìm hiểu thêm",
      "Log level: {0}": "Mức ghi nhật ký: {0}",
      "No": "Không",
      "No GitHub remotes found that contain this commit.": "Không tìm thấy remote GitHub nào chứa commit này.",
      "No template": "Không có mẫu",
      "Open PR": "Mở PR",
      "Open on GitHub": "Mở trên GitHub",
      "Pick a folder to publish to GitHub": "Chọn một thư mục để xuất bản lên GitHub",
      "Publish Branch & Copy Link": "Xuất bản nhánh & Sao chép liên kết",
      "Publishing to a private GitHub repository": "Đang xuất bản lên kho lưu trữ GitHub riêng tư",
      "Publishing to a public GitHub repository": "Đang xuất bản lên kho lưu trữ GitHub công khai",
      "Pull Changes & Copy Link": "Kéo thay đổi & Sao chép liên kết",
      "Push Commits & Copy Link": "Đẩy Commit & Sao chép liên kết",
      "Pushing changes...": "Đang đẩy thay đổi...",
      "Select the Pull Request template": "Chọn mẫu Yêu cầu kéo",
      "Select which files should be included in the repository.": "Chọn những tệp nào nên được bao gồm trong kho lưu trữ.",
      "Successfully published the \"{0}\" repository to GitHub.": "Đã xuất bản thành công kho lưu trữ \"{0}\" lên GitHub.",
      "The PR \"{0}/{1}#{2}\" was successfully created on GitHub.": "PR \"{0}/{1}#{2}\" đã được tạo thành công trên GitHub.",
      "The current branch has unpublished commits. Would you like to push your commits before copying a link?": "Nhánh hiện tại có các commit chưa được xuất bản. Bạn có muốn đẩy các commit của mình trước khi sao chép liên kết không?",
      "The current branch is not published to the remote. Would you like to publish your branch before copying a link?": "Nhánh hiện tại chưa được xuất bản lên remote. Bạn có muốn xuất bản nhánh của mình trước khi sao chép liên kết không?",
      "The current branch is not up to date. Would you like to pull before copying a link?": "Nhánh hiện tại không được cập nhật. Bạn có muốn kéo trước khi sao chép liên kết không?",
      "The current file has uncommitted changes. Please commit your changes before copying a link.": "Tệp hiện tại có các thay đổi chưa được commit. Vui lòng commit các thay đổi của bạn trước khi sao chép liên kết.",
      "The fork \"{0}\" was successfully created on GitHub.": "Fork \"{0}\" đã được tạo thành công trên GitHub.",
      "Uploading files": "Đang tải lên tệp",
      "You don't have permissions to push to \"{0}/{1}\" on GitHub. Would you like to create a fork and push to it instead?": "Bạn không có quyền đẩy lên \"{0}/{1}\" trên GitHub. Bạn có muốn tạo một fork và đẩy lên đó thay thế không?",
      "Your push to \"{0}/{1}\" was rejected by GitHub because push protection is enabled and one or more secrets were detected.": "Việc đẩy của bạn lên \"{0}/{1}\" đã bị GitHub từ chối vì tính năng bảo vệ đẩy đã được bật và phát hiện một hoặc nhiều bí mật.",
      "{0} Open on GitHub": "{0} Mở trên GitHub"
    },
    "package": {
      "command.copyVscodeDevLink": "Sao chép liên kết vscode.dev",
      "command.openOnGitHub": "Mở trên GitHub",
      "command.openOnVscodeDev": "Mở trong vscode.dev",
      "command.publish": "Xuất bản lên GitHub",
      "config.branchProtection": "Kiểm soát xem có truy vấn các quy tắc kho lưu trữ của GitHub hay không",
      "config.gitAuthentication": "Kiểm soát liệu có bật xác thực GitHub tự động cho các lệnh git trong VS Code hay không.",
      "config.gitProtocol": "Kiểm soát giao thức được sử dụng để clone kho lưu trữ GitHub",
      "config.showAvatar": "Kiểm soát liệu có hiển thị avatar GitHub của tác giả commit trong các hover khác nhau (ví dụ: Git Blame, Dòng thời gian, Biểu đồ kiểm soát nguồn, v.v.)",
      "description": "Các tính năng GitHub cho VS Code",
      "displayName": "GitHub",
      "welcome.publishFolder": "Bạn có thể xuất bản trực tiếp thư mục này lên một kho lưu trữ GitHub. Sau khi xuất bản, bạn sẽ có quyền truy cập vào các tính năng kiểm soát nguồn được hỗ trợ bởi Git và GitHub.\r\n[$(github) Xuất bản lên GitHub](command:github.publish)",
      "welcome.publishWorkspaceFolder": "Bạn có thể xuất bản trực tiếp thư mục không gian làm việc này lên một kho lưu trữ GitHub. Sau khi xuất bản, bạn sẽ có quyền truy cập vào các tính năng kiểm soát nguồn được hỗ trợ bởi Git và GitHub.\r\n[$(github) Xuất bản lên GitHub](command:github.publish)"
    }
  }
}
