{
  "": [
    "--------------------------------------------------------------------------------------------",
    "Copyright (c) Microsoft Corporation. All rights reserved.",
    "Licensed under the MIT License. See License.txt in the project root for license information.",
    "--------------------------------------------------------------------------------------------",
    "Do not edit this file. It is machine generated."
  ],
  "version": "1.0.0",
  "contents": {
    "bundle": {
      "Example": "Ví dụ",
      "Files by Extension": "Tệp theo phần mở rộng",
      "Files with Extension": "Tệp có phần mở rộng",
      "Files with Multiple Extensions": "Tệp có nhiều phần mở rộng",
      "Files with Path": "Tệp có đường dẫn",
      "Files with Siblings by Name": "Tệp có cùng tên nhưng khác phần mở rộng",
      "Folder by Name (Any Location)": "Thư mục theo tên (Bất kỳ vị trí nào)",
      "Folder by Name (Top Level)": "Thư mục theo tên (Cấp cao nhất)",
      "Folders with Multiple Names (Top Level)": "Thư mục có nhiều tên (Cấp cao nhất)",
      "GitHub": "GitHub",
      "Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Ánh xạ tất cả các tệp khớp với mẫu glob đường dẫn tuyệt đối trong đường dẫn của chúng tới ngôn ngữ có định danh đã cho.",
      "Map all files matching the glob pattern in their filename to the language with the given identifier.": "Ánh xạ tất cả các tệp khớp với mẫu glob trong tên tệp của chúng tới ngôn ngữ có định danh đã cho.",
      "Match a folder with a specific name in any location.": "Khớp một thư mục có tên cụ thể ở bất kỳ vị trí nào.",
      "Match a top level folder with a specific name.": "Khớp một thư mục cấp cao nhất có tên cụ thể.",
      "Match all files of a specific file extension.": "Khớp tất cả các tệp có phần mở rộng tệp cụ thể.",
      "Match all files with any of the file extensions.": "Khớp tất cả các tệp có bất kỳ phần mở rộng tệp nào.",
      "Match files that have siblings with the same name but a different extension.": "Khớp các tệp có tệp anh chị em cùng tên nhưng phần mở rộng khác.",
      "Match multiple top level folders.": "Khớp nhiều thư mục cấp cao nhất.",
      "The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "Ký tự được hệ điều hành sử dụng để phân tách các thành phần trong đường dẫn tệp. Cũng được đặt biệt danh là '/'.",
      "The current opened file": "Tệp đang mở hiện tại",
      "The current opened file relative to ${workspaceFolder}": "Tệp đang mở hiện tại tương đối so với ${workspaceFolder}",
      "The current opened file workspace folder name without any slashes (/)": "Tên thư mục không gian làm việc của tệp đang mở hiện tại không có bất kỳ dấu gạch chéo nào (/)",
      "The current opened file's basename": "Tên cơ sở của tệp đang mở hiện tại",
      "The current opened file's basename with no file extension": "Tên cơ sở của tệp đang mở hiện tại không có phần mở rộng tệp",
      "The current opened file's dirname": "Tên thư mục đầy đủ của tệp đang mở hiện tại",
      "The current opened file's dirname relative to ${workspaceFolder}": "Tên thư mục của tệp đang mở hiện tại tương đối so với ${workspaceFolder}",
      "The current opened file's extension": "Phần mở rộng của tệp đang mở hiện tại",
      "The current opened file's folder name": "Tên thư mục của tệp đang mở hiện tại",
      "The current selected line number in the active file": "Số dòng đang chọn hiện tại trong tệp hoạt động",
      "The current selected text in the active file": "Văn bản đang chọn hiện tại trong tệp hoạt động",
      "The file extension of the editor (e.g. txt)": "Phần mở rộng tệp của trình soạn thảo (ví dụ: txt)",
      "The file name of the editor without its directory or extension (e.g. myFile)": "Tên tệp của trình soạn thảo không có thư mục hoặc phần mở rộng (ví dụ: myFile)",
      "The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Tên của tác vụ xây dựng mặc định. Nếu không có tác vụ xây dựng mặc định duy nhất thì một lựa chọn nhanh sẽ được hiển thị để chọn tác vụ xây dựng.",
      "The name of the folder opened in VS Code without any slashes (/)": "Tên thư mục được mở trong VS Code không có bất kỳ dấu gạch chéo nào (/)",
      "The nth parent folder name of the editor": "Tên thư mục cha thứ n của trình soạn thảo",
      "The parent folder name of the editor (e.g. myFileFolder)": "Tên thư mục cha của trình soạn thảo (ví dụ: myFileFolder)",
      "The path of the folder opened in VS Code": "Đường dẫn thư mục được mở trong VS Code",
      "The path where an extension is installed.": "Đường dẫn nơi một tiện ích mở rộng được cài đặt.",
      "The task runner's current working directory on startup": "Thư mục làm việc hiện tại của trình chạy tác vụ khi khởi động",
      "Use the language of the currently active text editor if any": "Sử dụng ngôn ngữ của trình soạn thảo văn bản đang hoạt động hiện tại nếu có",
      "a conditional separator (' - ') that only shows when surrounded by variables with values": "một dấu phân cách có điều kiện (' - ') chỉ hiển thị khi được bao quanh bởi các biến có giá trị",
      "an indicator for when the active editor has unsaved changes": "một chỉ báo cho biết khi trình soạn thảo đang hoạt động có các thay đổi chưa lưu",
      "e.g. SSH": "ví dụ: SSH",
      "e.g. VS Code": "ví dụ: VS Code",
      "file path of the workspace (e.g. /Users/Development/myWorkspace)": "đường dẫn tệp của không gian làm việc (ví dụ: /Users/Development/myWorkspace)",
      "file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "đường dẫn tệp của thư mục không gian làm việc chứa tệp (ví dụ: /Users/Development/myFolder)",
      "gist": "Gist",
      "name of the workspace folder the file is contained in (e.g. myFolder)": "tên thư mục không gian làm việc chứa tệp (ví dụ: myFolder)",
      "name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "tên không gian làm việc với tên từ xa tùy chọn và chỉ báo không gian làm việc nếu có (ví dụ: myFolder, myRemoteFolder [SSH] hoặc myWorkspace (Không gian làm việc))",
      "shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "tên rút gọn của không gian làm việc không có hậu tố (ví dụ: myFolder hoặc myWorkspace)",
      "the file name (e.g. myFile.txt)": "tên tệp (ví dụ: myFile.txt)",
      "the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "đường dẫn đầy đủ của tệp (ví dụ: /Users/Development/myFolder/myFileFolder/myFile.txt)",
      "the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "đường dẫn đầy đủ của thư mục chứa tệp (ví dụ: /Users/Development/myFolder/myFileFolder)",
      "the name of the active branch in the active repository (e.g. main)": "tên nhánh hoạt động trong kho lưu trữ hoạt động (ví dụ: main)",
      "the name of the active repository (e.g. vscode)": "tên kho lưu trữ hoạt động (ví dụ: vscode)",
      "the name of the folder the file is contained in (e.g. myFileFolder)": "tên thư mục chứa tệp (ví dụ: myFileFolder).",
      "the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "đường dẫn tệp tương đối so với thư mục không gian làm việc (ví dụ: myFolder/myFileFolder/myFile.txt)",
      "the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "đường dẫn của thư mục chứa tệp, tương đối so với thư mục không gian làm việc (ví dụ: myFolder/myFileFolder)",
      "the state of the active editor (e.g. modified).": "trạng thái của trình soạn thảo đang hoạt động (ví dụ: đã sửa đổi)."
    },
    "package": {
      "description": "Cung cấp IntelliSense nâng cao, tự động sửa lỗi và hơn thế nữa trong các tệp cấu hình (ví dụ: cài đặt, khởi chạy và đề xuất tiện ích mở rộng)",
      "displayName": "Chỉnh sửa cấu hình"
    }
  }
}
