{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "URL dữ liệu không phải là nguồn ảnh hợp lệ.",
			"Embedded SVGs are not a valid image source.": "SVG nhúng không phải là nguồn ảnh hợp lệ.",
			"Error parsing the when-clause:": "Lỗi khi phân tích cú pháp mệnh đề when:",
			"Images must use the HTTPS protocol.": "Ảnh phải sử dụng giao thức HTTPS.",
			"Language specific editor settings": "Cài đặt trình chỉnh sửa ngôn ngữ cụ thể",
			"Override editor settings for language": "Ghi đè cài đặt trình chỉnh sửa cho ngôn ngữ",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "URL huy hiệu tương đối yêu cầu một kho lưu trữ với giao thức HTTPS được chỉ định trong package.json này.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "URL hình ảnh tương đối yêu cầu một kho lưu trữ với giao thức HTTPS được chỉ định trong package.json.",
			"Remove activation event": "Xóa sự kiện kích hoạt",
			"SVGs are not a valid image source.": "SVG không phải là nguồn ảnh hợp lệ.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "Sự kiện kích hoạt này có thể bị xóa vì VS Code tự động tạo những sự kiện này từ các tuyên bố đóng góp trong package.json của bạn.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "Sự kiện kích hoạt này có thể bị xóa cho các tiện ích mở rộng nhắm đến phiên bản công cụ ^1.75 vì VS Code sẽ tự động tạo những sự kiện này từ các tuyên bố đóng góp trong package.json của bạn.",
			"This activation event cannot be explicitly listed by your extension.": "Tiện ích mở rộng của bạn không thể liệt kê rõ ràng sự kiện kích hoạt này.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Đề xuất này không thể sử dụng vì đối với tiện ích mở rộng này, sản phẩm đã định nghĩa một tập hợp đề xuất API cố định. Bạn có thể thử nghiệm tiện ích mở rộng của mình nhưng trước khi phát hành, bạn phải liên hệ với đội ngũ VS Code.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "Sử dụng kích hoạt '*' thường là một ý tưởng tồi vì nó ảnh hưởng đến hiệu suất."
		},
		"package": {
			"description": "Cung cấp tính năng linting khi tạo tiện ích mở rộng.",
			"displayName": "Chỉnh sửa tiện ích mở rộng"
		}
	}
}