{
  "": [
    "--------------------------------------------------------------------------------------------",
    "Copyright (c) Microsoft Corporation. All rights reserved.",
    "Licensed under the MIT License. See License.txt in the project root for license information.",
    "--------------------------------------------------------------------------------------------",
    "Do not edit this file. It is machine generated."
  ],

  "version": "1.0.0",
  "contents": {
    "bundle": {
      "$ref '{0}' in '{1}' can not be resolved.": "Không thể phân giải $ref '{0}' trong '{1}'.",
      "<empty>": "<trống>",
      "A default value. Used by suggestions.": "Một giá trị mặc định. Được dùng bởi các gợi ý.",
      "A descriptive title of the schema.": "Tiêu đề mô tả của lược đồ.",
      "A long description of the schema. Used in hover menus and suggestions.": "Mô tả dài về lược đồ. Được dùng trong menu di chuột và gợi ý.",
      "A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "Ánh xạ tên thuộc tính tới một mảng tên thuộc tính hoặc một lược đồ. Một mảng tên thuộc tính có nghĩa là thuộc tính được đặt tên trong khóa phụ thuộc vào các thuộc tính trong mảng có mặt trong đối tượng để hợp lệ. Nếu giá trị là một lược đồ, thì lược đồ chỉ được áp dụng cho đối tượng nếu thuộc tính trong khóa tồn tại trên đối tượng.",
      "A map of property names to schemas for each property.": "Ánh xạ tên thuộc tính tới lược đồ cho từng thuộc tính.",
      "A map of regular expressions on property names to schemas for matching properties.": "Ánh xạ các biểu thức chính quy trên tên thuộc tính tới lược đồ cho các thuộc tính khớp.",
      "A number that should cleanly divide the current value (i.e. have no remainder).": "Một số phải chia hết cho giá trị hiện tại (tức là không có phần dư).",
      "A regular expression to match the string against. It is not implicitly anchored.": "Một biểu thức chính quy để so khớp chuỗi với. Nó không được neo ngầm định.",
      "A schema which must not match.": "Một lược đồ không được khớp.",
      "A unique identifier for the schema.": "Một định danh duy nhất cho lược đồ.",
      "An array instance is valid against \"contains\" if at least one of its elements is valid against the given schema.": "Một thể hiện mảng hợp lệ với \"chứa\" nếu ít nhất một trong các phần tử của nó hợp lệ với lược đồ đã cho.",
      "An array of schemas, all of which must match.": "Một mảng các lược đồ, tất cả đều phải khớp.",
      "An array of schemas, exactly one of which must match.": "Một mảng các lược đồ, chính xác một trong số đó phải khớp.",
      "An array of schemas, where at least one must match.": "Một mảng các lược đồ, trong đó ít nhất một phải khớp.",
      "An array of strings that lists the names of all properties required on this object.": "Một mảng các chuỗi liệt kê tên của tất cả các thuộc tính bắt buộc trên đối tượng này.",
      "An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "Một thể hiện được xác thực thành công với từ khóa này nếu giá trị của nó bằng giá trị của từ khóa.",
      "Array does not contain required item.": "Mảng không chứa mục bắt buộc.",
      "Array has duplicate items.": "Mảng có các mục trùng lặp.",
      "Array has too few items that match the contains contraint. Expected {0} or more.": "Mảng có quá ít mục khớp với ràng buộc 'contains'. Dự kiến {0} hoặc nhiều hơn.",
      "Array has too few items. Expected {0} or more.": "Mảng có quá ít mục. Dự kiến {0} hoặc nhiều hơn.",
      "Array has too many items according to schema. Expected {0} or fewer.": "Mảng có quá nhiều mục theo lược đồ. Dự kiến {0} hoặc ít hơn.",
      "Array has too many items that match the contains contraint. Expected {0} or less.": "Mảng có quá nhiều mục khớp với ràng buộc 'contains'. Dự kiến {0} hoặc ít hơn.",
      "Array has too many items. Expected {0} or fewer.": "Mảng có quá nhiều mục. Dự kiến {0} hoặc ít hơn.",
      "Colon expected": "Dự kiến dấu hai chấm",
      "Comments are not permitted in JSON.": "Không cho phép nhận xét trong JSON.",
      "Comments from schema authors to readers or maintainers of the schema.": "Nhận xét từ tác giả lược đồ tới người đọc hoặc người bảo trì lược đồ.",
      "Configure": "Cấu hình",
      "Configured by extension: {0}": "Được cấu hình bởi tiện ích mở rộng: {0}",
      "Configured in user settings": "Đã cấu hình trong cài đặt người dùng",
      "Configured in workspace settings": "Đã cấu hình trong cài đặt không gian làm việc",
      "Default value": "Giá trị mặc định",
      "Describes the content encoding of a string property.": "Mô tả mã hóa nội dung của một thuộc tính chuỗi.",
      "Describes the format expected for the value. By default, not used for validation": "Mô tả định dạng dự kiến cho giá trị. Mặc định, không được dùng để xác thực",
      "Describes the media type of a string property.": "Mô tả kiểu phương tiện của một thuộc tính chuỗi.",
      "Downloading schemas is disabled through setting '{0}'": "Đã tắt tải xuống lược đồ thông qua cài đặt '{0}'",
      "Downloading schemas is disabled. Click to configure.": "Đã tắt tải xuống lược đồ. Nhấp để cấu hình.",
      "Draft-03 schemas are not supported.": "Không hỗ trợ lược đồ Draft-03.",
      "Duplicate anchor declaration: '{0}'": "Khai báo neo trùng lặp: '{0}'",
      "Duplicate object key": "Khóa đối tượng trùng lặp",
      "Either a schema or a boolean. If a schema, used to validate all properties not matched by 'properties', 'propertyNames', or 'patternProperties'. If false, any properties not defined by the adajacent keywords will cause this schema to fail.": "Một lược đồ hoặc một giá trị boolean. Nếu là lược đồ, được dùng để xác thực tất cả các thuộc tính không khớp với 'properties', 'propertyNames' hoặc 'patternProperties'. Nếu là false, bất kỳ thuộc tính nào không được định nghĩa bởi các từ khóa liền kề sẽ khiến lược đồ này thất bại.",
      "Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "Một chuỗi của một trong các kiểu lược đồ cơ bản (số, số nguyên, null, mảng, đối tượng, boolean, chuỗi) hoặc một mảng các chuỗi chỉ định một tập hợp con của các kiểu đó.",
      "End of file expected.": "Dự kiến kết thúc tệp.",
      "Expected a JSON object, array or literal.": "Dự kiến một đối tượng JSON, mảng hoặc giá trị cố định.",
      "Expected comma": "Thiếu dấu phẩy",
      "Expected comma or closing brace": "Dự kiến dấu phẩy hoặc dấu ngoặc nhọn đóng",
      "Expected comma or closing bracket": "Dự kiến dấu phẩy hoặc dấu ngoặc vuông đóng",
      "Failed to sort the JSONC document, please consider opening an issue.": "Không thể sắp xếp tài liệu JSONC, vui lòng xem xét mở một vấn đề.",
      "For arrays, only when items is set as an array. If items are a schema, this schema validates items after the ones specified by the items schema. If false, additional items will cause validation to fail.": "Đối với mảng, chỉ khi 'items' được đặt là một mảng. Nếu 'items' là một lược đồ, lược đồ này xác thực các mục sau các mục được chỉ định bởi lược đồ 'items'. Nếu là false, các mục bổ sung sẽ khiến xác thực thất bại.",
      "For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "Đối với mảng. Có thể là một lược đồ để xác thực mọi phần tử hoặc một mảng các lược đồ để xác thực từng mục theo thứ tự (lược đồ đầu tiên sẽ xác thực phần tử đầu tiên, lược đồ thứ hai sẽ xác thực phần tử thứ hai, v.v.).",
      "If all of the items in the array must be unique. Defaults to false.": "Nếu tất cả các mục trong mảng phải là duy nhất. Mặc định là false.",
      "If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "Nếu thể hiện là một đối tượng, từ khóa này xác thực nếu mọi tên thuộc tính trong thể hiện đều hợp lệ với lược đồ được cung cấp.",
      "Incorrect type. Expected \"{0}\".": "Kiểu không chính xác. Dự kiến \"{0}\".",
      "Incorrect type. Expected one of {0}.": "Kiểu không chính xác. Dự kiến một trong các {0}.",
      "Indicates that the value of the instance is managed exclusively by the owning authority.": "Chỉ ra rằng giá trị của thể hiện được quản lý độc quyền bởi cơ quan sở hữu.",
      "Invalid characters in string. Control characters must be escaped.": "Ký tự không hợp lệ trong chuỗi. Ký tự điều khiển phải được thoát.",
      "Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "Định dạng màu không hợp lệ. Sử dụng #RGB, #RGBA, #RRGGBB hoặc #RRGGBBAA.",
      "Invalid escape character in string.": "Ký tự thoát không hợp lệ trong chuỗi.",
      "Invalid number format.": "Định dạng số không hợp lệ.",
      "Invalid unicode sequence in string.": "Trình tự unicode không hợp lệ trong chuỗi.",
      "Item does not match any validation rule from the array.": "Mục không khớp với bất kỳ quy tắc xác thực nào từ mảng.",
      "JSON Language Server": "Máy chủ Ngôn ngữ JSON",
      "JSON Outline Status": "Trạng thái Dàn bài JSON",
      "JSON Validation Status": "Trạng thái xác thực JSON",
      "JSON schema cache cleared.": "Đã xóa bộ đệm lược đồ JSON.",
      "JSON schema configured": "Đã cấu hình lược đồ JSON",
      "JSON: Schema Resolution Error": "JSON: Lỗi phân giải lược đồ",
      "Learn more about JSON schema configuration...": "Tìm hiểu thêm về cấu hình lược đồ JSON...",
      "Loading JSON info": "Đang tải thông tin JSON",
      "Makes the maximum property exclusive.": "Đặt thuộc tính tối đa là độc quyền.",
      "Makes the minimum property exclusive.": "Đặt thuộc tính tối thiểu là độc quyền.",
      "Matches a schema that is not allowed.": "Khớp với lược đồ không được phép.",
      "Matches multiple schemas when only one must validate.": "Khớp với nhiều lược đồ khi chỉ một lược đồ phải được xác thực.",
      "Missing property \"{0}\".": "Thiếu thuộc tính \"{0}\".",
      "New array": "Mảng mới",
      "New object": "Đối tượng mới",
      "No schema configured for this file": "Chưa cấu hình lược đồ cho tệp này",
      "No schema validation": "Không xác thực lược đồ",
      "Not used for validation. Place subschemas here that you wish to reference inline with $ref.": "Không được dùng để xác thực. Đặt các lược đồ con ở đây mà bạn muốn tham chiếu nội tuyến bằng $ref.",
      "Object has fewer properties than the required number of {0}": "Đối tượng có ít thuộc tính hơn số lượng bắt buộc là {0}",
      "Object has more properties than limit of {0}.": "Đối tượng có nhiều thuộc tính hơn giới hạn là {0}.",
      "Object is missing property {0} required by property {1}.": "Đối tượng thiếu thuộc tính {0} được yêu cầu bởi thuộc tính {1}.",
      "Open Extension": "Mở tiện ích mở rộng",
      "Open Settings": "Mở cài đặt",
      "Outline": "Dàn bài",
      "Problem reading content from '{0}': UTF-8 with BOM detected, only UTF 8 is allowed.": "Sự cố khi đọc nội dung từ '{0}': Phát hiện UTF-8 với BOM, chỉ cho phép UTF-8.",
      "Problems loading reference '{0}': {1}": "Sự cố khi tải tham chiếu '{0}': {1}",
      "Property expected": "Dự kiến thuộc tính",
      "Property keys must be doublequoted": "Khóa thuộc tính phải được đặt trong dấu ngoặc kép",
      "Property {0} is not allowed.": "Thuộc tính {0} không được phép.",
      "Reference a definition hosted on any location.": "Tham chiếu một định nghĩa được lưu trữ ở bất kỳ vị trí nào.",
      "Sample JSON values associated with a particular schema, for the purpose of illustrating usage.": "Các giá trị JSON mẫu liên quan đến một lược đồ cụ thể, với mục đích minh họa cách sử dụng.",
      "Schema not found: {0}": "Không tìm thấy lược đồ: {0}",
      "Schema validated": "Đã xác thực lược đồ",
      "Select the schema to use for {0}": "Chọn lược đồ để sử dụng cho {0}",
      "Show Schemas": "Hiện lược đồ",
      "Sort JSON": "Sắp xếp JSON",
      "String does not match the pattern of \"{0}\".": "Chuỗi không khớp với mẫu của \"{0}\".",
      "String is longer than the maximum length of {0}.": "Chuỗi dài hơn độ dài tối đa là {0}.",
      "String is not a RFC3339 date-time.": "Chuỗi không phải là ngày giờ RFC3339.",
      "String is not a RFC3339 date.": "Chuỗi không phải là ngày RFC3339.",
      "String is not a RFC3339 time.": "Chuỗi không phải là thời gian RFC3339.",
      "String is not a URI: {0}": "Chuỗi không phải là URI: {0}",
      "String is not a hostname.": "Chuỗi không phải là tên máy chủ.",
      "String is not an IPv4 address.": "Chuỗi không phải là địa chỉ IPv4.",
      "String is not an IPv6 address.": "Chuỗi không phải là địa chỉ IPv6.",
      "String is not an e-mail address.": "Chuỗi không phải là địa chỉ e-mail.",
      "String is shorter than the minimum length of {0}.": "Chuỗi ngắn hơn độ dài tối thiểu là {0}.",
      "The \"else\" subschema is used for validation when the \"if\" subschema fails.": "Lược đồ con \"else\" được dùng để xác thực khi lược đồ con \"if\" thất bại.",
      "The \"then\" subschema is used for validation when the \"if\" subschema succeeds.": "Lược đồ con \"then\" được dùng để xác thực khi lược đồ con \"if\" thành công.",
      "The maximum length of a string.": "Độ dài tối đa của một chuỗi.",
      "The maximum number of items that can be inside an array. Inclusive.": "Số lượng mục tối đa có thể có trong một mảng. Bao gồm.",
      "The maximum number of properties an object can have. Inclusive.": "Số lượng thuộc tính tối đa mà một đối tượng có thể có. Bao gồm.",
      "The maximum numerical value, inclusive by default.": "Giá trị số tối đa, mặc định là bao gồm.",
      "The minimum length of a string.": "Độ dài tối thiểu của một chuỗi.",
      "The minimum number of items that can be inside an array. Inclusive.": "Số lượng mục tối thiểu có thể có trong một mảng. Bao gồm.",
      "The minimum number of properties an object can have. Inclusive.": "Số lượng thuộc tính tối thiểu mà một đối tượng có thể có. Bao gồm.",
      "The minimum numerical value, inclusive by default.": "Giá trị số tối thiểu, mặc định là bao gồm.",
      "The schema to verify this document against.": "Lược đồ để xác minh tài liệu này.",
      "The schema uses meta-schema features ({0}) that are not yet supported by the validator.": "Lược đồ sử dụng các tính năng meta-schema ({0}) mà trình xác thực chưa hỗ trợ.",
      "The set of literal values that are valid.": "Tập hợp các giá trị cố định hợp lệ.",
      "The validation outcome of the \"if\" subschema controls which of the \"then\" or \"else\" keywords are evaluated.": "Kết quả xác thực của lược đồ con \"if\" kiểm soát việc từ khóa \"then\" hoặc \"else\" nào được đánh giá.",
      "Trailing comma": "Dấu phẩy cuối cùng",
      "URI expected.": "Dự kiến URI.",
      "URI is expected.": "Yêu cầu URI.",
      "URI with a scheme is expected.": "Dự kiến URI có sơ đồ.",
      "Unable to compute used schemas: No document": "Không thể tính toán lược đồ đã sử dụng: Không có tài liệu",
      "Unable to compute used schemas: {0}": "Không thể tính toán lược đồ đã sử dụng: {0}",
      "Unable to load schema from '{0}'. No schema request service available": "Không thể tải lược đồ từ '{0}'. Không có dịch vụ yêu cầu lược đồ nào khả dụng",
      "Unable to load schema from '{0}': No content.": "Không thể tải lược đồ từ '{0}': Không có nội dung.",
      "Unable to load schema from '{0}': {1}.": "Không thể tải lược đồ từ '{0}': {1}.",
      "Unable to load {0}": "Không thể tải {0}",
      "Unable to parse content from '{0}': Parse error at offset {1}.": "Không thể phân tích nội dung từ '{0}': Lỗi phân tích tại vị trí {1}.",
      "Unable to resolve schema. Click to retry.": "Không thể phân giải lược đồ. Nhấp để thử lại.",
      "Unexpected end of comment.": "Kết thúc nhận xét không mong muốn.",
      "Unexpected end of number.": "Kết thúc số không mong muốn.",
      "Unexpected end of string.": "Kết thúc chuỗi không mong muốn.",
      "Value expected": "Dự kiến giá trị",
      "Value is above the exclusive maximum of {0}.": "Giá trị vượt quá giới hạn tối đa độc quyền là {0}.",
      "Value is above the maximum of {0}.": "Giá trị lớn hơn giá trị tối đa là {0}.",
      "Value is below the exclusive minimum of {0}.": "Giá trị dưới mức tối thiểu độc quyền là {0}.",
      "Value is below the minimum of {0}.": "Giá trị dưới mức tối thiểu là {0}.",
      "Value is deprecated": "Giá trị đã bị phản đối",
      "Value is not accepted. Valid values: {0}.": "Giá trị không được chấp nhận. Giá trị hợp lệ: {0}.",
      "Value is not divisible by {0}.": "Giá trị không chia hết cho {0}.",
      "Value must be {0}.": "Giá trị phải là {0}.",
      "multiple JSON schemas configured": "đã cấu hình nhiều lược đồ JSON",
      "no JSON schema configured": "chưa cấu hình lược đồ JSON nào",
      "only {0} document symbols shown for performance reasons": "chỉ hiển thị {0} ký hiệu tài liệu vì lý do hiệu suất",
      "{0} is a directory, not a file": "{0} là một thư mục, không phải một tệp"
    },
    "package": {
      "description": "Cung cấp hỗ trợ ngôn ngữ phong phú cho các tệp JSON",
      "displayName": "Tính năng ngôn ngữ JSON",
      "json.clickToRetry": "Nhấp để thử lại.",
      "json.colorDecorators.enable.deprecationMessage": "Cài đặt \"json.colorDecorators.enable\" đã bị phản đối, vui lòng sử dụng \"editor.colorDecorators\" thay thế.",
      "json.colorDecorators.enable.desc": "Bật hoặc tắt bộ trang trí màu",
      "json.command.clearCache": "Xóa bộ đệm lược đồ",
      "json.command.sort": "Sắp xếp tài liệu",
      "json.enableSchemaDownload.desc": "Khi được bật, cho phép tìm nạp lược đồ JSON từ các vị trí http và https.",
      "json.format.enable.desc": "Bật hoặc tắt định dạng JSON mặc định.",
      "json.format.keepLines.desc": "Giữ lại tất cả các dòng mới hiện có khi định dạng.",
      "json.maxItemsComputed.desc": "Số lượng tối đa các ký hiệu dàn bài và vùng gấp được tính toán (bị giới hạn vì lý do hiệu suất).",
      "json.maxItemsExceededInformation.desc": "Hiển thị thông báo khi vượt quá số lượng tối đa các ký hiệu dàn bài và vùng gấp.",
      "json.schemaResolutionErrorMessage": "Không thể phân giải lược đồ.",
      "json.schemas.desc": "Liên kết lược đồ với các tệp JSON trong dự án hiện tại.",
      "json.schemas.fileMatch.desc": "Mảng các mẫu tệp để khớp khi phân giải tệp JSON thành lược đồ. \"*\" và '**' có thể được sử dụng làm ký tự đại diện. Các mẫu loại trừ cũng có thể được định nghĩa bằng cách bắt đầu bằng \"!\". Một tệp khớp khi có ít nhất một mẫu khớp và mẫu khớp cuối cùng không phải là mẫu loại trừ.",
      "json.schemas.fileMatch.item.desc": "Mẫu tệp có thể chứa \"*\" và \"**\" để khớp khi phân giải tệp JSON thành lược đồ. Khi bắt đầu bằng '!', nó định nghĩa một mẫu loại trừ.",
      "json.schemas.schema.desc": "Định nghĩa lược đồ cho một URL nhất định. Chỉ cần cung cấp lược đồ nếu bạn muốn tránh truy cập URL lược đồ.",
      "json.schemas.url.desc": "URL hoặc đường dẫn tệp tuyệt đối của lược đồ. Có thể là một đường dẫn tương đối (bắt đầu bằng \"./\") trong cài đặt không gian làm việc và thư mục không gian làm việc.",
      "json.tracing.desc": "Theo dõi giao tiếp giữa VS Code và máy chủ ngôn ngữ JSON.",
      "json.validate.enable.desc": "Bật/Tắt xác thực JSON."
    }
  }
}
