{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "데이터 URL은 올바른 이미지 소스가 아닙니다.",
			"Embedded SVGs are not a valid image source.": "내장 SVG는 올바른 이미지 소스가 아닙니다.",
			"Error parsing the when-clause:": "when 절 구문 분석 오류:",
			"Images must use the HTTPS protocol.": "이미지는 HTTPS 프로토콜을 사용해야 합니다.",
			"Language specific editor settings": "언어별 편집기 설정",
			"Override editor settings for language": "언어용 편집기 설정 재정의",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "관계형 배지 URL은 package.json에 HTTPS 프로토콜이 지정된 저장소가 필요합니다.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "관계형 이미지 URL은 package.json에 HTTPS 프로토콜이 지정된 저장소가 필요합니다.",
			"Remove activation event": "활성화 이벤트 제거",
			"SVGs are not a valid image source.": "SVG는 올바른 이미지 소스가 아닙니다.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "이 활성화 이벤트는 VS Code가 package.json 기여 선언에서 자동으로 생성하므로 제거할 수 있습니다.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "이 활성화 이벤트는 VS Code가 package.json 기여 선언으로부터 자동 생성하므로 엔진 버전 ^1.75를 대상으로 하는 확장을 위해 제거할 수 있습니다.",
			"This activation event cannot be explicitly listed by your extension.": "확장에서 이 활성화 이벤트를 명시적으로 나열할 수 없습니다.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "이 확장에 대해 제품이 고정된 API 제안 세트를 정의하므로 이 제안을 사용할 수 없습니다. 확장을 테스트할 수 있지만 게시하기 전에 VS Code 팀에 연락해야 합니다.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "일반적으로 '*' 활성화는 성능에 영향을 주므로 사용하지 않는 것이 좋습니다."
		},
		"package": {
			"description": "확장 제작을 위한 Lint 기능을 제공합니다.",
			"displayName": "확장 제작"
		}
	}
}