{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "Veri URL'leri geçerli görüntü kaynakları değil.",
			"Embedded SVGs are not a valid image source.": "Eklenmiş SVG'ler geçerli görüntü kaynağı değil.",
			"Error parsing the when-clause:": "when yan tümcesi ayrıştırılırken hata oluştu:",
			"Images must use the HTTPS protocol.": "Görüntüler HTTPS protokolünü kullanmalıdır.",
			"Language specific editor settings": "Dile özgü düzenleyici ayarları",
			"Override editor settings for language": "Dil için düzenleyici ayarlarını geçersiz kılın",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Göreli rozet URL'leri, bu package.json içinde belirtilen HTTPS protokolüne sahip bir depo gerektirir.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Göreli görüntü URL'leri, package.json içinde belirtilen HTTPS protokolüne sahip bir depo gerektirir.",
			"Remove activation event": "Etkinleştirme olayını kaldır",
			"SVGs are not a valid image source.": "SVG'ler geçerli bir görüntü kaynağı değil.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "VS Code bunları package.json katkı bildirimlerinizden otomatik olarak oluşturduğundan, bu etkinleştirme dolayı kaldırılabilir.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "VS Code bunları package.json katkı bildirimlerinizden otomatik olarak oluşturduğundan, bu etkinleştirme olayı ^1.75 altyapı sürümünü hedef alan uzantılar için kaldırılabilir.",
			"This activation event cannot be explicitly listed by your extension.": "Bu etkinleştirme olayı, uzantınız tarafından açıkça listelenemiyor.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Bu uzantı için ürün, sabit bir API teklifleri kümesi tanımladığı için bu teklif kullanılamıyor. Uzantınızı test edebilirsiniz, ancak yayımlamadan önce VS Code ekibiyle iletişime geçmeniz GEREKİR.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "'*' etkinleştirmesini kullanmak genellikle performansı etkilediğinden kötü bir fikirdir."
		},
		"package": {
			"description": "Yazma uzantıları için linting özellikleri sağlar.",
			"displayName": "Uzantı Yazma"
		}
	}
}