{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Continue to GitHub": "GitHub'a Devam Et",
			"Continue to GitHub to create a Personal Access Token (PAT)": "Kişisel Erişim Belirteci (PAT) oluşturmak için GitHub'a devam edin",
			"Copy & Continue to GitHub": "GitHub'a Kopyala ve Devam Et",
			"GitHub Enterprise Server URI is not a valid URI: {0}": "GitHub Enterprise Sunucusu URI'sı geçerli bir URI değil: {0}",
			"Having trouble logging in? Would you like to try a different way? ({0})": "Oturum açarken sorun mu yaşıyorsunuz? Farklı bir yöntem denemek ister misiniz? ({0})",
			"No": "Hayır",
			"Open [{0}]({0}) in a new tab and paste your one-time code: {1}/The [{0}]({0}) will be a url and the {1} will be a code, e.g. 123-456{Locked=\"[{0}]({0})\"}": "[{0}]({0}) öğesini yeni bir sekmede açın ve bir kerelik kodunuzu yapıştırın: {1}",
			"Sign in failed: {0}": "Oturum açılamadı: {0}",
			"Sign out failed: {0}": "Oturum kapatılamadı: {0}",
			"Signing in to {0}.../The {0} will be a url, e.g. github.com": "{0} üzerinde oturum açılıyor...",
			"To finish authenticating, navigate to GitHub and paste in the above one-time code.": "Kimlik doğrulamayı bitirmek için GitHub'a gidin ve yukarıdaki tek seferlik kodu yapıştırın.",
			"To finish authenticating, navigate to GitHub to create a PAT then paste the PAT into the input box.": "Kimlik doğrulamayı bitirmek için GitHub'a giderek bir PAT oluşturun ve PAT'ı giriş kutusuna yapıştırın.",
			"Yes": "Evet",
			"You have not yet finished authorizing this extension to use GitHub. Would you like to try a different way? ({0})": "Bu uzantıyı GitHub’ı kullanmak üzere yetkilendirme işlemini henüz bitirmediniz. Farklı bir yöntem denemek ister misiniz? ({0})",
			"Your Code: {0}/The {0} will be a code, e.g. 123-456": "Kodunuz: {0}",
			"device code": "cihaz kodu",
			"local server": "yerel sunucu",
			"personal access token": "kişisel erişim belirteci",
			"url handler": "url işleyicisi"
		},
		"package": {
			"description": "GitHub Kimlik Doğrulama Sağlayıcısı",
			"displayName": "GitHub Kimlik Doğrulaması"
		}
	}
}