{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"An icon requires a repository with HTTPS protocol to be specified in this package.json.": "Un'icona richiede di specificare un repository con protocollo HTTPS in questo package.json.",
			"Data URLs are not a valid image source.": "Gli URL di dati non sono un'origine valida per le immagini.",
			"Embedded SVGs are not a valid image source.": "Le immagini di tipo SVG incorporate non sono un'origine valida.",
			"Images must use the HTTPS protocol.": "Le immagini devono usare il protocollo HTTPS.",
			"Language specific editor settings": "Impostazioni dell'editor specifiche del linguaggio",
			"Override editor settings for language": "Esegue l'override delle impostazioni dell'editor per il linguaggio",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Notifiche con URL relativo richiedono di specificare un repository con protocollo HTTPS in questo package.json.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Immagini con URL relative richiedono di specificare un repository con protocollo HTTPS in package.json.",
			"SVGs are not a valid image source.": "Le immagini di tipo SVG non sono un'origine valida.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Non è possibile usare questa proposta perché per questa estensione il prodotto definisce un set fisso di proposte API. È possibile testare l'estensione, ma prima della pubblicazione è necessario contattare il team VS Code."
		},
		"package": {
			"description": "Fornisce funzionalità di linting per la creazione di estensioni.",
			"displayName": "Creazione estensione"
		}
	}
}