{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Cannot validate since a PHP installation could not be found. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "Non può essere convalidato perché non è stata trovata un'installazione PHP. Usare l'impostazione 'php.validate.executablePath' per configurare il file eseguibile PHP.",
			"Cannot validate since no PHP executable is set. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "Non è possibile eseguire la convalida perché non è impostato alcun file eseguibile di PHP. Usare l'impostazione 'php.validate.executablePath' per convalidare il file eseguibile di PHP.",
			"Cannot validate since {0} is not a valid php executable. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "Non è possibile eseguire la convalida perché {0} non è un file eseguibile di PHP valido. Usare l'impostazione 'php.validate.executablePath' per convalidare il file eseguibile di PHP.",
			"Failed to run php using path: {0}. Reason is unknown.": "Non è stato possibile eseguire php con il percorso {0}. Il motivo è sconosciuto.",
			"Open Settings": "Apri impostazioni"
		},
		"package": {
			"command.untrustValidationExecutable": "Non consentire la convalida di PHP eseguibile (definito come impostazione dell'area di lavoro)",
			"commands.categroy.php": "PHP",
			"configuration.suggest.basic": "Controlla l'abilitazione dei suggerimenti predefiniti per il linguaggio PHP. Il supporto suggerisce variabili e variabili globali PHP.",
			"configuration.title": "PHP",
			"configuration.validate.enable": "Abilita/Disabilita la convalida PHP predefinita.",
			"configuration.validate.executablePath": "Punta all'eseguibile di PHP.",
			"configuration.validate.run": "Indica se il linter viene eseguito durante il salvataggio o la digitazione.",
			"description": "Fornisce supporto avanzato del linguaggio per i file PHP.",
			"displayName": "Funzionalità del linguaggio PHP",
			"workspaceTrust": "L'estensione richiede un'area di lavoro attendibile quando l'impostazione 'php.validate.executablePath' carica una versione di PHP nell'area di lavoro."
		}
	}
}