{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "Gli URL di dati non sono un'origine valida per le immagini.",
			"Embedded SVGs are not a valid image source.": "Le immagini di tipo SVG incorporate non sono un'origine valida.",
			"Error parsing the when-clause:": "Errore durante l'analisi della clausola \"when\":",
			"Images must use the HTTPS protocol.": "Le immagini devono usare il protocollo HTTPS.",
			"Language specific editor settings": "Impostazioni dell'editor specifiche del linguaggio",
			"Override editor settings for language": "Esegue l'override delle impostazioni dell'editor per il linguaggio",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Notifiche con URL relativo richiedono di specificare un repository con protocollo HTTPS in questo package.json.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Immagini con URL relative richiedono di specificare un repository con protocollo HTTPS in package.json.",
			"Remove activation event": "Rimuovi evento di attivazione",
			"SVGs are not a valid image source.": "Le immagini di tipo SVG non sono un'origine valida.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "Questo evento di attivazione può essere rimosso poiché VS Code genera automaticamente tali eventi dalle dichiarazioni di contributo package.json.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "Questo evento di attivazione può essere rimosso per le estensioni che puntano alla versione del motore ^1.75, perché VS Code lo genererà automaticamente dalle dichiarazioni del contributo package.json.",
			"This activation event cannot be explicitly listed by your extension.": "Questo evento di attivazione non può essere elencato in modo esplicito dall'estensione.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Non è possibile usare questa proposta perché per questa estensione il prodotto definisce un set fisso di proposte API. È possibile testare l'estensione, ma prima della pubblicazione è necessario contattare il team VS Code.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "L'uso dell'attivazione '*' è di solito una cattiva idea, perché influisce sulle prestazioni."
		},
		"package": {
			"description": "Fornisce funzionalità di linting per la creazione di estensioni.",
			"displayName": "Creazione estensione"
		}
	}
}