{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"A reload is required for the fetch setting change to take effect.": "É necessário recarregar para que a alteração da configuração de fetch tenha efeito.",
			"Apple": "Apple",
			"Continue to GitHub": "Continuar no GitHub",
			"Continue to GitHub to create a Personal Access Token (PAT)": "Continue no GitHub para criar um token de acesso pessoal (PAT)",
			"Copy & Continue to {0}": "Copiar e continuar para {0}",
			"GitHub": "GitHub",
			"GitHub Authentication - Reload required": "Autenticação do GitHub - Recarregamento necessário",
			"GitHub Enterprise Server URI is not a valid URI: {0}": "URI do GitHub Enterprise Server não é um URI válido: {0}",
			"Google": "Google",
			"Having trouble logging in? Would you like to try a different way? ({0})": "Está com problemas para fazer logon? Você gostaria de tentar de outra maneira? ({0})",
			"No": "Não",
			"Open [{0}]({0}) in a new tab and paste your one-time code: {1}/The [{0}]({0}) will be a url and the {1} will be a code, e.g. 123-456{Locked=\"[{0}]({0})\"}": "Abra [{0}]({0}) em uma nova guia e cole seu código avulso: {1}",
			"Reload Window": "Recarregar a Janela",
			"Sign in failed: {0}": "Falha ao entrar: {0}",
			"Sign out failed: {0}": "Falha ao sair: {0}",
			"Signing in to {0}.../The {0} will be a url, e.g. github.com": "Entre para {0}...",
			"To finish authenticating, navigate to GitHub and paste in the above one-time code.": "Para concluir a autenticação, navegue até o GitHub e cole o código único acima.",
			"To finish authenticating, navigate to GitHub to create a PAT then paste the PAT into the input box.": "Para concluir a autenticação, navegue até o GitHub para criar um PAT e cole o PAT na caixa de entrada.",
			"Yes": "Sim",
			"You have not yet finished authorizing this extension to use GitHub. Would you like to try a different way? ({0})": "Você ainda não concluiu a autorização dessa extensão para usar o GitHub. Você gostaria de tentar de outra maneira? ({0})",
			"Your Code: {0}/The {0} will be a code, e.g. 123-456": "Seu Código: {0}",
			"device code": "código do dispositivo",
			"local server": "servidor local",
			"personal access token": "token de acesso pessoal",
			"url handler": "manipulador de urls"
		},
		"package": {
			"config.github-authentication.preferDeviceCodeFlow.description": "Quando for true, priorize o fluxo de código do dispositivo para autenticação em vez de outros fluxos disponíveis. Isso é útil para ambientes como o WSL em que os fluxos do servidor local ou do manipulador de URL podem não funcionar conforme o esperado.",
			"config.github-authentication.useElectronFetch.description": "Quando verdadeiro, usa a função fetch integrada do Electron para requisições HTTP. Quando falso, usa a função busca global do Node.js. Essa configuração só se aplica quando executado no ambiente Electron. **Observação:** É necessário reiniciar para que essa configuração tenha efeito.",
			"config.github-enterprise.title": "GHE.com e autenticação do GitHub Enterprise Server",
			"config.github-enterprise.uri.description": "O URI da instância do GHE.com ou GitHub Enterprise Server.\r\n\r\nExemplos:\r\n* GHE.com: 'https://octocat.ghe.com`\r\n* GitHub Enterprise Server: 'https://github.octocat.com`\r\n\r\n> **Observação:** Isso deve _não_ ser definido como um GitHub.com URI. Se sua conta existir no GitHub.com ou for um GitHub Enterprise Usuário Gerenciado, você não precisará de nenhuma configuração adicional e poderá simplesmente fazer logon no GitHub.",
			"description": "Provedor de Autenticação do GitHub",
			"displayName": "Autenticação do GitHub"
		}
	}
}