{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"A reload is required for the fetch setting change to take effect.": "Ein erneutes Laden ist erforderlich, damit die Änderung der Abrufeinstellung wirksam wird.",
			"Apple": "Apple",
			"Continue to GitHub": "Weiter zu GitHub",
			"Continue to GitHub to create a Personal Access Token (PAT)": "Weiter zu GitHub, um ein persönliches Zugriffstoken (Personal Access Token, PAT) zu erstellen.",
			"Copy & Continue to {0}": "Kopieren und Fortfahren auf {0}",
			"GitHub": "GitHub",
			"GitHub Authentication - Reload required": "GitHub-Authentifizierung – Erneutes Laden ist erforderlich.",
			"GitHub Enterprise Server URI is not a valid URI: {0}": "GitHub Enterprise Server-URI ist kein gültiger URI: {0}",
			"Google": "Google",
			"Having trouble logging in? Would you like to try a different way? ({0})": "Haben Sie Probleme bei der Anmeldung? Möchten Sie eine andere Methode ausprobieren? ({0})",
			"No": "Nein",
			"Open [{0}]({0}) in a new tab and paste your one-time code: {1}/The [{0}]({0}) will be a url and the {1} will be a code, e.g. 123-456{Locked=\"[{0}]({0})\"}": "Öffnen Sie [{0}]({0}) auf einer neuen Registerkarte, und fügen Sie Ihren einmaligen Code ein: {1}",
			"Reload Window": "Fenster erneut laden",
			"Sign in failed: {0}": "Fehler bei der Anmeldung: {0}",
			"Sign out failed: {0}": "Fehler bei der Abmeldung: {0}",
			"Signing in to {0}.../The {0} will be a url, e.g. github.com": "Anmelden bei {0}...",
			"To finish authenticating, navigate to GitHub and paste in the above one-time code.": "Um die Authentifizierung abzuschließen, navigieren Sie zu GitHub, und fügen Sie den obigen Einmalcode ein.",
			"To finish authenticating, navigate to GitHub to create a PAT then paste the PAT into the input box.": "Um die Authentifizierung abzuschließen, navigieren Sie zu GitHub, um eine PAT zu erstellen, und fügen Sie dann die PAT in das Eingabefeld ein.",
			"Yes": "Ja",
			"You have not yet finished authorizing this extension to use GitHub. Would you like to try a different way? ({0})": "Sie haben die Autorisierung dieser Erweiterung für die Verwendung von GitHub noch nicht abgeschlossen. Möchten Sie eine andere Methode ausprobieren? ({0})",
			"Your Code: {0}/The {0} will be a code, e.g. 123-456": "Ihr Code: {0}",
			"device code": "Gerätecode",
			"local server": "lokaler Server",
			"personal access token": "Persönliches Zugriffstoken",
			"url handler": "URL-Handler"
		},
		"package": {
			"config.github-authentication.preferDeviceCodeFlow.description": "Wenn WAHR, wird der Gerätecodeflow für die Authentifizierung gegenüber anderen verfügbaren Flows bevorzugt. Dies ist nützlich in Umgebungen wie WSL, in denen lokale Server- oder URL-Handler-Flows möglicherweise nicht wie erwartet funktionieren.",
			"config.github-authentication.useElectronFetch.description": "Bei TRUE wird die integrierte Abruffunktion von Electron für HTTP-Anforderungen verwendet. Bei FALSE wird die globale Abruffunktion von Node.js verwendet. Diese Einstellung gilt nur, wenn Sie in der Electron-Umgebung arbeiten. **Hinweis:** Ein Neustart ist erforderlich, damit diese Einstellung wirksam wird.",
			"config.github-enterprise.title": "GHE.com und GitHub Enterprise Serverauthentifizierung",
			"config.github-enterprise.uri.description": "Der URI für ihre GHE.com- oder GitHub Enterprise Server-instance.\r\n\r\nBeispiele:\r\n* GHE.com: 'https://octocat.ghe.com`\r\n* GitHub Enterprise Server: 'https://github.octocat.com`\r\n\r\n> **Hinweis:** Dies sollte _nicht_ auf einen GitHub.com-URI festgelegt werden. Wenn Ihr Konto auf GitHub.com vorhanden ist oder ein GitHub Enterprise verwalteter Benutzer ist, benötigen Sie keine zusätzliche Konfiguration und können sich einfach bei GitHub anmelden.",
			"description": "GitHub-Authentifizierungsanbieter",
			"displayName": "GitHub-Authentifizierung"
		}
	}
}