{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "Daten-URLs sind keine gültige Bildquelle.",
			"Embedded SVGs are not a valid image source.": "Eingebettete SVGs sind keine gültige Bildquelle.",
			"Error parsing the when-clause:": "Fehler beim Analysieren der when-Klausel:",
			"Images must use the HTTPS protocol.": "Für Bilder muss das HTTPS-Protokoll verwendet werden.",
			"Language specific editor settings": "Sprachspezifische Editor-Einstellungen",
			"Override editor settings for language": "Editor-Einstellungen für Sprache überschreiben",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Relative Badge-URLs erfordern die Angabe eines Repositorys mit dem HTTPS-Protokoll in dieser Datei \"package.json\".",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Relative Bild-URLs erfordern die Angabe eines Repositorys mit dem HTTPS-Protokoll in der Datei \"package.json\".",
			"Remove activation event": "Aktivierungsereignis entfernen",
			"SVGs are not a valid image source.": "SVGs sind keine gültige Bildquelle.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "Dieses Aktivierungsereignis kann entfernt werden, da VS Code diese automatisch aus Ihren package.json-Beitragsdeklarationen generiert.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "Dieses Aktivierungsereignis kann für Erweiterungen mit der Engine-Version ^1.75 entfernt werden, da VS Code diese automatisch aus Ihren package.json-Beitragsdeklarationen generieren.",
			"This activation event cannot be explicitly listed by your extension.": "Dieses Aktivierungsereignis kann von Ihrer Erweiterung nicht explizit aufgeführt werden.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Dieser Vorschlag kann nicht verwendet werden, da das Produkt für diese Erweiterung einen festen Satz von API-Vorschlägen definiert. Sie können Ihre Erweiterung testen, aber vor der Veröffentlichung MÜSSEN Sie sich an das VS Code-Team wenden.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "Die Verwendung der Aktivierung \"*\" ist in der Regel eine schlechte Idee, da sie sich auf die Leistung auswirkt."
		},
		"package": {
			"description": "Stellt Bereinigungsfunktionen für die Erstellung von Erweiterungen zur Verfügung.",
			"displayName": "Erweiterungserstellung"
		}
	}
}