{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "Ðætæ ÜR£s ærë ñøt æ vælïð ïmægë søµrçë.",
			"Embedded SVGs are not a valid image source.": "Ëmþëððëð §VGs ærë ñøt æ vælïð ïmægë søµrçë.",
			"Error parsing the when-clause:": "Ërrør pærsïñg thë whëñ-çlæµsë:",
			"Images must use the HTTPS protocol.": "Ïmægës mµst µsë thë HTTP§ prøtøçøl.",
			"Language specific editor settings": "£æñgµægë spëçïfïç ëðïtør sëttïñgs",
			"Override editor settings for language": "Øvërrïðë ëðïtør sëttïñgs før læñgµægë",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Rëlætïvë þæðgë ÜR£s rëqµïrë æ rëpøsïtørÿ wïth HTTP§ prøtøçøl tø þë spëçïfïëð ïñ thïs pæçkægë.jsøñ.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Rëlætïvë ïmægë ÜR£s rëqµïrë æ rëpøsïtørÿ wïth HTTP§ prøtøçøl tø þë spëçïfïëð ïñ thë pæçkægë.jsøñ.",
			"Remove activation event": "Rëmøvë æçtïvætïøñ ëvëñt",
			"SVGs are not a valid image source.": "§VGs ærë ñøt æ vælïð ïmægë søµrçë.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "Thïs æçtïvætïøñ ëvëñt çæñ þë rëmøvëð æs V§ Çøðë gëñërætës thësë æµtømætïçællÿ frøm ÿøµr pæçkægë.jsøñ çøñtrïþµtïøñ ðëçlærætïøñs.",
			"This activation event can be removed for extensions targeting engine version ^1.75.0 as VS Code will generate these automatically from your package.json contribution declarations.": "Thïs æçtïvætïøñ ëvëñt çæñ þë rëmøvëð før ëxtëñsïøñs tærgëtïñg ëñgïñë vërsïøñ ^1.75.0 æs V§ Çøðë wïll gëñërætë thësë æµtømætïçællÿ frøm ÿøµr pæçkægë.jsøñ çøñtrïþµtïøñ ðëçlærætïøñs.",
			"This activation event cannot be explicitly listed by your extension.": "Thïs æçtïvætïøñ ëvëñt çæññøt þë ëxplïçïtlÿ lïstëð þÿ ÿøµr ëxtëñsïøñ.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Thïs prøpøsæl çæññøt þë µsëð þëçæµsë før thïs ëxtëñsïøñ thë prøðµçt ðëfïñës æ fïxëð sët øf ÆPÏ prøpøsæls. Ýøµ çæñ tëst ÿøµr ëxtëñsïøñ þµt þëførë pµþlïshïñg ÿøµ MÜ§T rëæçh øµt tø thë V§ Çøðë tëæm.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "Üsïñg '*' æçtïvætïøñ ïs µsµællÿ æ þæð ïðëæ æs ït ïmpæçts përførmæñçë."
		},
		"package": {
			"description": "Prøvïðës lïñtïñg çæpæþïlïtïës før æµthørïñg ëxtëñsïøñs.",
			"displayName": "Ëxtëñsïøñ Æµthørïñg"
		}
	}
}