{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "URL-адреси даних не є допустимим джерелом зображень.",
			"Embedded SVGs are not a valid image source.": "Вбудовані SVG не є допустимим джерелом зображень.",
			"Error parsing the when-clause:": "Помилка при розборі умови when:",
			"Images must use the HTTPS protocol.": "Зображення повинні використовувати протокол HTTPS.",
			"Language specific editor settings": "Специфічні налаштування редактора для мови",
			"Override editor settings for language": "Перевизначити налаштування редактора для мови",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Відносні URL-адреси значків потребують вказання репозиторію з протоколом HTTPS у файлі package.json.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Відносні URL-адреси зображень потребують вказання репозиторію з протоколом HTTPS у файлі package.json.",
			"Remove activation event": "Видалити подію активації",
			"SVGs are not a valid image source.": "SVG не є допустимим джерелом зображень.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "Цю подію активації можна видалити, оскільки VS Code автоматично генерує їх з внесків у вашому файлі package.json.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "Цю подію активації можна видалити для розширень, які спрямовані на версію двигуна ^1.75, оскільки VS Code автоматично генеруватиме їх з внесків у вашому файлі package.json.",
			"This activation event cannot be explicitly listed by your extension.": "Цю подію активації не можна явно перерахувати у вашому розширенні.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Цю пропозицію не можна використовувати, оскільки для цього розширення продукт визначає фіксований набір пропозицій API. Ви можете протестувати своє розширення, але перед публікацією ВИ МУСИТЕ звернутися до команди VS Code.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "Використання активації '*' зазвичай є поганою ідеєю, оскільки це впливає на продуктивність."
		},
		"package": {
			"description": "Надає функції жанрів для розробки розширень.",
			"displayName": "Розробка розширення"
		}
	}
}