{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Приклад",
			"Files by Extension": "Файли за розширенням",
			"Files with Extension": "Файли з розширенням",
			"Files with Multiple Extensions": "Файли з кількома розширеннями",
			"Files with Path": "Файли з шляхом",
			"Files with Siblings by Name": "Файли з рідною назвою",
			"Folder by Name (Any Location)": "Папка за назвою (будь-яке розташування)",
			"Folder by Name (Top Level)": "Папка за назвою (верхній рівень)",
			"Folders with Multiple Names (Top Level)": "Папки з кількома назвами (верхній рівень)",
			"GitHub": "GitHub",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Відображати всі файли, що відповідають абсолютній шаблону глобального шляху, на мову з вказаним ідентифікатором.",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Відображати всі файли, що відповідають шаблону глобального шляху у їхньому імені файлу, на мову з вказаним ідентифікатором.",
			"Match a folder with a specific name in any location.": "Відповідати папці з певною назвою в будь-якому розташуванні.",
			"Match a top level folder with a specific name.": "Відповідати папці верхнього рівня з певною назвою.",
			"Match all files of a specific file extension.": "Відповідати всім файлам з певним розширенням.",
			"Match all files with any of the file extensions.": "Відповідати всім файлам з будь-яким з розширень файлів.",
			"Match files that have siblings with the same name but a different extension.": "Відповідати файлам, у яких є рідні елементи з такою самою назвою, але з різним розширенням.",
			"Match multiple top level folders.": "Відповідати кільком папкам верхнього рівня.",
			"The character used by the operating system to separate components in file paths. Is also aliased to '/'.": "Символ, який використовується операційною системою для розділення компонентів у шляхах до файлів. Також має псевдонім '/'",
			"The current opened file": "Поточний відкритий файл",
			"The current opened file relative to ${workspaceFolder}": "Поточний відкритий файл відносно ${workspaceFolder}",
			"The current opened file workspace folder name without any slashes (/)": "Назва папки робочої області поточного відкритого файлу без жодних слешів (/).",
			"The current opened file's basename": "Базове ім'я поточного відкритого файлу",
			"The current opened file's basename with no file extension": "Базове ім'я поточного відкритого файлу без розширення",
			"The current opened file's dirname": "Ім'я каталогу поточного відкритого файлу",
			"The current opened file's dirname relative to ${workspaceFolder}": "Ім'я каталогу поточного відкритого файлу відносно ${workspaceFolder}",
			"The current opened file's extension": "Розширення поточного відкритого файлу",
			"The current selected line number in the active file": "Поточний номер вибраного рядка в активному файлі",
			"The current selected text in the active file": "Поточний вибраний текст в активному файлі",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Назва задачі збірки за замовчуванням. Якщо немає жодної задачі збірки за замовчуванням, відображається швидкий вибір для вибору задачі збірки.",
			"The name of the folder opened in VS Code without any slashes (/)": "Назва папки, відкритої в VS Code без жодних слешів (/)",
			"The path of the folder opened in VS Code": "Шлях до папки, відкритої в VS Code",
			"The path where an extension is installed.": "Шлях, де встановлено розширення.",
			"The task runner's current working directory on startup": "Поточний робочий каталог планувальника задач при запуску",
			"Use the language of the currently active text editor if any": "Використовувати мову поточного активного текстового редактора, якщо такий є",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "умовний роздільник (' - '), який відображається лише тоді, коли оточений змінними зі значеннями",
			"an indicator for when the active editor has unsaved changes": "індикатор, що вказує, коли активний редактор має незбережені зміни",
			"e.g. SSH": "наприклад, SSH",
			"e.g. VS Code": "наприклад, VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "шлях до робочої області (наприклад, /Users/Development/myWorkspace)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "шлях до папки робочої області, в якій міститься файл (наприклад, /Users/Development/myFolder)",
			"gist": "gist",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "назва папки робочої області, в якій міститься файл (наприклад, myFolder)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "назва робочої області з необов'язковим віддаленим ім'ям та індикатором робочої області, якщо це застосовно (наприклад, myFolder, myRemoteFolder [SSH] або myWorkspace (робоча область))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "скорочене ім'я робочої області без суфіксів (наприклад, myFolder або myWorkspace)",
			"the file name (e.g. myFile.txt)": "ім'я файлу (наприклад, myFile.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "повний шлях до файлу (наприклад, /Users/Development/myFolder/myFileFolder/myFile.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "повний шлях до папки, в якій міститься файл (наприклад, /Users/Development/myFolder/myFileFolder)",
			"the name of the active branch in the active repository (e.g. main)": "назва активної гілки в активному репозиторії (наприклад, main)",
			"the name of the active repository (e.g. vscode)": "назва активного репозиторію (наприклад, vscode)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "назва папки, в якій міститься файл (наприклад, myFileFolder)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "шлях до файлу відносно папки робочої області (наприклад, myFolder/myFileFolder/myFile.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "шлях до папки, в якій міститься файл, відносно папки робочої області (наприклад, myFolder/myFileFolder)"
		},
		"package": {
			"description": "Надає можливості (такі як IntelliSense та автоматичне виправлення) для конфігураційних файлів, таких як файли параметрів, файли запуску та файли рекомендацій для розширень.",
			"displayName": "Редагування конфігурації"
		}
	}
}