{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"extension.description": "Налагодження JavaScript коду для веб-переглядача Chrome або інші цілі, який підтримує протокол Chrome налагоджувач.",
			"chrome.port.description": "Порт для віддаленого Chrome налагодження.",
			"chrome.address.description": "Протокол TCP/IP-адреса, порт налагодження",
			"chrome.file.description": "Локальний файл HTML для відкриття в браузері",
			"chrome.url.description": "Буде шукати вкладку з цим EXACT url і приєднати до неї, якщо буде знайдено",
			"chrome.webRoot.description": "Це вказує на абсолютний простір шлях до кореня веб-сервера. Використовується для дозволу шляхів, такі як `/app.js` до файлів на диску. Позначення pathMapping для \"/\"",
			"chrome.pathMapping.description": "Зіставлення URL-адреси/шляху до локальних папок, щоб вирішити скрипти в Chrome для скриптів на диску",
			"chrome.runtimeExecutable.description": "Робоче місце абсолютний шлях виконуваний файл, який буде використовуватися. Якщо не вказано, Chrome буде використовуватися за замовчуванням Місце установки.",
			"chrome.runtimeArgs.description": "Додаткові аргументи, передані в виконуваний файл.",
			"chrome.env.description": "Додатковий словник з оточення пари ключ/значення.",
			"chrome.cwd.description": "Додатковий робочий каталог для виконуваного файлу.",
			"chrome.sourceMaps.description": "Використання JavaScript джерело мапи (якщо вони існують).",
			"chrome.diagnosticLogging.description": "Коли правда, адаптер входить його власна діагностична інформація на консолі в зрозумілому людині форматі",
			"chrome.verboseDiagnosticLogging.description": "Коли правда, адаптер реєструє весь трафік з клієнта і цілі (а також інформація до журналу 'diagnosticLogging')",
			"chrome.trace.description": "Коли \"true\" налагоджувач буде реєструвати відомості трасування до файлу. Коли 'verbose' ('Докладно'), також покаже журнали в консолі.",
			"chrome.userDataDir.description": "За замовчуванням, хром запускається в окремому профілі користувача в папці Temp. Використовуйте цей параметр, щоб змінити його. Встановіть значення false, щоб запустити зі свого профілю користувача за замовчуванням.",
			"chrome.sourceMapPathOverrides.description": "Набір зв'язок для переписування розташування вихідних файлів від того, що sourcemap каже, їх розташування на диску. Дивіться readme для деталей.",
			"chrome.smartStep.description": "Автоматично крок через код, який не може бути зіставлений назад до першоджерела.",
			"chrome.skipFiles.description": "Масив імен файлів або папок, або глоб. шляхів, які потрібно пропустити при налагодженні.",
			"chrome.timeout.description": "Повторити цю кількість мілісекунд, щоб підключитися до Chrome. Значенням за замовчанням є 10000 ms.",
			"chrome.disableNetworkCache.description": "Визначає, чи слід пропустити кеш мережі для кожного запиту",
			"chrome.urlFilter.description": "Буде шукати сторінку з цим URL і прикласти до нього, якщо знайшли. Може бути * шаблони.",
			"chrome.showAsyncStacks.description": "Показати на асинхронні виклики, які призвели до поточного стеку викликів",
			"chrome.breakOnLoad.description": "Експериментальна функція - якщо це правда, налагодження адаптер буде намагатися встановити точки зупину в сценарії, перш ніж вони будуть завантажені, так що можу вдарити точки зупинки у початок ці скрипти. Має відбиток впливу.",
			"chrome.breakOnLoadStrategy.description": "Стратегії для використання на breakOnLoad.",
			"chrome.breakOnLoadStrategy.instrument.description": "Повідомте Chrome, щоб призупинити, як завантажиться кожен скрипт, вирішивши джерела слів і встановивши точки зупинки",
			"chrome.breakOnLoadStrategy.regex.description": "Оптимістично встановлює точки зупинки у файлах з таким самим ім'ям, як і файл, у якому встановлена точка переривання."
		},
		"out/src/chromeDebugAdapter": {
			"attribute.chrome.missing": "Не вдалося знайти Chrome - встановити його або встановити поле \"runtimeExecutable\" в запуску конфігурації."
		},
		"out/src/errors": {
			"attribute.path.not.exist": "Атрибут '{0}' не існує ('{1}')."
		},
		"out/src/extension": {
			"chrome.launch.name": "Запуску Chrome від localhost",
			"chrome.targets.placeholder": "Виберіть вкладку"
		}
	}
}