{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"$ref '{0}' in '{1}' can not be resolved.": "$ref \"{0}\" в \"{1}\" неможливо дозволити.",
			"<empty>": "<empty>",
			"A default value. Used by suggestions.": "Значення за замовчуванням. Використовується для пропозицій.",
			"A descriptive title of the element.": "Описовий заголовок елемента.",
			"A long description of the element. Used in hover menus and suggestions.": "Довгий опис елемента. Використовується в спливаючих меню та пропозиціях.",
			"A map of property names to either an array of property names or a schema. An array of property names means the property named in the key depends on the properties in the array being present in the object in order to be valid. If the value is a schema, then the schema is only applied to the object if the property in the key exists on the object.": "Карта імен властивостей, які можуть бути або масивом імен властивостей, або схемою. Масив імен властивостей означає, що властивість, зазначена в ключі, залежить від наявності властивостей з масиву в об'єкті, щоб бути дійсною. Якщо значення є схемою, то схема застосовується до об'єкта, лише якщо властивість з ключем існує в об'єкті.",
			"A map of property names to schemas for each property.": "Карта імен властивостей до схем для кожної властивості.",
			"A map of regular expressions on property names to schemas for matching properties.": "Карта регулярних виразів імен властивостей до схем для відповідних властивостей.",
			"A number that should cleanly divide the current value (i.e. have no remainder).": "Число, яке повинно чисто ділити поточне значення (тобто не мати залишку).",
			"A regular expression to match the string against. It is not implicitly anchored.": "Регулярний вираз для відповідності рядку. Він не є неявно прив'язаним.",
			"A schema which must not match.": "Схема, яка не повинна відповідати.",
			"A unique identifier for the schema.": "Унікальний ідентифікатор схеми.",
			"An array instance is valid against \"contains\" if at least one of its elements is valid against the given schema.": "Екземпляр масиву є дійсним для \"contains\", якщо принаймні один з його елементів є дійсним для вказаної схеми.",
			"An array of schemas, all of which must match.": "Масив схем, всі з яких повинні відповідати.",
			"An array of schemas, exactly one of which must match.": "Масив схем, з яких точно одна повинна відповідати.",
			"An array of schemas, where at least one must match.": "Масив схем, де принаймні одна повинна відповідати.",
			"An array of strings that lists the names of all properties required on this object.": "Масив рядків, який перераховує імена всіх властивостей, необхідних для цього об'єкта.",
			"An instance validates successfully against this keyword if its value is equal to the value of the keyword.": "Екземпляр успішно перевіряється за цим ключовим словом, якщо його значення дорівнює значенню ключового слова.",
			"Array does not contain required item.": "Масив не містить обов'язковий елемент.",
			"Array has duplicate items.": "Масив містить дубльовані елементи.",
			"Array has too few items that match the contains contraint. Expected {0} or more.": "У масиві замало елементів, які відповідають обмеженню \"contains\". Очікується {0} або більше.",
			"Array has too few items. Expected {0} or more.": "У масиві замало елементів. Очікується принаймні {0}.",
			"Array has too many items according to schema. Expected {0} or fewer.": "Масив містить забагато елементів згідно з схемою. Очікується {0} або менше.",
			"Array has too many items that match the contains contraint. Expected {0} or less.": "У масиві забагато елементів, які відповідають обмеженню \"contains\". Очікується {0} або менше.",
			"Array has too many items. Expected {0} or fewer.": "Масив містить забагато елементів. Очікується {0} або менше.",
			"Colon expected": "Очікується двокрапка",
			"Comments are not permitted in JSON.": "Коментарі не дозволені в JSON.",
			"Comments from schema authors to readers or maintainers of the schema.": "Коментарі від авторів схеми до читачів або обслуговувальників схеми.",
			"Configure": "Налаштувати",
			"Configured by extension: {0}": "Налаштовано розширенням: {0}",
			"Configured in user settings": "Налаштовано в налаштуваннях користувача",
			"Configured in workspace settings": "Налаштовано в налаштуваннях робочого простору",
			"Default value": "Значення за замовчуванням",
			"Describes the content encoding of a string property.": "Описує кодування вмісту властивості рядка.",
			"Describes the format expected for the value.": "Описує очікуваний формат значення.",
			"Describes the media type of a string property.": "Описує тип носія властивості рядка.",
			"Downloading schemas is disabled through setting '{0}'": "Завантаження схем вимкнено через налаштування \"{0}\"",
			"Downloading schemas is disabled. Click to configure.": "Завантаження схем вимкнено. Клацніть, щоб налаштувати.",
			"Draft-03 schemas are not supported.": "Схеми Draft-03 не підтримуються.",
			"Duplicate anchor declaration: '{0}'": "Повторне оголошення прив'язки: \"{0}\"",
			"Duplicate object key": "Дублювати ключ об'єкта",
			"Either a schema or a boolean. If a schema, then used to validate all properties not matched by 'properties' or 'patternProperties'. If false, then any properties not matched by either will cause this schema to fail.": "Схема або логічне значення. Якщо схема, то використовується для перевірки всіх властивостей, які не відповідають \"properties\" або \"patternProperties\". Якщо ЛОЖЬ, то будь-які властивості, які не відповідають жодному з них, призведуть до збою цієї схеми.",
			"Either a string of one of the basic schema types (number, integer, null, array, object, boolean, string) or an array of strings specifying a subset of those types.": "Рядок одного з основних типів схеми (число, ціле число, null, масив, об'єкт, логічне значення, рядок) або масив рядків, що вказує підмножину цих типів.",
			"End of file expected.": "Очікувався кінець файлу.",
			"Expected a JSON object, array or literal.": "Очікується об'єкт JSON, масив або літерал.",
			"Expected comma": "Очікується кома",
			"Expected comma or closing brace": "Очікується кома або закриваюча фігурна дужка.",
			"Expected comma or closing bracket": "Очікується кома або закриваюча дужка",
			"Failed to sort the JSONC document, please consider opening an issue.": "Не вдалося відсортувати документ JSONC, розгляньте можливість відкриття питання.",
			"For arrays, only when items is set as an array. If it is a schema, then this schema validates items after the ones specified by the items array. If it is false, then additional items will cause validation to fail.": "Для масивів, тільки коли елементи встановлені як масив. Якщо це схема, то ця схема перевіряє елементи після тих, що вказані в масиві елементів. Якщо це ЛОЖЬ, то додаткові елементи призведуть до збою перевірки.",
			"For arrays. Can either be a schema to validate every element against or an array of schemas to validate each item against in order (the first schema will validate the first element, the second schema will validate the second element, and so on.": "Для масивів. Може бути схемою для перевірки кожного елемента або масивом схем для перевірки кожного елемента в порядку (перша схема перевіряє перший елемент, друга схема перевіряє другий елемент і так далі).",
			"If all of the items in the array must be unique. Defaults to false.": "Якщо всі елементи масиву повинні бути унікальними. За замовчуванням - ЛОЖЬ.",
			"If the instance is an object, this keyword validates if every property name in the instance validates against the provided schema.": "Якщо екземпляр є об'єктом, це ключове слово перевіряє, чи відповідає кожне ім'я властивості в екземплярі наданій схемі.",
			"Incorrect type. Expected \"{0}\".": "Неправильний тип. Очікувався \"{0}\".",
			"Incorrect type. Expected one of {0}.": "Неправильний тип. Очікується одне з {0}.",
			"Indicates that the value of the instance is managed exclusively by the owning authority.": "Вказує, що значення екземпляра керується виключно власною владою.",
			"Invalid characters in string. Control characters must be escaped.": "Недійсні символи в рядку. Керуючі символи повинні бути екрановані.",
			"Invalid color format. Use #RGB, #RGBA, #RRGGBB or #RRGGBBAA.": "Недійсний формат кольору. Використовуйте #RGB, #RGBA, #RRGGBB або #RRGGBBAA.",
			"Invalid escape character in string.": "Недійсний символ екранування в рядку.",
			"Invalid number format.": "Недійсний формат числа.",
			"Invalid unicode sequence in string.": "Недійсна послідовність Юнікоду в рядку.",
			"Item does not match any validation rule from the array.": "Елемент не відповідає жодному правилу перевірки з масиву.",
			"JSON Language Server": "JSON мовний сервер",
			"JSON Outline Status": "Стан структури JSON",
			"JSON Validation Status": "Стан перевірки JSON",
			"JSON schema cache cleared.": "Кеш схеми JSON очищено.",
			"JSON schema configured": "Схема JSON налаштована",
			"JSON: Schema Resolution Error": "JSON: Помилка розрішення схеми",
			"Learn more about JSON schema configuration...": "Дізнайтеся більше про конфігурацію схеми JSON...",
			"Loading JSON info": "Завантаження інформації JSON",
			"Makes the maximum property exclusive.": "Робить максимальну властивість монопольною.",
			"Makes the minimum property exclusive.": "Робить мінімальну властивість монопольною.",
			"Matches a schema that is not allowed.": "Відповідає схемі, яка не дозволена.",
			"Matches multiple schemas when only one must validate.": "Відповідність кільком схемам, коли повинна перевірятися лише одна.",
			"Missing property \"{0}\".": "Відсутня властивість \"{0}\".",
			"New array": "Новий масив",
			"New object": "Новий об'єкт",
			"No Schema Validation": "Без перевірки схеми",
			"No schema configured for this file": "Для цього файлу не налаштована схема",
			"Not used for validation. Place subschemas here that you wish to reference inline with $ref.": "Не використовується для перевірки. Розмістіть тут вкладені схеми, на які ви хочете посилатися з $ref.",
			"Object has fewer properties than the required number of {0}": "Об'єкт має менше властивостей, ніж потрібна кількість {0}",
			"Object has more properties than limit of {0}.": "Об'єкт має більше властивостей, ніж обмеження {0}.",
			"Object is missing property {0} required by property {1}.": "У об'єкта відсутня властивість {0}, яку вимагає властивість {1}.",
			"Open Extension": "Відкрити розширення",
			"Open Settings": "Відкрити налаштування",
			"Outline": "Структура",
			"Problem reading content from '{0}': UTF-8 with BOM detected, only UTF 8 is allowed.": "Проблема з читанням вмісту з \"{0}\": виявлено UTF-8 з BOM, дозволений лише UTF 8.",
			"Problems loading reference '{0}': {1}": "Проблеми з завантаженням посилання \"{0}\": {1}",
			"Property expected": "Очікувана властивість",
			"Property keys must be doublequoted": "Ключі властивостей повинні бути подвійно закодовані",
			"Property {0} is not allowed.": "Властивість {0} не дозволена.",
			"Reference a definition hosted on any location.": "Посилання на визначення, розміщене в будь-якому місці.",
			"Sample JSON values associated with a particular schema, for the purpose of illustrating usage.": "Зразки значень JSON, пов'язані з певною схемою, для ілюстрації використання.",
			"Schema Validated": "Схема перевірена",
			"Select the schema to use for {0}": "Виберіть схему для використання для {0}",
			"Show Schemas": "Показати схеми",
			"Sort JSON": "Сортувати JSON",
			"String does not match the pattern of \"{0}\".": "Рядок не відповідає шаблону \"{0}\".",
			"String is longer than the maximum length of {0}.": "Рядок довший за максимальну довжину {0}.",
			"String is not a RFC3339 date-time.": "Рядок не є датою та часом RFC3339.",
			"String is not a RFC3339 date.": "Рядок не є датою RFC3339.",
			"String is not a RFC3339 time.": "Рядок не є часом RFC3339.",
			"String is not a URI: {0}": "Рядок не є URI: {0}.",
			"String is not a hostname.": "Рядок не є ім'ям хоста.",
			"String is not an IPv4 address.": "Рядок не є IPv4-адресою.",
			"String is not an IPv6 address.": "Рядок не є IPv6-адресою.",
			"String is not an e-mail address.": "Рядок не є адресою електронної пошти.",
			"String is shorter than the minimum length of {0}.": "Рядок коротший за мінімальну довжину {0}.",
			"The \"else\" subschema is used for validation when the \"if\" subschema fails.": "Підсхема \"else\" використовується для перевірки, коли підсхема \"if\" не вдається.",
			"The \"if\" subschema is used for validation when the \"if\" subschema succeeds.": "Підсхема \"if\" використовується для перевірки, коли підсхема \"if\" вдається.",
			"The maximum length of a string.": "Максимальна довжина рядка.",
			"The maximum number of items that can be inside an array. Inclusive.": "Максимальна кількість елементів, які можуть бути в масиві. Включно.",
			"The maximum number of properties an object can have. Inclusive.": "Максимальна кількість властивостей, які може мати об'єкт. Включно.",
			"The maximum numerical value, inclusive by default.": "Максимальне числове значення, включно за замовчуванням.",
			"The minimum length of a string.": "Мінімальна довжина рядка.",
			"The minimum number of items that can be inside an array. Inclusive.": "Мінімальна кількість елементів, які можуть бути в масиві. Включно.",
			"The minimum number of properties an object can have. Inclusive.": "Мінімальна кількість властивостей, які може мати об'єкт. Включно.",
			"The minimum numerical value, inclusive by default.": "Мінімальне числове значення, включно за замовчуванням.",
			"The schema to verify this document against.": "Схема для перевірки цього документа.",
			"The schema uses meta-schema features ({0}) that are not yet supported by the validator.": "Схема використовує функції метасхеми ({0}), які ще не підтримуються перевіряючим.",
			"The set of literal values that are valid.": "Набір допустимих літеральних значень.",
			"The validation outcome of the \"if\" subschema controls which of the \"then\" or \"else\" keywords are evaluated.": "Результат перевірки підсхеми \"if\" контролює, які ключові слова \"then\" або \"else\" оцінюються.",
			"Trailing comma": "Зайва кома в кінці",
			"URI expected.": "Очікується URI.",
			"URI is expected.": "Очікується URI.",
			"URI with a scheme is expected.": "Очікується URI з схемою.",
			"Unable to compute used schemas: No document": "Не вдалося обчислити використані схеми: немає документа",
			"Unable to compute used schemas: {0}": "Не вдалося обчислити використані схеми: {0}",
			"Unable to load schema from '{0}'. No schema request service available": "Не вдалося завантажити схему з \"{0}\". Немає доступної служби запиту схеми",
			"Unable to load schema from '{0}': No content.": "Не вдалося завантажити схему з \"{0}\": немає вмісту.",
			"Unable to load schema from '{0}': {1}.": "Не вдалося завантажити схему з \"{0}\": {1}.",
			"Unable to load {0}": "Не вдається завантажити {0}",
			"Unable to parse content from '{0}': Parse error at offset {1}.": "Не вдалося розібрати вміст з \"{0}\": Помилка розбору на зсуві {1}.",
			"Unable to resolve schema. Click to retry.": "Не вдалося вирішити схему. Клацніть, щоб повторити спробу.",
			"Unexpected end of comment.": "Неочікуваний кінець коментаря.",
			"Unexpected end of number.": "Неочікуваний кінець числа.",
			"Unexpected end of string.": "Неочікуваний кінець рядка.",
			"Value expected": "Очікуване значення",
			"Value is above the exclusive maximum of {0}.": "Значення перевищує виключний максимум {0}.",
			"Value is above the maximum of {0}.": "Значення перевищує максимум ({0}).",
			"Value is below the exclusive minimum of {0}.": "Значення менше виключного мінімуму {0}.",
			"Value is below the minimum of {0}.": "Значення менше мінімуму {0}.",
			"Value is deprecated": "Застаріле значення",
			"Value is not accepted. Valid values: {0}.": "Значення не приймається. Допустимі значення: {0}.",
			"Value is not divisible by {0}.": "Значення не ділиться на {0}.",
			"Value must be {0}.": "Значення повинно бути {0}.",
			"multiple JSON schemas configured": "налаштовано кілька JSON-схем",
			"no JSON schema configured": "JSON-схема не налаштована",
			"only {0} document symbols shown for performance reasons": "показано лише {0} символів документа з міркувань продуктивності"
		},
		"package": {
			"description": "Надає широку підтримку мови для файлів JSON.",
			"displayName": "Можливості мови JSON",
			"json.clickToRetry": "Клацніть, щоб повторити спробу.",
			"json.colorDecorators.enable.deprecationMessage": "Параметр \"json.colorDecorators.enable\" застарів. Тепер замість нього використовується параметр \"editor.colorDecorators\".",
			"json.colorDecorators.enable.desc": "Увімкнути або вимкнути декоратори кольору",
			"json.command.clearCache": "Очистити кеш схеми",
			"json.command.sort": "Сортування документа",
			"json.enableSchemaDownload.desc": "Якщо цей параметр встановлено, дозволяє отримувати схеми JSON з розташувань HTTP і HTTPS.",
			"json.format.enable.desc": "Увімкнути/вимкнути модуль форматування JSON за замовчуванням",
			"json.format.keepLines.desc": "Зберігати всі існуючі нові рядки при форматуванні.",
			"json.maxItemsComputed.desc": "Максимальна кількість обчислених символів структури документа та згортаних областей (обмежено з міркувань продуктивності).",
			"json.maxItemsExceededInformation.desc": "Показувати повідомлення, якщо перевищено максимальну кількість символів структури та згортаних областей.",
			"json.schemaResolutionErrorMessage": "Не вдалося вирішити схему.",
			"json.schemas.desc": "Зв'язок схем з JSON-файлами в поточному проекті.",
			"json.schemas.fileMatch.desc": "Масив масок файлів для перевірки відповідності при вирішенні файлів JSON в схеми. В якості підстановочних знаків можуть використовуватися \"*\" та \"**\". Також можуть бути визначені маски виключення, і вони повинні починатися з \"!\". Файл вважається відповідним, коли є принаймні одна відповідна маска, а остання відповідна маска не є маскою виключення.",
			"json.schemas.fileMatch.item.desc": "Маска файлу, яка може містити \"*\" та \"**\", з якими виконується порівняння при вирішенні JSON-файлів в схемах. Якщо маска починається з \"!\", вона визначає маску виключення.",
			"json.schemas.schema.desc": "Визначення схеми для вказаної URL-адреси. Схему необхідно вказати лише для того, щоб не звертатися за URL-адресою схеми.",
			"json.schemas.url.desc": "URL-адреса або абсолютний шлях до схеми. Може бути відносним шляхом (починається з \"./\") в параметрах робочої області та папки робочої області.",
			"json.tracing.desc": "Відстежує зв'язок між VS Code та мовним сервером JSON.",
			"json.validate.enable.desc": "Увімкнення або вимкнення перевірки JSON."
		}
	}
}