{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "\"store\" - логічний тест для подальшої оцінки в guard або if().",
			"'from' expected": "Очікується 'from'",
			"'in' expected": "Очікується 'в'",
			"'through' or 'to' expected": "Очікується 'through' або 'to'",
			"'{0}'": "'{0}'",
			"( expected": "Очікується '('",
			") expected": "Очікується ')'",
			"<undefined>": "<не визначено>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "У правилі @font-face повинні бути визначені властивості 'src' та 'font-family'.",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Список властивостей, які не перевіряються за правилом `unknownProperties`.",
			"Adds quotes to a string.": "Додає лапки до рядка.",
			"Also define the standard property '{0}' for compatibility": "Також визначте стандартну властивість '{0}' для сумісності",
			"Always define standard rule '@keyframes' when defining keyframes.": "Завжди визначайте стандартне правило '@keyframes' при визначенні ключових кадрів.",
			"Always include all vendor specific properties: Missing: {0}": "Завжди включайте всі специфічні для постачальника властивості: Відсутні: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Завжди включайте всі специфічні для постачальника правила: Відсутні: {0}",
			"Appends a single value onto the end of a list.": "Додає одне значення в кінець списку.",
			"Appends selectors to one another without spaces in between.": "Додає селектори один до одного без пробілів між ними.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Уникайте використання !important. Це свідчить про те, що специфічність всього CSS вийшла з-під контролю і потребує рефакторингу.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Уникайте використання 'float'. Елементи 'float' призводять до хиткого CSS, який легко розбити, якщо зміниться один аспект розмітки.",
			"CSS Language Server": "Сервер мови CSS",
			"CSS fix is outdated and can't be applied to the document.": "Виправлення CSS застаріло і не може бути застосовано до документа.",
			"Causes one or more rules to be emitted at the root of the document.": "Призводить до видачі одного або декількох правил в корені документа.",
			"Changes one or more properties of a color.": "Змінює одну або декілька властивостей кольору.",
			"Changes the alpha component for a color.": "Змінює альфа-компонент для кольору.",
			"Changes the hue of a color.": "Змінює відтінок кольору.",
			"Combines several lists into a single multidimensional list.": "Об'єднує кілька списків в один багатовимірний список.",
			"Converts a color into the format understood by IE filters.": "Перетворює колір в формат, зрозумілий фільтрам IE.",
			"Converts a color to grayscale.": "Перетворює колір в відтінки сірого.",
			"Converts a string to lower case.": "Перетворює рядок в нижній регістр.",
			"Converts a string to upper case.": "Перетворює рядок в верхній регістр.",
			"Converts a unitless number to a percentage.": "Перетворює число без одиниць відношення в відсоткове значення.",
			"Creates a Color from hue, saturation, and lightness values.": "Створює колір на основі значень відтінку, насиченості та світлості.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Створює колір на основі значень відтінку, насиченості, світлості та альфа-компонента.",
			"Creates a Color from hue, white, and black values.": "Створює колір на основі значень відтінку, білого та чорного.",
			"Creates a Color from lightness, a, and b values.": "Створює колір на основі значень світлості, a та b.",
			"Creates a Color from lightness, chroma, and hue values.": "Створює колір на основі значень світлості, хрома та відтінку.",
			"Creates a Color from red, green, and blue values.": "Створює колір на основі значень червоного, зеленого та синього.",
			"Creates a Color from red, green, blue, and alpha values.": "Створює колір на основі значень червоного, зеленого, синього та альфа-компонента.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Створює колір на основі значень відтінку, насиченості та світлості іншого кольору.",
			"Creates a Color from the hue, white, and black values of another Color.": "Створює колір на основі значень відтінку, білого та чорного іншого кольору.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Створює колір на основі значень світлості, a та b іншого кольору.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Створює колір на основі значень світлості, хрома та відтінку іншого кольору.",
			"Creates a Color from the red, green, and blue values of another Color.": "Створює колір на основі значень червоного, зеленого та синього іншого кольору.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Створює колір у певному кольоровому просторі на основі значень червоного, зеленого та синього.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Створює колір у певному кольоровому просторі на основі значень червоного, зеленого та синього іншого кольору.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Визначає складні операції, які можна повторно використовувати в таблицях стилів.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Визначає стилі, які можна повторно використовувати в таблиці стилів за допомогою `@include`.",
			"Do not use duplicate style definitions": "Не використовуйте дублюючі визначення стилів.",
			"Do not use empty rulesets": "Не використовуйте порожні набори правил",
			"Do not use width or height when using padding or border": "Не використовуйте ширину або висоту при використанні відступу або рамки",
			"Dynamically calls a Sass function.": "Динамічно викликає функцію Sass.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Цикл Each, який встановлює `$var` для кожного елемента у списку або мапі, а потім виводить стилі, які він містить, використовуючи значення `$var`.",
			"Exposes the details of Sass’s inner workings.": "Відображає деталі внутрішньої роботи Sass.",
			"Extends $extendee with $extender within $selector.": "Розширює $extendee з $extender в $selector.",
			"Extracts a substring from $string.": "Виділяє підрядок з $string.",
			"Failed to apply CSS fix to the document. Please consider opening an issue with steps to reproduce.": "Не вдалося застосувати виправлення CSS до документа. Розгляньте можливість відкриття питання з кроками для відтворення.",
			"Finds the maximum of several numbers.": "Знаходить максимум з кількох чисел.",
			"Finds the minimum of several numbers.": "Знаходить мінімум з кількох чисел.",
			"Fluidly scales one or more properties of a color.": "Плавно масштабує одну або декілька властивостей кольору.",
			"Folding Region End": "Кінець області згортання",
			"Folding Region Start": "Початок згортаної області",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Цикл For, який повторно виводить набір стилів для кожного `$var` в розділі `from/through` або `from/to`.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Генерує нові кольори на основі існуючих, що спрощує створення кольорових тем.",
			"Gets the blue component of a color.": "Отримує синій компонент кольору.",
			"Gets the green component of a color.": "Отримує зелений компонент кольору.",
			"Gets the hue component of a color.": "Отримує відтінок кольору.",
			"Gets the lightness component of a color.": "Отримує компонент світлості кольору.",
			"Gets the opacity component of a color.": "Отримує компонент непрозорості кольору.",
			"Gets the red component of a color.": "Отримує червоний компонент кольору.",
			"Gets the saturation component of a color.": "Отримує компонент насиченості кольору.",
			"Hex colors must consist of three, four, six or eight hex numbers": "Шістнадцяткові кольори повинні складатися з трьох, чотирьох, шести або восьми шістнадцяткових чисел.",
			"IE hacks are only necessary when supporting IE7 and older": "Хаки для IE необхідні лише при підтримці IE7 та старших версій",
			"Import statements do not load in parallel": "Оператори імпорту не завантажуються паралельно",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Включає тіло, якщо вираз не обчислюється як `false` або `null`.",
			"Includes the styles defined by another mixin into the current rule.": "Включає стилі, визначені іншою примісю, в поточне правило.",
			"Increases or decreases one or more components of a color.": "Збільшує або зменшує один ао декілька компонентів кольору.",
			"Inherits the styles of another selector.": "Наслідує стилі іншого селектора.",
			"Inserts $insert into $string at $index.": "Вставляє $insert в $string на позицію $index.",
			"Invalid number of parameters": "Неправильна кількість параметрів",
			"Joins together two lists into one.": "Об'єднує два списки в один.",
			"Lets you access and modify values in lists.": "Дозволяє отримувати доступ до значень у списках та змінювати їх.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Завантажує таблицю стилів Sass і робить її приміси, функції та змінні доступними, коли ця таблиця стилів завантажується за допомогою правила @use.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Завантажує приміси, функції та змінні з інших таблиць стилів Sass як 'модулі' і об'єднує CSS з кількох таблиць стилів.",
			"Makes a color darker.": "Робить колір темнішим.",
			"Makes a color less saturated.": "Робить колір менш насиченим.",
			"Makes a color lighter.": "Робить колір світлішим.",
			"Makes a color more opaque.": "Робить колір більш непрозорим.",
			"Makes a color more saturated.": "Робить колір більш насиченим.",
			"Makes a color more transparent.": "Робить колір більш прозорим.",
			"Makes it easy to combine, search, or split apart strings.": "Дозволяє легко комбінувати, шукати або розбивати рядки.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Дозволяє знаходити значення, пов'язане з ключем на карті, та багато іншого.",
			"Merges two maps together into a new map.": "Об'єднує дві карти в одну нову карту.",
			"Mix two colors together in a polar color space.": "Змішує два кольори в полярному кольоровому просторі.",
			"Mix two colors together in a rectangular color space.": "Змішує два кольори в прямокутному кольоровому просторі.",
			"Mixes two colors together.": "Змішує два кольори.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Вкладає селектори один під одним, як вони були б вкладені в таблицю стилів.",
			"No unit for zero needed": "Не потрібна одиниця для нуля",
			"Parses a selector into the format returned by &.": "Розбирає селектор у формат, який повертає &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Виводить значення виразу в потік виведення стандартної помилки. Корисно для відлагодження складних файлів Sass.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Виводить значення виразу в потік виведення стандартної помилки. Корисно для бібліотек, які повинні попереджати користувачів про застарілість або відновлення після незначних помилок використання примісей. Попередження можна вимкнути за допомогою параметра командного рядка `--quiet` або параметра `:quiet` Sass.",
			"Property is ignored due to the display.": "Властивість ігнорується через відображення.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Властивість ігнорується через відображення. З параметром \"display: block\" не слід використовувати вертикальне вирівнювання.",
			"Provides access to Sass’s powerful selector engine.": "Надає доступ до потужного селекторного двигуна Sass.",
			"Provides functions that operate on numbers.": "Надає функції, які працюють з числами.",
			"Removes quotes from a string.": "Видаляє лапки з рядка.",
			"Rename to '{0}'": "Перейменуйте на \"{0}\"",
			"Replaces $original with $replacement within $selector.": "Замінює $original на $replacement в $selector.",
			"Replaces the nth item in a list.": "Замінює n-й елемент у списку.",
			"Returns a list of all keys in a map.": "Повертає список всіх ключів у карті.",
			"Returns a list of all values in a map.": "Повертає список всіх значень у карті.",
			"Returns a new map with keys removed.": "Повертає нову карту з видаленими ключами.",
			"Returns a random number.": "Повертає випадкове число.",
			"Returns a specific item in a list.": "Повертає конкретний елемент у списку.",
			"Returns the absolute value of a number.": "Повертає абсолютне значення числа.",
			"Returns the complement of a color.": "Повертає доповнення кольору.",
			"Returns the index of the first occurance of $substring in $string.": "Повертає індекс першого входження $substring у $string.",
			"Returns the inverse of a color.": "Повертає обернений колір.",
			"Returns the keywords passed to a function that takes variable arguments.": "Повертає ключові слова, передані функції, яка приймає змінні аргументи.",
			"Returns the length of a list.": "Повертає довжину списку.",
			"Returns the number of characters in a string.": "Повертає кількість символів у рядку.",
			"Returns the position of a value within a list.": "Повертає позицію значення у списку.",
			"Returns the separator of a list.": "Повертає роздільник списку.",
			"Returns the simple selectors that comprise a compound selector.": "Повертає прості селектори, що складають складений селектор.",
			"Returns the string representation of a value as it would be represented in Sass.": "Повертає рядкове представлення значення так, як воно було б представлене в Sass.",
			"Returns the type of a value.": "Повертає тип значення.",
			"Returns the unit(s) associated with a number.": "Повертає одиницю(и), пов'язану(і) з числом.",
			"Returns the value in a map associated with a given key.": "Повертає значення в карті, пов'язане з заданим ключем.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Повертає, чи відповідає $super всім елементам, які відповідають $sub, і, можливо, більше.",
			"Returns whether a feature exists in the current Sass runtime.": "Повертає, чи існує функція в поточному середовищі виконання Sass.",
			"Returns whether a function with the given name exists.": "Повертає, чи існує функція з заданим ім'ям.",
			"Returns whether a map has a value associated with a given key.": "Повертає, чи має карта значення, пов'язане з заданим ключем.",
			"Returns whether a mixin with the given name exists.": "Повертає, чи існує приміс з заданим ім'ям.",
			"Returns whether a number has units.": "Повертає, чи має число одиниці виміру.",
			"Returns whether a variable with the given name exists in the current scope.": "Повертає, чи існує змінна з заданим ім'ям в поточному області видимості.",
			"Returns whether a variable with the given name exists in the global scope.": "Повертає, чи існує змінна з заданим ім'ям в глобальній області видимості.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Повертає, чи можна додавати, віднімати або порівнювати два числа.",
			"Rounds a number down to the previous whole number.": "Округлює число вниз до попереднього цілого числа.",
			"Rounds a number to the nearest whole number.": "Округлює число до найближчого цілого числа.",
			"Rounds a number up to the next whole number.": "Округлює число вгору до наступного цілого числа.",
			"Sass documentation": "Документація Sass",
			"Selector Specificity": "Специфічність селектора",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Селектори не повинні містити ідентифікатори, оскільки ці правила занадто тісно пов'язані з HTML.",
			"The universal selector (*) is known to be slow": "Відомо, що універсальний селектор (*) працює повільно",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Викидає значення виразу як фатальну помилку з трасуванням стеку. Корисно для перевірки аргументів примісей та функцій.",
			"URI expected": "Очікується URI",
			"URL encodes a string": "URL-кодує рядок",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Об'єднує два селектори, щоб створити селектор, який відповідає елементам, які відповідають обом.",
			"Unknown at-rule.": "Невідоме правило at.",
			"Unknown property.": "Невідома властивість.",
			"Unknown property: '{0}'": "Невідома властивість: '{0}'",
			"Unknown vendor specific property.": "Невідома властивість постачальника.",
			"When using a vendor-specific prefix also include the standard property": "При використанні префікса постачальника також включайте стандартну властивість",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "При використанні префікса постачальника також включайте всі інші властивості постачальника",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Цикл While, який приймає вираз і повторно виводить вкладені стилі, поки вираз не оцінюється як «false».",
			"[ expected": "[ Очікується",
			"] expected": "Очікується ]",
			"absolute value of a number": "абсолютне значення числа",
			"arccosine - inverse of cosine function": "арккосинус - обернена функція косинуса",
			"arcsine - inverse of sine function": "арксинус - обернена функція синуса",
			"arctangent - inverse of tangent function": "арктангенс - обернена функція тангенса",
			"argument from '{0}'": "аргумент з \"{0}\"",
			"at-rule or selector expected": "очікується правило at або селектор",
			"at-rule unknown": "невідоме правило at",
			"bind the evaluation of a ruleset to each member of a list.": "пов'язати оцінку набору правил з кожним елементом списку.",
			"calculates square root of a number": "обчислює квадратний корінь числа",
			"colon expected": "очікується двокрапка",
			"comma expected": "очікується кома",
			"condition expected": "очікується умова",
			"converts numbers from one type into another": "перетворює числа з одного типу в інший",
			"converts to a %, e.g. 0.5 > 50%": "перетворює в %, наприклад 0.5 > 50%",
			"cosine function": "функція косинуса",
			"creates a #AARRGGBB": "створює #AARRGGBB",
			"creates a color": "створює колір",
			"dot expected": "очікується крапка",
			"escape string content": "екранує вміст рядка",
			"expression expected": "очікується вираз",
			"first argument modulus second argument": "залишок від ділення першого аргумента на другий аргумент",
			"first argument raised to the power of the second argument": "перший аргумент піднесений до степеня другого аргумента",
			"generate a list spanning a range of values": "створює список, що охоплює діапазон значень",
			"identifier expected": "очікувався ідентифікатор",
			"identifier or variable expected": "очікувався ідентифікатор або змінна",
			"identifier or wildcard expected": "очікувався ідентифікатор або символ підстановки",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "inline-block ігнорується через float. Якщо 'float' має значення, відмінне від 'none', блок плаває, а 'display' розглядається як 'block'",
			"inlines a resource and falls back to `url()`": "вбудовує ресурс і використовує `url()` як резерв",
			"media query expected": "очікувався запит мультимедіа",
			"number expected": "очікувався номер",
			"operator expected": "очікувався оператор",
			"page directive or declaraton expected": "очікувався директива або декларація сторінки",
			"parses a string to a color": "розбирає рядок на колір",
			"percentage expected": "очікувався відсоток",
			"property value expected": "очікувалося значення властивості",
			"remove or change the unit of a dimension": "видалити або змінити одиницю виміру",
			"return `@color` 10% points darker": "повернути `@color` на 10% темніше",
			"return `@color` 10% points less saturated": "повернути `@color` на 10% менше насиченості",
			"return `@color` 10% points less transparent": "повернути `@color` на 10% менше прозорості",
			"return `@color` 10% points lighter": "повернути `@color` на 10% світліше",
			"return `@color` 10% points more saturated": "повернути `@color` на 10% більше насиченості",
			"return `@color` 10% points more transparent": "повернути `@color` на 10% більше прозорості",
			"return `@color` with 50% transparency": "повернути `@color` з прозорістю 50%",
			"return `@color` with a 10 degree larger in hue": "повернути `@color` з відтінком, більшим на 10 градусів",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "повернути `@darkcolor`, якщо `@color1 > 43% luma`, в іншому випадку повернути `@lightcolor`, див. примітки",
			"return a mix of `@color1` and `@color2`": "повернути суміш `@color1` і `@color2`",
			"returns a grey, 100% desaturated color": "повернути сірий, 100% ненасичений колір",
			"returns a value at the specified position in the list": "повернути значення на вказаній позиції в списку",
			"returns one of two values depending on a condition.": "повернути одне з двох значень в залежності від умови.",
			"returns pi": "повернути число Пі",
			"returns the `alpha` channel of `@color`": "повертає канал \"альфа\" для \"@color\"",
			"returns the `blue` channel of `@color`": "повертає канал \"синій\" для \"@color\"",
			"returns the `green` channel of `@color`": "повертає канал \"зелений\" для \"@color\"",
			"returns the `hue` channel of `@color` in the HSL space": "повертає канал \"відтінок\" для \"@color\" в просторі HSL",
			"returns the `hue` channel of `@color` in the HSV space": "повертає канал \"відтінок\" для \"@color\" в просторі HSV",
			"returns the `lightness` channel of `@color` in the HSL space": "повертає канал \"світлість\" для \"@color\" в просторі HSL",
			"returns the `luma` value (perceptual brightness) of `@color`": "повертає значення \"яскравість\" (відчутна яскравість) для \"@color\"",
			"returns the `red` channel of `@color`": "повертає канал \"червоний\" для \"@color\"",
			"returns the `saturation` channel of `@color` in the HSL space": "повертає канал \"насиченість\" для \"@color\" в просторі HSL",
			"returns the `saturation` channel of `@color` in the HSV space": "повертає канал \"насиченість\" для \"@color\" в просторі HSV",
			"returns the `value` channel of `@color` in the HSV space": "повертає канал \"значення\" для \"@color\" в просторі HSV",
			"returns the lowest of one or more values": "повертає найменше з одного або кількох значень",
			"returns the number of elements in a value list": "повертає кількість елементів у списку значень",
			"rounds a number to a number of places": "округлює число до певної кількості знаків",
			"rounds down to an integer": "округлює до найближчого меншого цілого числа",
			"rounds up to an integer": "округлює до найближчого більшого цілого числа",
			"selector expected": "очікується селектор",
			"semi-colon expected": "очікується крапка з комою",
			"sine function": "функція синуса",
			"string literal expected": "очікується рядковий літерал",
			"string replace": "заміна рядка",
			"tangent function": "тангенс-функція",
			"term expected": "очікується термін",
			"unknown keyword": "невідоме ключове слово",
			"uri or string expected": "очікується URI або рядок",
			"variable name expected": "очікується ім'я змінної",
			"variable value expected": "очікується значення змінної",
			"whitespace expected": "очікується пробіл",
			"wildcard expected": "очікується символ підстановки",
			"{ expected": "Очікується {",
			"{0}, '{1}'": "{0}, '{1}'",
			"} expected": "Очікується }"
		},
		"package": {
			"css.colorDecorators.enable.deprecationMessage": "Параметр \"css.colorDecorators.enable\" застарів. Тепер замість нього використовується параметр \"editor.colorDecorators\". ",
			"css.completion.completePropertyWithSemicolon.desc": "Вставте крапку з комою в кінці рядка при заповненні властивостей CSS.",
			"css.completion.triggerPropertyValueCompletion.desc": "За замовчуванням VS Code активує завершення значення властивості після вибору властивості CSS. Використовуйте цей параметр, щоб вимкнути таку поведінку.",
			"css.customData.desc": "Список відносних шляхів до файлів JSON, перед якими вказано [формат користувацьких даних](https://github.com/microsoft/vscode-css-languageservice/blob/master/docs/customData.md).\r\n\r\nVS Code завантажує користувацькі дані при запуску, щоб покращити підтримку каскадних таблиць стилів для користувацьких властивостей (змінних), at-правил, псевдокласів та псевдоелементів, вказаних у файлах JSON.\r\n\r\nШляхи до файлів задаються відносно робочої області, і враховуються лише параметри папки робочої області.",
			"css.format.braceStyle.desc": "Розмістіть фігурні дужки на тому ж рядку, що і правила (`collapse) або розмістіть фігурні дужки на власному рядку (`expand`).",
			"css.format.enable.desc": "Увімкнути/вимкнути стандартний форматувальник CSS.",
			"css.format.maxPreserveNewLines.desc": "Максимальна кількість розривів рядків, які зберігаються в одному блоку, якщо включений параметр `#css.format.preserveNewLines#`.",
			"css.format.newlineBetweenRules.desc": "Розділити набори правил порожнім рядком.",
			"css.format.newlineBetweenSelectors.desc": "Розділити селектори новим рядком.",
			"css.format.preserveNewLines.desc": "Чи слід зберігати існуючі розриви рядків перед елементами.",
			"css.format.spaceAroundSelectorSeparator.desc": "Переконайтеся, що є пробіли навколо роздільників селектора \">\", \"+\", \"~\" (наприклад, `a > b`).",
			"css.hover.documentation": "Показувати документацію по властивостях та значеннях при наведенні курсора на каскадні таблиці стилів.",
			"css.hover.references": "Відображати посилання на MDN при наведенні курсора миші в CSS.",
			"css.lint.argumentsInColorFunction.desc": "Неправильна кількість параметрів.",
			"css.lint.boxModel.desc": "Не використовуйте параметри 'width' або 'height' при вказанні параметрів 'padding' або 'border'. ",
			"css.lint.compatibleVendorPrefixes.desc": "При використанні префікса постачальника також вказуйте інші властивості постачальника.",
			"css.lint.duplicateProperties.desc": "Не використовуйте дублюючі визначення стилів.",
			"css.lint.emptyRules.desc": "Не використовуйте порожні набори правил.",
			"css.lint.float.desc": "Спробуйте не використовувати елементи \"float\". Елементи \"float\" можуть порушити роботу коду CSS, якщо змінити один з аспектів розмітки.",
			"css.lint.fontFaceProperties.desc": "У правилі \"@font-face\" повинні бути визначені властивості \"src\" та \"font-family\". ",
			"css.lint.hexColorLength.desc": "Кольори у шістнадцятковому форматі повинні містити 3, 4, 6 або 8 шістнадцяткових чисел.",
			"css.lint.idSelector.desc": "Селектори не повинні містити ідентифікаторів, оскільки ці правила занадто тісно пов'язані з HTML.",
			"css.lint.ieHack.desc": "Корисні поради для Internet Explorer потрібні лише при підтримці Internet Explorer 7 та більш ранніх версій.",
			"css.lint.importStatement.desc": "Оператори імпорту не завантажуються паралельно.",
			"css.lint.important.desc": "Спробуйте не використовувати !important, оскільки це свідчить про те, що весь код CSS став некерованим і його потрібно переробити.",
			"css.lint.propertyIgnoredDueToDisplay.desc": "Властивість була проігнорована через значення параметра \"display\". Наприклад, при вказанні значення \"display: inline\" властивості \"width\", \"height\", \"margin-top\", \"margin-bottom\" та \"float\" не працюють.",
			"css.lint.universalSelector.desc": "Універсальний селектор (*) працює повільно.",
			"css.lint.unknownAtRules.desc": "Невідоме правило at.",
			"css.lint.unknownProperties.desc": "Невідома властивість.",
			"css.lint.unknownVendorSpecificProperties.desc": "Невідома властивість постачальника.",
			"css.lint.validProperties.desc": "Список властивостей, для яких не перевіряється правило \"unknownProperties\". ",
			"css.lint.vendorPrefix.desc": "При використанні префікса постачальника також вказуйте стандартну властивість.",
			"css.lint.zeroUnits.desc": "Для нуля не потрібна одиниця виміру.",
			"css.title": "CSS",
			"css.trace.server.desc": "Відстежує обмін даними між VS Code та мовним сервером CSS.",
			"css.validate.desc": "Увімкнути або вимкнути всі перевірки.",
			"css.validate.title": "Керує перевіркою CSS та серйозністю проблем.",
			"description": "Надає широку підтримку мови для файлів CSS, LESS та SCSS.",
			"displayName": "Можливості мови CSS",
			"less.colorDecorators.enable.deprecationMessage": "Параметр \"less.colorDecorators.enable\" застарів. Тепер замість нього використовується параметр \"editor.colorDecorators\". ",
			"less.completion.completePropertyWithSemicolon.desc": "Вставити крапку з комою в кінці рядка при заповненні властивостей CSS.",
			"less.completion.triggerPropertyValueCompletion.desc": "За замовчуванням, після вибору властивості CSS, VS Code активує завершення значення властивості. Використовуйте цей параметр, щоб вимкнути таку поведінку.",
			"less.format.braceStyle.desc": "Розмістити фігурні дужки на тому ж рядку, що і правила (`collapse`), або розмістити фігурні дужки на окремому рядку (`expand`).",
			"less.format.enable.desc": "Увімкнути/вимкнути стандартний форматувальник LESS.",
			"less.format.maxPreserveNewLines.desc": "Максимальна кількість розривів рядків, які зберігаються в одному блоку, якщо включений параметр `#less.format.preserveNewLines#`.",
			"less.format.newlineBetweenRules.desc": "Розділити набори правил порожнім рядком.",
			"less.format.newlineBetweenSelectors.desc": "Розділити селектори новим рядком.",
			"less.format.preserveNewLines.desc": "Чи слід зберігати існуючі розриви рядків перед елементами.",
			"less.format.spaceAroundSelectorSeparator.desc": "Переконайтеся, що є пробіли навколо роздільників селектора \">\", \"+\", \"~\" (наприклад, `a > b`).",
			"less.hover.documentation": "Показувати документацію для властивостей та значень при наведенні курсора на LESS.",
			"less.hover.references": "Відображати посилання на MDN при наведенні курсора миші на LESS.",
			"less.lint.argumentsInColorFunction.desc": "Неправильна кількість параметрів.",
			"less.lint.boxModel.desc": "Не використовуйте параметри 'width' або 'height' при вказі параметрів 'padding' або 'border'. ",
			"less.lint.compatibleVendorPrefixes.desc": "При використанні префікса постачальника також вказуйте інші властивості постачальника.",
			"less.lint.duplicateProperties.desc": "Не використовуйте дублюючі визначення стилів.",
			"less.lint.emptyRules.desc": "Не використовуйте порожні набори правил.",
			"less.lint.float.desc": "Спробуйте не використовувати елементи \"float\". Елементи \"float\" можуть порушити роботу коду CSS, якщо змінити один з аспектів розмітки.",
			"less.lint.fontFaceProperties.desc": "У правилі \"@font-face\" повинні бути визначені властивості \"src\" та \"font-family\". ",
			"less.lint.hexColorLength.desc": "Кольори у шістнадцятковому форматі повинні містити 3, 4, 6 або 8 шістнадцяткових чисел.",
			"less.lint.idSelector.desc": "Селектори не повинні містити ідентифікаторів, оскільки ці правила занадто тісно пов'язані з HTML.",
			"less.lint.ieHack.desc": "Корисні поради для Internet Explorer потрібні лише при підтримці Internet Explorer 7 та більш ранніх версій.",
			"less.lint.importStatement.desc": "Оператори імпорту не завантажуються паралельно.",
			"less.lint.important.desc": "Спробуйте не використовувати !important, оскільки це свідчить про те, що весь код CSS став некерованим і його потрібно переробити.",
			"less.lint.propertyIgnoredDueToDisplay.desc": "Властивість була проігнорована через значення параметра \"display\". Наприклад, при вказанні значення \"display: inline\" властивості \"width\", \"height\", \"margin-top\", \"margin-bottom\" та \"float\" не працюють.",
			"less.lint.universalSelector.desc": "Універсальний селектор (*) працює повільно.",
			"less.lint.unknownAtRules.desc": "Невідоме правило at.",
			"less.lint.unknownProperties.desc": "Невідома властивість.",
			"less.lint.unknownVendorSpecificProperties.desc": "Невідома властивість постачальника.",
			"less.lint.validProperties.desc": "Список властивостей, для яких не перевіряється правило \"unknownProperties\". ",
			"less.lint.vendorPrefix.desc": "При використанні префікса постачальника також вказуйте стандартну властивість.",
			"less.lint.zeroUnits.desc": "Для нуля не потрібна одиниця виміру.",
			"less.title": "LESS",
			"less.validate.desc": "Увімкнути або вимкнути всі перевірки.",
			"less.validate.title": "Керує перевіркою LESS та серйозністю проблем. ",
			"scss.colorDecorators.enable.deprecationMessage": "Параметр \"scss.colorDecorators.enable\" застарів. Тепер замість нього використовується параметр \"editor.colorDecorators\". ",
			"scss.completion.completePropertyWithSemicolon.desc": "Вставити крапку з комою в кінці рядка при заповненні властивостей CSS.",
			"scss.completion.triggerPropertyValueCompletion.desc": "За замовчуванням, після вибору властивості CSS, VS Code активує завершення значення властивості. Використовуйте цей параметр, щоб вимкнути таку поведінку.",
			"scss.format.braceStyle.desc": "Розмістити фігурні дужки на тому ж рядку, що і правила (`collapse`), або розмістити фігурні дужки на окремому рядку (`expand`).",
			"scss.format.enable.desc": "Увімкнути/вимкнути стандартний форматувальник SCSS.",
			"scss.format.maxPreserveNewLines.desc": "Максимальна кількість розривів рядків, які зберігаються в одному блоку, якщо включений параметр `#scss.format.preserveNewLines#`.",
			"scss.format.newlineBetweenRules.desc": "Розділити набори правил порожнім рядком.",
			"scss.format.newlineBetweenSelectors.desc": "Розділити селектори новим рядком.",
			"scss.format.preserveNewLines.desc": "Чи слід зберігати існуючі розриви рядків перед елементами.",
			"scss.format.spaceAroundSelectorSeparator.desc": "Переконайтеся, що є пробіли навколо роздільників селектора \">\", \"+\", \"~\" (наприклад, `a > b`).",
			"scss.hover.documentation": "Показувати документацію для властивостей та значень при наведенні курсора SCSS.",
			"scss.hover.references": "Відображати посилання на MDN при наведенні курсора миші в SCSS.",
			"scss.lint.argumentsInColorFunction.desc": "Неправильна кількість параметрів.",
			"scss.lint.boxModel.desc": "Не використовуйте параметри 'width' або 'height' при вказі параметрів 'padding' або 'border'. ",
			"scss.lint.compatibleVendorPrefixes.desc": "При використанні префікса постачальника також вказуйте інші властивості постачальника.",
			"scss.lint.duplicateProperties.desc": "Не використовуйте дублюючі визначення стилів.",
			"scss.lint.emptyRules.desc": "Не використовуйте порожні набори правил.",
			"scss.lint.float.desc": "Намагайтеся не використовувати елементи \"float\". Елементи \"float\" можуть порушити роботу CSS-коду, якщо змінити один з аспектів розмітки.",
			"scss.lint.fontFaceProperties.desc": "У правилі \"@font-face\" повинні бути визначені властивості \"src\" та \"font-family\". ",
			"scss.lint.hexColorLength.desc": "Кольори у шістнадцятковому форматі повинні містити 3, 4, 6 або 8 шістнадцяткових чисел.",
			"scss.lint.idSelector.desc": "Селектори не повинні містити ідентифікаторів, оскільки ці правила занадто тісно пов'язані з HTML.",
			"scss.lint.ieHack.desc": "Корисні поради для Internet Explorer потрібні лише при підтримці Internet Explorer 7 та більш ранніх версій.",
			"scss.lint.importStatement.desc": "Оператори імпорту не завантажуються паралельно.",
			"scss.lint.important.desc": "Намагайтеся не використовувати !important, оскільки це свідчить про те, що весь CSS-код став неуправляємим і його потрібно переробити.",
			"scss.lint.propertyIgnoredDueToDisplay.desc": "Властивість була проігнорована через значення параметра \"display\". Наприклад, при вказанні значення \"display: inline\" властивості \"width\", \"height\", \"margin-top\", \"margin-bottom\" та \"float\" не працюють.",
			"scss.lint.universalSelector.desc": "Універсальний селектор (*) працює повільно.",
			"scss.lint.unknownAtRules.desc": "Невідоме правило at.",
			"scss.lint.unknownProperties.desc": "Невідома властивість.",
			"scss.lint.unknownVendorSpecificProperties.desc": "Невідома властивість постачальника.",
			"scss.lint.validProperties.desc": "Список властивостей, для яких не перевіряється правило \"unknownProperties\". ",
			"scss.lint.vendorPrefix.desc": "При використанні префікса постачальника також вказуйте стандартну властивість.",
			"scss.lint.zeroUnits.desc": "Для нуля не потрібна одиниця виміру.",
			"scss.title": "SCSS (SASS)",
			"scss.validate.desc": "Увімкнути або вимкнути всі перевірки.",
			"scss.validate.title": "Керує перевіркою SCSS та рівнями серйозності проблем."
		}
	}
}