{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Continue to GitHub": "Перейти до GitHub",
			"Continue to GitHub to create a Personal Access Token (PAT)": "Перейдіть до GitHub, щоб створити персональний токен доступу (PAT)",
			"Copy & Continue to GitHub": "Скопіювати та продовжити до GitHub",
			"GitHub Enterprise Server URI is not a valid URI: {0}": "URI сервера GitHub Enterprise не є дійсним URI: {0}",
			"Having trouble logging in? Would you like to try a different way? ({0})": "Виникли проблеми з входом? Хочете спробувати інший спосіб? ({0})",
			"No": "Ні",
			"Open [{0}]({0}) in a new tab and paste your one-time code: {1}/The [{0}]({0}) will be a url and the {1} will be a code, e.g. 123-456{Locked=\"[{0}]({0})\"}": "Відкрийте [{0}]({0}) в новій вкладці та вставте одноразовий код: {1}",
			"Sign in failed: {0}": "Не вдалося увійти: {0}",
			"Sign out failed: {0}": "Не вдалося вийти: {0}",
			"Signing in to {0}.../The {0} will be a url, e.g. github.com": "Виконується вхід до {0}...",
			"To finish authenticating, navigate to GitHub and paste in the above one-time code.": "Щоб завершити аутентифікацію, перейдіть до GitHub та вставте вищезазначений одноразовий код.",
			"To finish authenticating, navigate to GitHub to create a PAT then paste the PAT into the input box.": "Щоб завершити аутентифікацію, перейдіть до GitHub, створіть персональний токен доступу (PAT), а потім вставте його в поле введення.",
			"Yes": "Так",
			"You have not yet finished authorizing this extension to use GitHub. Would you like to try a different way? ({0})": "Ви ще не завершили авторизацію цього розширення для використання GitHub. Хочете спробувати інший спосіб? ({0})",
			"Your Code: {0}/The {0} will be a code, e.g. 123-456": "Ваш код: {0}",
			"device code": "код пристрою",
			"local server": "локальний сервер",
			"personal access token": "персональний токен доступу",
			"url handler": "обробник URL-адрес"
		},
		"package": {
			"description": "Постачальник аутентифікації GitHub",
			"displayName": "Аутентифікація GitHub"
		}
	}
}