{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "«зберегти» логічний тест для подальшої оцінки в гарді або if().",
			"'from' expected": "очікується 'from'",
			"'in' expected": "Очікується 'in'",
			"'through' or 'to' expected": "Очікується 'through' або 'to'",
			"'{0}'": "'{0}'",
			"( expected": "Очікується '('",
			") expected": "Очікується ')'",
			"<undefined>": "<не визначено>",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "Правило @font-face повинно визначати властивості 'src' та 'font-family'.",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Список властивостей, які не перевіряються за правилом 'unknownProperties'.",
			"Adds quotes to a string.": "Додає лапки до рядка.",
			"Also define the standard property '{0}' for compatibility": "Також визначте стандартну властивість '{0}' для сумісності",
			"Always define standard rule '@keyframes' when defining keyframes.": "Завжди визначайте стандартне правило '@keyframes' при визначенні ключових кадрів.",
			"Always include all vendor specific properties: Missing: {0}": "Завжди включайте всі специфічні властивості постачальника: Відсутні: {0}",
			"Always include all vendor specific rules: Missing: {0}": "Завжди включайте всі специфічні правила постачальника: Відсутні: {0}",
			"Appends a single value onto the end of a list.": "Додає одне значення в кінець списку.",
			"Appends selectors to one another without spaces in between.": "Додає селектори один до одного без пробілів між ними.",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Уникайте використання !important. Це свідчить про те, що специфічність всього CSS вийшла з-під контролю і потребує рефакторингу.",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Уникайте використання 'float'. Floats призводять до крихкого CSS, який легко розбити, якщо зміниться один аспект розмітки.",
			"Causes one or more rules to be emitted at the root of the document.": "Призводить до випуску одного або декількох правил в корені документа.",
			"Changes one or more properties of a color.": "Змінює одну або декілька властивостей кольору.",
			"Changes the alpha component for a color.": "Змінює альфа-компонент для кольору.",
			"Changes the hue of a color.": "Змінює відтінок кольору.",
			"Character entity representing '{0}'": "Сутність знаку, що представляє '{0}'",
			"Character entity representing '{0}', unicode equivalent '{1}'": "Сутність знаку, що представляє '{0}', еквівалент Юнікоду '{1}'",
			"Closing bracket expected.": "Очікується закриваюча дужка.",
			"Closing bracket missing.": "Відсутня закриваюча дужка.",
			"Combines several lists into a single multidimensional list.": "Об'єднує кілька списків в один багатовимірний список.",
			"Configure": "Налаштувати",
			"Converts a color into the format understood by IE filters.": "Перетворює колір у формат, зрозумілий для фільтрів IE.",
			"Converts a color to grayscale.": "Перетворює колір у відтінки сірого.",
			"Converts a string to lower case.": "Перетворює рядок у нижній регістр.",
			"Converts a string to upper case.": "Перетворює рядок у верхній регістр.",
			"Converts a unitless number to a percentage.": "Перетворює число без одиниць відношення на відсоток.",
			"Creates a Color from hue, saturation, and lightness values.": "Створює колір на основі значень відтінку, насиченості та освітленості.",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Створює колір на основі значень відтінку, насиченості, освітленості та альфа-каналу.",
			"Creates a Color from hue, white, and black values.": "Створює колір на основі значень відтінку, білого та чорного.",
			"Creates a Color from lightness, a, and b values.": "Створює колір на основі значень освітленості, a та b.",
			"Creates a Color from lightness, chroma, and hue values.": "Створює колір на основі значень освітленості, насиченості та відтінку.",
			"Creates a Color from red, green, and blue values.": "Створює колір на основі значень червоного, зеленого та синього.",
			"Creates a Color from red, green, blue, and alpha values.": "Створює колір на основі значень червоного, зеленого, синього та альфа-каналу.",
			"Creates a Color from the hue, saturation, and lightness values of another Color.": "Створює колір на основі значень відтінку, насиченості та освітленості іншого кольору.",
			"Creates a Color from the hue, white, and black values of another Color.": "Створює колір на основі значень відтінку, білого та чорного іншого кольору.",
			"Creates a Color from the lightness, a, and b values of another Color.": "Створює колір на основі значень освітленості, a та b іншого кольору.",
			"Creates a Color from the lightness, chroma, and hue values of another Color.": "Створює колір на основі значень освітленості, насиченості та відтінку іншого кольору.",
			"Creates a Color from the red, green, and blue values of another Color.": "Створює колір на основі значень червоного, зеленого та синього іншого кольору.",
			"Creates a Color in a specific color space from red, green, and blue values.": "Створює колір у певному кольоровому просторі на основі значень червоного, зеленого та синього.",
			"Creates a Color in a specific color space from the red, green, and blue values of another Color.": "Створює колір у певному кольоровому просторі на основі значень червоного, зеленого та синього іншого кольору.",
			"Defines complex operations that can be re-used throughout stylesheets.": "Визначає складні операції, які можна повторно використовувати в таблицях стилів.",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Визначає стилі, які можна повторно використовувати в таблиці стилів за допомогою `@include`.",
			"Do not use duplicate style definitions": "Не використовуйте дублюючі визначення стилів.",
			"Do not use empty rulesets": "Не використовуйте порожні набори правил",
			"Do not use width or height when using padding or border": "Не використовуйте ширину або висоту при використанні відступу або рамки",
			"Dynamically calls a Sass function.": "Динамічно викликає функцію Sass.",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Цикл Each, який встановлює `$var` для кожного елемента у списку або мапі, а потім виводить стилі, які він містить, використовуючи значення `$var`.",
			"End tag name expected.": "Очікується закриваюче ім'я тегу.",
			"Exposes the details of Sass’s inner workings.": "Відкриває деталі внутрішньої роботи Sass.",
			"Extends $extendee with $extender within $selector.": "Розширює $extendee з $extender в межах $selector.",
			"Extracts a substring from $string.": "Виділяє підрядок з $string.",
			"Finds the maximum of several numbers.": "Знаходить максимум з кількох чисел.",
			"Finds the minimum of several numbers.": "Знаходить мінімум з кількох чисел.",
			"Fluidly scales one or more properties of a color.": "Плавно масштабує одну або декілька властивостей кольору.",
			"Folding Region End": "Кінець згортаного регіону",
			"Folding Region Start": "Початок згортаного регіону",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Цикл For, який повторно виводить набір стилів для кожного `$var` в розділі `from/through` або `from/to`.",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Генерує нові кольори на основі існуючих, що спрощує створення кольорових тем.",
			"Gets the blue component of a color.": "Отримує синій компонент кольору.",
			"Gets the green component of a color.": "Отримує зелений компонент кольору.",
			"Gets the hue component of a color.": "Отримує компонент відтінку кольору.",
			"Gets the lightness component of a color.": "Отримує компонент освітленості кольору.",
			"Gets the opacity component of a color.": "Отримує компонент непрозорості кольору.",
			"Gets the red component of a color.": "Отримує червоний компонент кольору.",
			"Gets the saturation component of a color.": "Отримує компонент насиченості кольору.",
			"HTML Language Server": "Сервер мови HTML",
			"Hex colors must consist of three, four, six or eight hex numbers": "Шістнадцяткові кольори повинні складатися з трьох, чотирьох, шести або восьми шістнадцяткових чисел.",
			"IE hacks are only necessary when supporting IE7 and older": "Взломи IE необхідні лише при підтримці IE7 і старших версій.",
			"Import statements do not load in parallel": "Оператори імпорту не завантажуються паралельно",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Включає тіло, якщо вираз не обчислюється як `false` або `null`.",
			"Includes the styles defined by another mixin into the current rule.": "Включає стилі, визначені іншою примісю, в поточне правило.",
			"Increases or decreases one or more components of a color.": "Збільшує або зменшує один або кілька компонентів кольору.",
			"Inherits the styles of another selector.": "Наслідує стилі іншого селектора.",
			"Inserts $insert into $string at $index.": "Вставляє $insert у $string на позицію $index.",
			"Invalid number of parameters": "Неправильна кількість параметрів",
			"Joins together two lists into one.": "Об'єднує два списки в один.",
			"Lets you access and modify values in lists.": "Дозволяє отримувати доступ до значень у списку та змінювати їх.",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Завантажує таблицю стилів Sass і робить її приміси, функції та змінні доступними, коли ця таблиця стилів завантажується з правилом @use.",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Завантажує приміси, функції та змінні з інших таблиць стилів Sass як \"модулі\" та об'єднує CSS з кількох таблиць стилів.",
			"Makes a color darker.": "Робить колір темнішим.",
			"Makes a color less saturated.": "Робить колір менш насиченим.",
			"Makes a color lighter.": "Робить колір світлішим.",
			"Makes a color more opaque.": "Робить колір більш непрозорим.",
			"Makes a color more saturated.": "Робить колір більш насиченим.",
			"Makes a color more transparent.": "Робить колір більш прозорим.",
			"Makes it easy to combine, search, or split apart strings.": "Дозволяє легко комбінувати, шукати або розбивати рядки.",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Дозволяє знаходити значення, пов'язане з ключем у карті та багато іншого.",
			"Merges two maps together into a new map.": "Об'єднує дві карти в одну нову карту.",
			"Mix two colors together in a polar color space.": "Змішує два кольори в полярному кольоровому просторі.",
			"Mix two colors together in a rectangular color space.": "Змішує два кольори в прямокутному кольоровому просторі.",
			"Mixes two colors together.": "Змішує два кольори.",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Вкладає селектори один під одним, як вони були б вкладені в таблиці стилів.",
			"No unit for zero needed": "Не потрібна одиниця для нуля",
			"Parses a selector into the format returned by &.": "Аналізує селектор у формат, який повертає &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Виводить значення виразу в потік виведення стандартної помилки. Корисно для налагодження складних файлів Sass.",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Виводить значення виразу в потік виведення стандартної помилки. Корисно для бібліотек, які повинні попереджати користувачів про застарілість або відновлення від незначних помилок використання міксинів. Попередження можна вимкнути за допомогою параметра командного рядка `--quiet` або параметра `:quiet` Sass.",
			"Property is ignored due to the display.": "Властивість ігнорується через відображення.",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Властивість ігнорується через відображення. З 'display: block' не слід використовувати vertical-align.",
			"Provides access to Sass’s powerful selector engine.": "Надає доступ до потужного селекторного двигуна Sass.",
			"Provides functions that operate on numbers.": "Надає функції, які працюють з числами.",
			"Removes quotes from a string.": "Видаляє лапки з рядка.",
			"Rename to '{0}'": "Перейменуйте на '{0}'",
			"Replaces $original with $replacement within $selector.": "Замінює $original на $replacement в межах $selector.",
			"Replaces the nth item in a list.": "Замінює n-й елемент у списку.",
			"Returns a list of all keys in a map.": "Повертає список всіх ключів у карті.",
			"Returns a list of all values in a map.": "Повертає список всіх значень у карті.",
			"Returns a new map with keys removed.": "Повертає нову карту з видаленими ключами.",
			"Returns a random number.": "Повертає випадкове число.",
			"Returns a specific item in a list.": "Повертає конкретний елемент у списку.",
			"Returns the absolute value of a number.": "Повертає абсолютне значення числа.",
			"Returns the complement of a color.": "Повертає доповнення кольору.",
			"Returns the index of the first occurance of $substring in $string.": "Повертає індекс першого входження $substring у $string.",
			"Returns the inverse of a color.": "Повертає обернений колір.",
			"Returns the keywords passed to a function that takes variable arguments.": "Повертає ключові слова, передані функції, яка приймає змінні аргументи.",
			"Returns the length of a list.": "Повертає довжину списку.",
			"Returns the number of characters in a string.": "Повертає кількість символів у рядку.",
			"Returns the position of a value within a list.": "Повертає позицію значення у списку.",
			"Returns the separator of a list.": "Повертає роздільник списку.",
			"Returns the simple selectors that comprise a compound selector.": "Повертає прості селектори, що складають складений селектор.",
			"Returns the string representation of a value as it would be represented in Sass.": "Повертає рядкове представлення значення так, як воно було б представлене в Sass.",
			"Returns the type of a value.": "Повертає тип значення.",
			"Returns the unit(s) associated with a number.": "Повертає одиниці, пов'язані з числом.",
			"Returns the value in a map associated with a given key.": "Повертає значення в карті, пов'язане з заданим ключем.",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Повертає, чи відповідає $super всім елементам, які відповідають $sub, і, можливо, більше.",
			"Returns whether a feature exists in the current Sass runtime.": "Повертає, чи існує функція в поточному середовищі виконання Sass.",
			"Returns whether a function with the given name exists.": "Повертає, чи існує функція з заданим ім'ям.",
			"Returns whether a map has a value associated with a given key.": "Повертає, чи має карта значення, пов'язане з заданим ключем.",
			"Returns whether a mixin with the given name exists.": "Повертає, чи існує змішування з заданим ім'ям.",
			"Returns whether a number has units.": "Повертає, чи має число одиниці.",
			"Returns whether a variable with the given name exists in the current scope.": "Повертає, чи існує змінна з заданим ім'ям в поточному обсязі.",
			"Returns whether a variable with the given name exists in the global scope.": "Повертає, чи існує змінна з заданим ім'ям в глобальному обсязі видимості.",
			"Returns whether two numbers can be added, subtracted, or compared.": "Повертає, чи можна додавати, віднімати або порівнювати два числа.",
			"Rounds a number down to the previous whole number.": "Округлює число вниз до попереднього цілого числа.",
			"Rounds a number to the nearest whole number.": "Округлює число до найближчого цілого числа.",
			"Rounds a number up to the next whole number.": "Округлює число вгору до наступного цілого числа.",
			"Sass documentation": "Документація Sass",
			"Selector Specificity": "Специфічність селектора",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Селектори не повинні містити ідентифікатори, оскільки ці правила занадто тісно пов'язані з HTML.",
			"Simple HTML5 starting point": "Проста початкова точка HTML5",
			"Start tag name expected.": "Очікується ім'я відкриваючого тега.",
			"Tag name must directly follow the open bracket.": "Ім'я тега повинно безпосередньо слідувати за відкриваючою дужкою.",
			"The universal selector (*) is known to be slow": "Відомо, що універсальний селектор (*) працює повільно",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Викидає значення виразу як фатальну помилку з трасуванням стеку. Корисно для перевірки аргументів для змішувань та функцій.",
			"URI expected": "Очікується URI",
			"URL encodes a string": "URL кодує рядок",
			"Unexpected character in tag.": "Неочікуваний символ у тезі.",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Об'єднує два селектори, щоб створити селектор, який відповідає елементам, які відповідають обом.",
			"Unknown at-rule.": "Невідоме правило at-rule.",
			"Unknown property.": "Невідома властивість.",
			"Unknown property: '{0}'": "Невідома властивість: \"{0}\"",
			"Unknown vendor specific property.": "Невідома властивість постачальника.",
			"VS Code now has built-in support for auto-renaming tags. Do you want to enable it?": "Тепер VS Code має вбудовану підтримку автоматичного перейменування тегів. Хочете ввімкнути цю функцію?",
			"When using a vendor-specific prefix also include the standard property": "При використанні префікса, специфічного для постачальника, також включайте стандартну властивість",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "При використанні префікса, специфічного для постачальника, переконайтеся, що ви також включили всі інші властивості, специфічні для постачальника.",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Цикл While, який приймає вираз і повторно виводить вкладені стилі, поки оператор не оцінюється як `false`.",
			"[ expected": "Очікується \"[\"",
			"] expected": "Очікується ]",
			"absolute value of a number": "абсолютне значення числа",
			"arccosine - inverse of cosine function": "арккосинус - обернена функція косинуса",
			"arcsine - inverse of sine function": "арксинус - обернена функція синуса",
			"arctangent - inverse of tangent function": "арктангенс - обернена функція тангенса",
			"argument from '{0}'": "аргумент з \"{0}\"",
			"at-rule or selector expected": "очікується правило at-rule або селектор",
			"at-rule unknown": "невідоме правило at-rule",
			"bind the evaluation of a ruleset to each member of a list.": "прив'язка оцінки набору правил до кожного елемента списку.",
			"calculates square root of a number": "обчислює квадратний корінь числа",
			"colon expected": "очікується двокрапка",
			"comma expected": "очікується кома",
			"condition expected": "очікується умова",
			"converts numbers from one type into another": "перетворює числа з одного типу в інший",
			"converts to a %, e.g. 0.5 > 50%": "перетворює в %, наприклад 0.5 > 50%",
			"cosine function": "функція косинуса",
			"creates a #AARRGGBB": "створює #AARRGGBB",
			"creates a color": "створює колір",
			"dot expected": "очікується крапка",
			"escape string content": "екранує вміст рядка",
			"expression expected": "очікується вираз",
			"first argument modulus second argument": "залишок від ділення першого аргумента на другий аргумент",
			"first argument raised to the power of the second argument": "перший аргумент піднесений до степеня другого аргумента",
			"generate a list spanning a range of values": "створює список, що охоплює діапазон значень",
			"identifier expected": "очікується ідентифікатор",
			"identifier or variable expected": "очікується ідентифікатор або змінна",
			"identifier or wildcard expected": "очікується ідентифікатор або символ підстановки",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "inline-block ігнорується через float. Якщо 'float' має значення, відмінне від 'none', блок плаває, а 'display' розглядається як 'block'",
			"inlines a resource and falls back to `url()`": "вбудовує ресурс і відповідає `url()`",
			"media query expected": "очікується запит мультимедіа",
			"number expected": "очікується число",
			"operator expected": "очікується оператор",
			"page directive or declaraton expected": "очікується директива сторінки або декларація",
			"parses a string to a color": "аналізує рядок у колір",
			"percentage expected": "очікується відсоток",
			"property value expected": "очікується значення властивості",
			"remove or change the unit of a dimension": "видалити або змінити одиницю виміру розміру",
			"return `@color` 10% points darker": "повертає `@color` на 10% темніше",
			"return `@color` 10% points less saturated": "повертає `@color` на 10% менше насиченості",
			"return `@color` 10% points less transparent": "повертає `@color` на 10% менше прозорості",
			"return `@color` 10% points lighter": "повертає `@color` на 10% світліше",
			"return `@color` 10% points more saturated": "повертає `@color` на 10% більше насиченості",
			"return `@color` 10% points more transparent": "повертає `@color` на 10% більше прозорості",
			"return `@color` with 50% transparency": "повертає `@color` з прозорістю 50%",
			"return `@color` with a 10 degree larger in hue": "повертає `@color` з відтінком, більшим на 10 градусів",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "повертає `@darkcolor`, якщо `@color1 > 43% luma`, в іншому випадку повертає `@lightcolor`, див. примітки",
			"return a mix of `@color1` and `@color2`": "повертає суміш `@color1` і `@color2`",
			"returns a grey, 100% desaturated color": "повертає сірий колір, 100% ненасичений",
			"returns a value at the specified position in the list": "повертає значення на вказаній позиції у списку",
			"returns one of two values depending on a condition.": "повертає одне з двох значень в залежності від умови.",
			"returns pi": "повертає число Пі",
			"returns the `alpha` channel of `@color`": "повертає канал `alpha` кольору `@color`",
			"returns the `blue` channel of `@color`": "повертає канал `blue` кольору `@color`",
			"returns the `green` channel of `@color`": "повертає канал `green` кольору `@color`",
			"returns the `hue` channel of `@color` in the HSL space": "повертає канал `hue` кольору `@color` в просторі HSL",
			"returns the `hue` channel of `@color` in the HSV space": "повертає канал `hue` кольору `@color` в просторі HSV",
			"returns the `lightness` channel of `@color` in the HSL space": "повертає канал `lightness` кольору `@color` в просторі HSL",
			"returns the `luma` value (perceptual brightness) of `@color`": "повертає значення `luma` (сприйнятлива яскравість) кольору `@color`",
			"returns the `red` channel of `@color`": "повертає канал `red` кольору `@color`",
			"returns the `saturation` channel of `@color` in the HSL space": "повертає канал `saturation` кольору `@color` в просторі HSL",
			"returns the `saturation` channel of `@color` in the HSV space": "повертає канал `saturation` кольору `@color` в просторі HSV",
			"returns the `value` channel of `@color` in the HSV space": "повертає канал `value` кольору `@color` в просторі HSV",
			"returns the lowest of one or more values": "повертає найменше з одного або кількох значень",
			"returns the number of elements in a value list": "повертає кількість елементів у списку значень",
			"rounds a number to a number of places": "округлює число до певної кількості знаків",
			"rounds down to an integer": "округлює до найближчого меншого цілого числа",
			"rounds up to an integer": "округлює до найближчого більшого цілого числа",
			"selector expected": "очікується селектор",
			"semi-colon expected": "очікується крапка з комою",
			"sine function": "функція синуса",
			"string literal expected": "очікується літерал рядка",
			"string replace": "заміна рядка",
			"tangent function": "функція тангенсу",
			"term expected": "очікується термін",
			"unknown keyword": "невідомий ключове слово",
			"uri or string expected": "очікується URI або рядок",
			"variable name expected": "очікується ім'я змінної",
			"variable value expected": "очікується значення змінної",
			"whitespace expected": "очікується пробіл",
			"wildcard expected": "очікується символ підстановки",
			"{ expected": "Потрібно \"{\"",
			"{0}, '{1}'": "{0}, \"{1}\"",
			"} expected": "Потрібно \"}\""
		},
		"package": {
			"description": "Забезпечує повноцінну підтримку мов для файлів Handlebar та HTML",
			"displayName": "Можливості мови HTML",
			"html.autoClosingTags": "Увімкнути або вимкнути автоматичне закриття тегів HTML.",
			"html.autoCreateQuotes": "Увімкнення або вимкнення автоматичного створення лапок для призначення атрибутів HTML. Тип лапок можна налаштувати за допомогою `#html.completion.attributeDefaultValue#`.",
			"html.completion.attributeDefaultValue": "Керує значенням атрибутів за замовчуванням, коли виконання прийнято.",
			"html.completion.attributeDefaultValue.doublequotes": "Для атрибута задано значення \"\".",
			"html.completion.attributeDefaultValue.empty": "Значення атрибута не задано.",
			"html.completion.attributeDefaultValue.singlequotes": "Для атрибута задано значення \".",
			"html.customData.desc": "Список відносних шляхів до файлів, що вказують на JSON-файли, які відповідають [власному формату даних](https://github.com/microsoft/vscode-html-languageservice/blob/master/docs/customData.md).\r\n\r\nVS Code завантажує користувацькі дані при запуску, щоб покращити підтримку HTML для користувацьких HTML-тегів, атрибутів та значень атрибутів, вказаних у JSON-файлах.\r\n\r\nШляхи до файлів вказуються відносно робочої області та враховуються лише параметри папки робочої області.",
			"html.format.contentUnformatted.desc": "Розділенний комами список тегів, в яких формат вмісту не повинен змінюватися. Значення \"null\" задається за замовчуванням для тега \"pre\".",
			"html.format.enable.desc": "Увімкнути/вимкнути засіб форматування HTML за замовчуванням.",
			"html.format.extraLiners.desc": "Список тегів з роздільниками-комами та додатковими новими рядками між ними. Значення \"null\" за замовчуванням використовує \"head, body, /html\".",
			"html.format.indentHandlebars.desc": "Формат та відступ \"{{#foo}}\" та \"{{/foo}}\".",
			"html.format.indentInnerHtml.desc": "Відступ для розділів <head> та <body>.",
			"html.format.maxPreserveNewLines.desc": "Максимальна кількість розривів рядків для збереження в блоку. Щоб вказати необмежену кількість рядків, використовуйте \"null\".",
			"html.format.preserveNewLines.desc": "Визначає, чи слід зберігати розриви рядків перед елементами. Працює лише перед елементами, а не всередині тегів або для тексту.",
			"html.format.templating.desc": "Дотримання мовних тегів для створення шаблонів Django, erb, Handlebars та PHP.",
			"html.format.unformatted.desc": "Список тегів, які не слід повторно форматувати, з роздільниками-комами. Значення \"NULL\" за замовчуванням означає всі теги, перераховані на сторінці https://www.w3.org/TR/html5/dom.html#phrasing-content.",
			"html.format.unformattedContentDelimiter.desc": "Збереження текстового вмісту між цим рядком.",
			"html.format.wrapAttributes.alignedmultiple": "Переносити рядок при перевищенні довжини рядка, вирівнювати атрибути по вертикалі.",
			"html.format.wrapAttributes.auto": "Перенос атрибутів лише при перевищенні довжини рядка.",
			"html.format.wrapAttributes.desc": "Перенос атрибутів.",
			"html.format.wrapAttributes.force": "Примусово переносити всі атрибути, крім першого.",
			"html.format.wrapAttributes.forcealign": "Примусово переносити всі атрибути, крім першого, і зберігати вирівнювання.",
			"html.format.wrapAttributes.forcemultiline": "Примусово переносити всі атрибути.",
			"html.format.wrapAttributes.preserve": "Зберігати перенос атрибутів.",
			"html.format.wrapAttributes.preservealigned": "Зберігати перенос атрибутів з вирівнюванням.",
			"html.format.wrapAttributesIndentSize.desc": "Відступ для атрибутів з переносом після N символів. Вкажіть значення \"null\", щоб використовувати розмір відступу за замовчуванням. Ігнорується, якщо для параметра \"#html.format.wrapAttributes#\" задано значення \"aligned\".",
			"html.format.wrapLineLength.desc": "Максимальна кількість символів на рядок (0 - вимкнути).",
			"html.hover.documentation": "Відображати документацію тега та атрибута при наведенні.",
			"html.hover.references": "Відображати посилання на MDN при наведенні.",
			"html.mirrorCursorOnMatchingTag": "Увімкнути/вимкнути дзеркальний курсор на відповідному HTML-тезі.",
			"html.mirrorCursorOnMatchingTagDeprecationMessage": "Не рекомендується; використовуйте замість цього параметра \"editor.linkedEditing\"",
			"html.suggest.html5.desc": "Визначає, чи пропонувати вбудовану підтримку мови HTML теги, властивості та значення HTML5.",
			"html.trace.server.desc": "Відстежує обмін даними між VS Code та мовним сервером HTML.",
			"html.validate.scripts": "Визначає, чи перевіряти вбудовану підтримку мови HTML вбудовані сценарії.",
			"html.validate.styles": "Визначає, чи перевіряти вбудовану підтримку мови HTML вбудовані стилі."
		}
	}
}