{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Emmet Abbreviation": "Скорочення Emmet",
			"Enter Abbreviation": "Введіть скорочення",
			"Invalid emmet.variables field. See https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration for a valid example.": "Недійсне поле emmet.variables. Див. https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration для прикладу правильного використання.",
			"Invalid snippets file. See https://code.visualstudio.com/docs/editor/emmet#_using-custom-emmet-snippets for a valid example.": "Недійсний файл фрагментів. Див. https://code.visualstudio.com/docs/editor/emmet#_using-custom-emmet-snippets для прикладу правильного використання.",
			"Invalid syntax profile. See https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration for a valid example.": "Недійсний профіль синтаксису. Див. https://code.visualstudio.com/docs/editor/emmet#_emmet-configuration для прикладу правильного використання."
		},
		"package": {
			"command.balanceIn": "Баланс (вхідний)",
			"command.balanceOut": "Баланс (вихідний)",
			"command.decrementNumberByOne": "Зменшити значення на 1",
			"command.decrementNumberByOneTenth": "Зменшити значення на 0.1",
			"command.decrementNumberByTen": "Зменшити значення на 10",
			"command.evaluateMathExpression": "Обчислити математичний вираз",
			"command.incrementNumberByOne": "Збільшити значення на 1",
			"command.incrementNumberByOneTenth": "Збільшити значення на 0.1",
			"command.incrementNumberByTen": "Збільшити значення на 10",
			"command.matchTag": "Перейти до відповідної пари",
			"command.mergeLines": "Об'єднати рядки",
			"command.nextEditPoint": "Перейти до наступної точки редагування",
			"command.prevEditPoint": "Перейти до попередньої точки редагування",
			"command.reflectCSSValue": "Відобразити значення CSS",
			"command.removeTag": "Видалити тег",
			"command.selectNextItem": "Вибрати наступний елемент",
			"command.selectPrevItem": "Вибрати попередній елемент",
			"command.showEmmetCommands": "Показати команди Emmet",
			"command.splitJoinTag": "Розділити/об'єднати тег",
			"command.toggleComment": "Переключити коментар",
			"command.updateImageSize": "Оновити розмір зображення",
			"command.updateTag": "Оновити тег",
			"command.wrapWithAbbreviation": "Перенести зі скороченням",
			"description": "Підтримка Emmet для VS Code",
			"emmetExclude": "Масив мов, в яких не повинні розгортатися скорочення Emmet.",
			"emmetExtensionsPath": "Масив шляхів, де кожен шлях може містити профілі синтаксису Emmet та/або файли фрагментів.\r\nУ разі конфліктів профілів або фрагментів більш пізні шляхи перевизначатимуть ранніші шляхи.\r\nДодаткову інформацію та приклад файлу фрагмента див. на сторінці https://code.visualstudio.com/docs/editor/emmet.",
			"emmetExtensionsPathItem": "Шлях, що містить профілі синтаксису Emmet та/або файли фрагментів.",
			"emmetIncludeLanguages": "Включити скорочення Emmet у мовах, які не підтримуються за замовчуванням. Додайте сюди відповідність між мовою та іншою мовою, яку підтримує Emmet.\r\nНаприклад: {\"vue-html\": \"html\", \"javascript\": \"javascriptreact\"}",
			"emmetOptimizeStylesheetParsing": "Якщо цей параметр має значення false, аналізується весь файл, щоб перевірити, чи можна розгорнути скорочення Emmet у поточній позиції. Якщо цей параметр має значення true, в файлах CSS/SCSS/Less аналізується лише вміст поруч з поточною позицією.",
			"emmetPreferences": "Налаштування, які використовуються для зміни поведінки деяких дій та відповідників Emmet.",
			"emmetPreferencesAllowCompactBoolean": "Якщо цей параметр має значення true, формується компактний запис логічних атрибутів.",
			"emmetPreferencesBemElementSeparator": "Роздільник елемента для класів, що використовується з фільтром BEM.",
			"emmetPreferencesBemModifierSeparator": "Роздільник модифікатора для класів, що використовується з фільтром BEM.",
			"emmetPreferencesCssAfter": "Символ, який буде розміщено в кінці властивості CSS при розгортанні скорочень CSS.",
			"emmetPreferencesCssBetween": "Символ, який буде розміщено між властивістю CSS та значенням при розгортанні скорочень CSS.",
			"emmetPreferencesCssColorShort": "Якщо цей параметр має значення \"true\", то значення кольорів, такі як \"#f\", будуть розширені до \"#fff\" замість \"#ffffff\".",
			"emmetPreferencesCssFuzzySearchMinScore": "Мінімальна кількість балів для нечіткого відповідання скорочення (від 0 до 1). При вказанні нижчих значень можливе збільшення кількості помилкових спрацювань, при вказанні вищих значень - зменшення кількості можливих відповідань.",
			"emmetPreferencesCssMozProperties": "Розділений комами список властивостей CSS, які отримують префікс розробника \"moz\" при використанні в скороченнях Emmet, що починаються з \"-\". Щоб префікс \"moz\" ніколи не підставлявся, встановіть для цього параметра порожнє значення. ",
			"emmetPreferencesCssMsProperties": "Розділений комами список властивостей CSS, які отримують префікс розробника \"ms\" при використанні в скороченнях Emmet, що починаються з \"-\". Щоб префікс \"ms\" ніколи не підставлявся, встановіть для цього параметра порожнє значення. ",
			"emmetPreferencesCssOProperties": "Розділений комами список властивостей CSS, які отримують префікс розробника \"o\" при використанні в скороченнях Emmet, що починаються з \"-\". Щоб префікс \"o\" ніколи не підставлявся, встановіть для цього параметра порожнє значення. ",
			"emmetPreferencesCssWebkitProperties": "Розділений комами список властивостей CSS, які отримують префікс розробника \"webkit\" при використанні в скороченнях Emmet, що починаються з \"-\". Щоб префікс \"webkit\" ніколи не підставлявся, встановіть для цього параметра порожнє значення.",
			"emmetPreferencesFilterCommentAfter": "Визначення коментаря, який має бути розміщений після відповідного елемента при застосуванні фільтра коментаря. ",
			"emmetPreferencesFilterCommentBefore": "Визначення коментаря, який має бути розміщений перед відповідним елементом при застосуванні фільтра коментаря.",
			"emmetPreferencesFilterCommentTrigger": "Розділений комами список імен атрибутів, які повинні бути присутніми в скороченні для застосування фільтра коментаря.",
			"emmetPreferencesFloatUnit": "Одиниця вимірювання за замовчуванням для значень з плаваючою комою.",
			"emmetPreferencesFormatForceIndentTags": "Масив імен тегів, для яких завжди слід використовувати внутрішні відступи.",
			"emmetPreferencesFormatNoIndentTags": "Масив імен тегів, для яких ніколи не слід використовувати внутрішні відступи.",
			"emmetPreferencesIntUnit": "Одиниця вимірювання за замовчуванням для цілих значень.",
			"emmetPreferencesOutputInlineBreak": "Кількість однорівневих вбудованих елементів, необхідних для розміщення розривів рядків між цими елементами. Якщо задано значення 0, вбудовані елементи завжди розгортатимуться на один рядок.",
			"emmetPreferencesOutputReverseAttributes": "Якщо цей параметр має значення \"true\", то при розгортанні фрагментів коду напрямок злиття атрибутів змінюється на зворотний.",
			"emmetPreferencesOutputSelfClosingStyle": "Стиль самозакриваючихся тегів: HTML (\"<br>\"), XML (\"<br/>\") або XHTML (\"<br />\").",
			"emmetPreferencesSassAfter": "Символ, який буде розміщено в кінці властивості CSS при розгортанні скорочень CSS в файлах Sass.",
			"emmetPreferencesSassBetween": "Символ, який буде розміщено між властивістю CSS та значенням при розгортанні скорочень CSS в файлах Sass.",
			"emmetPreferencesStylusAfter": "Символ, який буде розміщено в кінці властивості CSS при розгортанні скорочень CSS в файлах Stylus.",
			"emmetPreferencesStylusBetween": "Символ, який буде розміщено між властивістю CSS та значенням при розгортанні скорочень CSS в файлах Stylus.",
			"emmetShowAbbreviationSuggestions": "Відображає можливі скорочення Emmet у вигляді пропозицій. Не застосовується в таблицях стилів або якщо параметр emmet.showExpandedAbbreviation має значення \"never\".",
			"emmetShowExpandedAbbreviation": "Показує розгорнуті скорочення Emmet у вигляді пропозицій.\r\nПараметр inMarkupAndStylesheetFilesOnly застосовується до html, haml, jade, slim, xml, xsl, css, scss, sass, less та stylus.\r\nПараметр always застосовується до всіх частин файлу, незалежно від розмітки або CSS.",
			"emmetShowSuggestionsAsSnippets": "Якщо цей параметр має значення true, пропозиції Emmet будуть відображатися у вигляді фрагментів, які можна впорядкувати за допомогою параметра \"#editor.snippetSuggestions#\".",
			"emmetSyntaxProfiles": "Встановіть профіль для вказаного синтаксису або використовуйте власний профіль з визначеними правилами.",
			"emmetTriggerExpansionOnTab": "Якщо цей параметр увімкнено, скорочення Emmet розгортатимуться при натисканні клавіші TAB, навіть якщо завершення не відображаються. Якщо цей параметр вимкнено, то можна приймати відображені завершення, натискаючи клавішу TAB.",
			"emmetUseInlineCompletions": "Якщо значення дорівнює \"true\", Emmet буде використовувати вбудовані завершення для пропозицій розширень. Щоб постачальник елементів завершення, відмінних від вбудованого, відображався так часто, як цей параметр має значення \"true\", увімкніть \"#editor.quickSuggestions#\" в \"inline\" або \"off\" для елемента \"other\".",
			"emmetVariables": "Змінні, які будуть використовуватися в фрагментах Emmet."
		}
	}
}