{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"description": "Obsługa wtyczki Emmet dla programu VS Code",
			"command.wrapWithAbbreviation": "Zawijaj przy użyciu skrótu",
			"command.wrapIndividualLinesWithAbbreviation": "Zawijaj pojedyncze wiersze przy użyciu skrótu",
			"command.removeTag": "Usuń tag",
			"command.updateTag": "Zaktualizuj tag",
			"command.matchTag": "Przejdź do pasującej pary",
			"command.balanceIn": "Równoważ (do wewnątrz)",
			"command.balanceOut": "Równoważ (na zewnątrz)",
			"command.prevEditPoint": "Przejdź do poprzedniego punktu edycji",
			"command.nextEditPoint": "Przejdź do następnego punktu edycji",
			"command.mergeLines": "Scal wiersze",
			"command.selectPrevItem": "Wybierz poprzedni element",
			"command.selectNextItem": "Wybierz następny element",
			"command.splitJoinTag": "Podziel/Połącz tag",
			"command.toggleComment": "Przełącz komentarz",
			"command.evaluateMathExpression": "Oblicz wyrażenie matematyczne",
			"command.updateImageSize": "Zaktualizuj rozmiar obrazu",
			"command.reflectCSSValue": "Odzwierciedlaj wartość CSS",
			"command.incrementNumberByOne": "Zwiększ o 1",
			"command.decrementNumberByOne": "Zmniejsz o 1",
			"command.incrementNumberByOneTenth": "Zwiększ o 0,1",
			"command.decrementNumberByOneTenth": "Zmniejsz o 0,1",
			"command.incrementNumberByTen": "Zwiększ o 10",
			"command.decrementNumberByTen": "Zmniejsz o 10",
			"emmetSyntaxProfiles": "Zdefiniuj profil dla określonej składni lub użyj własnego profilu z określonymi regułami.",
			"emmetExclude": "Tablica języków, w których skróty wtyczki Emmet nie powinny być rozwijane.",
			"emmetExtensionsPath": "Ścieżka do folderu zawierającego wstawki i profile wtyczki Emmet.",
			"emmetShowExpandedAbbreviation": "Pokazuje rozwinięte skróty wtyczki Emmet jako sugestie.\r\nOpcja „inMarkupAndStylesheetFilesOnly” ma zastosowanie do plików html, haml, jade, slim, xml, xsl, css, scss, sass, less i stylus.\r\nOpcja „always” ma zastosowanie do wszystkich części pliku, niezależnie od znaczników / kodu css.",
			"emmetShowAbbreviationSuggestions": "Pokazuje możliwe skróty wtyczki Emmet jako sugestie. Nie dotyczy arkuszy stylów lub gdy właściwość emmet.showExpandedAbbreviation ma wartość „never”.",
			"emmetIncludeLanguages": "Włącz skróty wtyczki Emmet w językach, które nie są domyślnie obsługiwane. Dodaj w tym miejscu mapowanie między danym językiem a językiem obsługiwanym przez wtyczkę Emmet.\r\n Na przykład: „{\"vue-html\": \"html\", \"javascript\": \"javascriptreact\"}”",
			"emmetVariables": "Zmienne, które mają być używane we wstawkach wtyczki Emmet",
			"emmetTriggerExpansionOnTab": "Po włączeniu skróty wtyczki Emmet są rozwijane, gdy zostanie naciśnięty klawisz TAB.",
			"emmetPreferences": "Preferencje używane do modyfikowania zachowania niektórych akcji i programów do rozpoznawania we wtyczce Emmet.",
			"emmetPreferencesIntUnit": "Jednostka domyślna dla wartości całkowitych",
			"emmetPreferencesFloatUnit": "Domyślna jednostka dla wartości zmiennoprzecinkowych",
			"emmetPreferencesCssAfter": "Symbol do umieszczenia na końcu właściwości CSS podczas rozwijania skrótów CSS",
			"emmetPreferencesSassAfter": "Symbol do umieszczenia na końcu właściwości CSS podczas rozwijania skrótów CSS w plikach Sass",
			"emmetPreferencesStylusAfter": "Symbol do umieszczenia na końcu właściwości CSS podczas rozwijania skrótów CSS w plikach Stylus",
			"emmetPreferencesCssBetween": "Symbol do umieszczenia między właściwością CSS a wartością podczas rozwijania skrótów CSS",
			"emmetPreferencesSassBetween": "Symbol do umieszczenia między właściwością CSS a wartością podczas rozwijania skrótów CSS w plikach Sass",
			"emmetPreferencesStylusBetween": "Symbol do umieszczenia między właściwością CSS a wartością podczas rozwijania skrótów CSS w plikach Stylus",
			"emmetShowSuggestionsAsSnippets": "W przypadku wartości „true” sugestie wtyczki Emmet będą wyświetlane jako wstawki, co umożliwi ich porządkowanie zgodnie z ustawieniem „#editor.snippetSuggestions#”.",
			"emmetPreferencesBemElementSeparator": "Separator elementów używany w klasach w przypadku używania filtru BEM",
			"emmetPreferencesBemModifierSeparator": "Separator modyfikatorów używany w klasach w przypadku używania filtru BEM",
			"emmetPreferencesFilterCommentBefore": "Definicja komentarza, która powinna zostać umieszczona przed dopasowanym elementem po zastosowaniu filtru komentarzy.",
			"emmetPreferencesFilterCommentAfter": "Definicja komentarza, która powinna zostać umieszczona po dopasowanym elemencie po zastosowaniu filtru komentarzy.",
			"emmetPreferencesFilterCommentTrigger": "Rozdzielana przecinkami lista nazw atrybutów, które powinny znajdować się w skrócie dla filtru komentarzy, który ma zostać zastosowany",
			"emmetPreferencesFormatNoIndentTags": "Tablica nazw tagów, które nie powinny otrzymywać wcięć wewnętrznych",
			"emmetPreferencesFormatForceIndentTags": "Tablica nazw tagów, które powinny zawsze otrzymywać wcięcie wewnętrzne",
			"emmetPreferencesAllowCompactBoolean": "W przypadku wartości „true” generowana jest kompaktowa notacja atrybutów logicznych",
			"emmetPreferencesCssWebkitProperties": "Rozdzielone przecinkami właściwości CSS, które otrzymują prefiks dostawcy „webkit”, gdy są używane w skrócie wtyczki Emmet zaczynającym się od znaku „-”. Ustaw pusty ciąg, aby zawsze unikać prefiksu „webkit”.",
			"emmetPreferencesCssMozProperties": "Rozdzielone przecinkami właściwości CSS, które otrzymują prefiks dostawcy „moz”, gdy są używane w skrócie wtyczki Emmet zaczynającym się od znaku „-”. Ustaw pusty ciąg, aby zawsze unikać prefiksu „moz”.",
			"emmetPreferencesCssOProperties": "Rozdzielone przecinkami właściwości CSS, które otrzymują prefiks dostawcy „o”, gdy są używane w skrócie wtyczki Emmet zaczynającym się od znaku „-”. Ustaw pusty ciąg, aby zawsze unikać prefiksu „o”.",
			"emmetPreferencesCssMsProperties": "Rozdzielone przecinkami właściwości CSS, które otrzymują prefiks dostawcy „ms”, gdy są używane w skrócie wtyczki Emmet zaczynającym się od znaku „-”. Ustaw pusty ciąg, aby zawsze unikać prefiksu „ms”.",
			"emmetPreferencesCssFuzzySearchMinScore": "Minimalny wynik (od 0 do 1), jaki powinien osiągnąć częściowo dopasowany skrót. Niższe wartości mogą dawać wiele dopasowań fałszywie pozytywnych, a wyższe wartości mogą zmniejszyć liczbę możliwych dopasowań.",
			"emmetOptimizeStylesheetParsing": "Jeśli ustawiono wartość „false”, analizowany jest cały plik w celu określenia, czy bieżąca pozycja jest odpowiednia do rozwijania skrótów wtyczki Emmet. Jeśli ustawiono wartość „true”, analizowana jest tylko zawartość znajdującą się w bieżącym położeniu w plikach CSS/SCSS/LESS."
		}
	}
}