{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"A reload is required for the fetch setting change to take effect.": "Aby zmiana ustawienia pobierania została zastosowana, wymagane jest ponowne załadowanie.",
			"Apple": "Apple",
			"Continue to GitHub": "Przejdź do usługi GitHub",
			"Continue to GitHub to create a Personal Access Token (PAT)": "Przejdź do usługi GitHub, aby utworzyć osobisty token dostępu",
			"Copy & Continue to {0}": "Kopiuj i kontynuuj do {0}",
			"GitHub": "GitHub",
			"GitHub Authentication - Reload required": "Uwierzytelnianie w usłudze GitHub — wymagane jest ponowne załadowanie",
			"GitHub Enterprise Server URI is not a valid URI: {0}": "Identyfikator URI serwera GitHub Enterprise Server nie jest prawidłowym identyfikatorem URI: {0}",
			"Google": "Google",
			"Having trouble logging in? Would you like to try a different way? ({0})": "Masz problemy z zalogowaniem? Czy chcesz wypróbować inną metodę? ({0})",
			"No": "Nie",
			"Open [{0}]({0}) in a new tab and paste your one-time code: {1}/The [{0}]({0}) will be a url and the {1} will be a code, e.g. 123-456{Locked=\"[{0}]({0})\"}": "Otwórz [{0}]({0}) na nowej karcie i wklej jednorazowy kod: {1}",
			"Reload Window": "Ponownie załaduj okno",
			"Sign in failed: {0}": "Logowanie nie powiodło się: {0}",
			"Sign out failed: {0}": "Wylogowanie nie powiodło się: {0}",
			"Signing in to {0}.../The {0} will be a url, e.g. github.com": "Trwa logowanie do {0}...",
			"To finish authenticating, navigate to GitHub and paste in the above one-time code.": "Aby zakończyć uwierzytelnianie, przejdź do usługi GitHub i wklej powyższy, jednorazowy kod.",
			"To finish authenticating, navigate to GitHub to create a PAT then paste the PAT into the input box.": "Aby zakończyć uwierzytelnianie, przejdź do usługi GitHub, aby utworzyć osobisty token dostępu, a następnie wklej go w polu wejściowym.",
			"Yes": "Tak",
			"You have not yet finished authorizing this extension to use GitHub. Would you like to try a different way? ({0})": "Nie zakończono jeszcze autoryzowania tego rozszerzenia do korzystania z usługi GitHub. Czy chcesz wypróbować inną metodę? ({0})",
			"Your Code: {0}/The {0} will be a code, e.g. 123-456": "Twój kod: {0}",
			"device code": "kod urządzenia",
			"local server": "serwer lokalny",
			"personal access token": "osobisty token dostępu",
			"url handler": "Procedura obsługi adresów URL"
		},
		"package": {
			"config.github-authentication.preferDeviceCodeFlow.description": "W przypadku wartości true określ priorytet przepływu kodu urządzenia na potrzeby uwierzytelniania zamiast innych dostępnych przepływów. Jest to przydatne w środowiskach takich jak WSL, w których przepływy programu obsługi serwera lokalnego lub adresu URL mogą nie działać zgodnie z oczekiwaniami.",
			"config.github-authentication.useElectronFetch.description": "W przypadku wartości true używa wbudowanej funkcji pobierania Electron na potrzeby żądań HTTP. W przypadku wartości false używa funkcji pobierania globalnego Node.js. To ustawienie ma zastosowanie tylko w przypadku uruchamiania w środowisku Electron. **Uwaga:** aby to ustawienie zostało zastosowane, wymagane jest ponowne uruchomienie.",
			"config.github-enterprise.title": "Uwierzytelnianie serwera GHE.com i GitHub Enterprise",
			"config.github-enterprise.uri.description": "Identyfikator URI wystąpienia serwera GHE.com lub GitHub Enterprise Server.\r\n\r\nPrzykłady:\r\n* GHE.com: 'https://octocat.ghe.com`\r\n* serwer GitHub Enterprise: 'https://github.octocat.com`\r\n\r\n> **Uwaga:** Ta wartość _nie_ powinna być ustawiona na identyfikator URI GitHub.com. Jeśli Twoje konto istnieje na GitHub.com lub jest GitHub Enterprise zarządzanym użytkownikiem, nie potrzebujesz dodatkowej konfiguracji i możesz po prostu zalogować się do usługi GitHub.",
			"description": "Dostawca uwierzytelniania usługi GitHub",
			"displayName": "Uwierzytelnianie usługi GitHub"
		}
	}
}