{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "Adresy URL danych nie są prawidłowym źródłem obrazu.",
			"Embedded SVGs are not a valid image source.": "Osadzone elementy SVG nie jest prawidłowym źródłem obrazu.",
			"Error parsing the when-clause:": "Błąd podczas analizowania klauzuli „when”:",
			"Images must use the HTTPS protocol.": "Obrazy muszą używać protokołu HTTPS.",
			"Language specific editor settings": "Ustawienia edytora specyficzne dla języka",
			"Override editor settings for language": "Zastąp ustawienia edytora dla języka",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Względne adresy URL wskaźników wymagają określenia repozytorium z protokołem HTTPS w tym pliku package.json.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Względne adresy URL obrazów wymagają określenia repozytorium z protokołem HTTPS w tym pliku package.json.",
			"Remove activation event": "Usuń zdarzenie aktywacji",
			"SVGs are not a valid image source.": "Elementy SVG nie są prawidłowym źródłem obrazu.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "To zdarzenie aktywacji można usunąć, ponieważ program VS Code generuje je automatycznie z deklaracji udziału package.json.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "To zdarzenie aktywacji można usunąć dla rozszerzeń przeznaczonych dla aparatu w wersji ^1.75, ponieważ program VS Code wygeneruje je automatycznie z deklaracji udziału pliku package.json.",
			"This activation event cannot be explicitly listed by your extension.": "To zdarzenie aktywacji nie może być jawnie wymienione przez rozszerzenie.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Nie można użyć tej propozycji, ponieważ dla tego rozszerzenia produkt definiuje stały zestaw propozycji interfejsu API. Możesz przetestować rozszerzenie, ale przed opublikowaniem musisz skontaktować się z zespołem VS Code.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "Użycie aktywacji „*” jest zwykle złym pomysłem, ponieważ wpływa na wydajność."
		},
		"package": {
			"description": "Zapewnia funkcje lintingu dla tworzenia rozszerzeń.",
			"displayName": "Tworzenie rozszerzeń"
		}
	}
}