{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Cannot validate since a PHP installation could not be found. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "Nie można sprawdzić poprawności, ponieważ nie można odnaleźć instalacji PHP. Użyj ustawienia \"php.validate.executablePath\" do skonfigurowania pliku wykonywalnego PHP.",
			"Cannot validate since no PHP executable is set. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "Nie można zweryfikować, ponieważ nie jest skonfigurowany żaden plik wykonywalny PHP. Skonfiguruj plik wykonywalny PHP przy użyciu ustawienia „php.validate.executablePath”.",
			"Cannot validate since {0} is not a valid php executable. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "Nie można zweryfikować, ponieważ {0} nie jest prawidłowym plikiem wykonywalnym php. Skonfiguruj plik wykonywalny PHP przy użyciu ustawienia „php.validate.executablePath”.",
			"Failed to run php using path: {0}. Reason is unknown.": "Nie udało się uruchomić kodu PHP przy użyciu ścieżki: {0}. Przyczyna jest nieznana.",
			"Open Settings": "Otwórz ustawienia"
		},
		"package": {
			"command.untrustValidationExecutable": "Nie zezwalaj na weryfikację języka PHP pliku wykonywalnego (zdefiniowany jako ustawienie obszaru roboczego)",
			"commands.categroy.php": "PHP",
			"configuration.suggest.basic": "Określa, czy są włączone wbudowane sugestie języka PHP. Pomoc techniczna sugeruje wartości globalne i zmienne języka PHP.",
			"configuration.title": "PHP",
			"configuration.validate.enable": "Włącz/wyłącz wbudowaną weryfikację języka PHP.",
			"configuration.validate.executablePath": "Wskazuje plik wykonywalny PHP.",
			"configuration.validate.run": "Określa, czy narzędzie linter jest uruchamiane przy zapisywaniu lub przy pisaniu.",
			"description": "Udostępnia zaawansowaną obsługę języka dla plików PHP.",
			"displayName": "Funkcje języka PHP",
			"workspaceTrust": "Rozszerzenie wymaga zaufania do obszaru roboczego, gdy ustawienie \"php.validate.executablePath\" spowoduje załadowanie wersji programu PHP w obszarze roboczym."
		}
	}
}