{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"add.browser.breakpoint": "Añadir punto de interrupción del navegador",
			"attach.node.process": "Adjuntar al proceso de nodo (versión preliminar)",
			"chrome.address.description": "Dirección TCP/IP del puerto de depuración",
			"chrome.attach.description": "Adjuntar a una instancia de Chrome ya en modo de depuración",
			"chrome.attach.label": "Chrome: Adjuntar",
			"chrome.baseUrl.description": "Dirección URL base para resolver rutas de acceso baseUrl. baseURL se recorta al asignar direcciones URL a los archivos del disco. El valor predeterminado es el dominio de la dirección URL de inicio.",
			"chrome.cwd.description": "Directorio de trabajo opcional para el ejecutable ",
			"chrome.disableNetworkCache.description": "Controla si se omite la caché de red para cada petición",
			"chrome.env.description": "Diccionario opcional de pares clave/valor de entorno para el explorador.",
			"chrome.file.description": "Un archivo html local para abrirlo en el navegador",
			"chrome.label": "Chrome (vista previa)",
			"chrome.launch.description": "Inicie Chrome para depurar una URL",
			"chrome.launch.label": "Chrome: Inicio",
			"chrome.pathMapping.description": "Una asignación de URL/rutas de acceso a carpetas locales, para resolver scripts en Chrome en scripts en disco.",
			"chrome.port.description": "Puerto que se utilizará para la depuración remota de Chrome.",
			"chrome.runtimeArgs.description": "Argumentos opcionales pasados al ejecutable del entorno de ejecución.",
			"chrome.runtimeExecutable.description": "\"canary\", \"stable\", \"custom\" o ruta al ejecutable del explorador. Si se elige \"custom\", puede ser un encapsulador ajustable, una compilación ajustable o una variable de entorno CHROME_PATH.",
			"chrome.server.description": "Configura un servidor web para que se inicie. Toma la misma configuración que la tarea de lanzamiento \"node\".",
			"chrome.showAsyncStacks.description": "Muestra las llamadas asincrónicas que condujeron a la pila actual.",
			"chrome.skipFiles.description": "Una matriz de nombres de archivo o carpeta, o patrones de ruta, que se deben omitir en la depuración.",
			"chrome.smartStep.description": "Pase automáticamente por las líneas sin asignar en archivos de mapas de origen. Por ejemplo, código que TypeScript produce automáticamente al compilar sync/await u otras características.",
			"chrome.sourceMapPathOverrides.description": "Un conjunto de mapeos para reescribir las localizaciones de los ficheros fuente con lo que los mapas fuente indican, a sus ubicaciones en disco. Ver README para más detalles ",
			"chrome.sourceMaps.description": "Se usan los mapas de origen de JavaScript (si existen).",
			"chrome.timeout.description": "Reintentar durante este número de milisegundos la conexión a Chrome. El valor predeterminado es 10000 ms.",
			"chrome.url.description": "Buscará una pestaña con esta URL exacta y la adjuntará, si se encuentra",
			"chrome.urlFilter.description": "Buscará una página con esta URL y la adjuntará, si la encuentra. Puede contener * como comodín.",
			"chrome.userDataDir.description": "De forma predeterminada, Chrome se inicia con un perfil de usuario separado en una carpeta temporal. Use esta opción para invalidarla. Establézcala en false para iniciar con su perfil de usuario predeterminado.",
			"chrome.webRoot.description": "Esto especifica la ruta de acceso absoluta del área de trabajo a la raíz del servidor Web. Utilizado para resolver rutas de acceso como `/app.js` a archivos en disco. Abreviatura de asignación de ruta de acceso para \"/\"",
			"configuration.npmScriptLensLocation": "Lugar en que se debe mostrar una lente de código \"Ejecutar\" y \"Depurar\" en los scripts npm. Puede estar en todos, en scripts, sobre la sección del script o bien no mostrarse nunca.",
			"configuration.terminalOptions": "Opciones de inicio predeterminadas para el terminal de depuración de JavaScript y los scripts npm.",
			"configuration.usePreview": "Utilice el nuevo depurador de JavaScript en versión preliminar para Node.js y Chrome.",
			"configuration.warnOnLongPrediction": "Si se debe mostrar una solicitud de carga si la predicción del punto de interrupción tarda un tiempo.",
			"debug.npm.edit": "Editar package.json",
			"debug.npm.noScripts": "No se han encontrado scripts npm en su package.json",
			"debug.npm.noWorkspaceFolder": "Debe abrir una carpeta de área de trabajo para depurar scripts npm.",
			"debug.npm.parseError": "No se pudo leer {0}: {1}",
			"debug.npm.script": "Depurar script NPM",
			"debug.terminal.label": "Crear terminal de depuración de JavaScript",
			"debug.terminal.program.description": "Comando para ejecutar en el terminal iniciado. Si no se proporciona, el terminal se abrirá sin iniciar un programa.",
			"debug.terminal.snippet.label": "Ejecute \"npm start\" en un terminal de depuración",
			"edge.useWebView.description": "(Solo Edge [Chromium]) Cuando es \"true\", el depurador tratará el ejecutable en tiempo de ejecución como una aplicación host que contiene un elemento WebView que le permite depurar el contenido del script WebView. Cuando se establece en \"advanced\", el depurador esperará para conectarse a un elemento WebView que coincida con el urlFilter.",
			"errors.timeout": "{0}: tiempo de espera después de {1} ms",
			"extension.description": "Extensión para depurar programas Node.js y Chrome.",
			"extensionHost.label": "Desarrollo de extensión de VS Code (versión preliminar)",
			"extensionHost.launch.config.name": "Extensión de inicio",
			"extensionHost.launch.env.description": "Variables de entorno pasadas al host de extensiones.",
			"extensionHost.launch.runtimeExecutable.description": "Ruta de acceso absoluta a VS Code.",
			"extensionHost.launch.stopOnEntry.description": "El host de extensiones se detiene automáticamente tras el inicio.",
			"extensionHost.snippet.launch.description": "Iniciar una extensión de VS Code en modo de depuración",
			"extensionHost.snippet.launch.label": "Desarrollo de extensiones de VS Code",
			"longPredictionWarning.disable": "No mostrar de nuevo",
			"longPredictionWarning.message": "Los puntos de interrupción están tardando en configurarse. Puede acelerarlo actualizando \"outFiles\" en su archivo launch.json.",
			"longPredictionWarning.noFolder": "No hay ninguna carpeta del área de trabajo abierta.",
			"longPredictionWarning.open": "Abrir launch.json",
			"node.address.description": "Dirección TCP/IP del proceso que se va a depurar. El valor predeterminado es \"localhost\".",
			"node.attach.attachExistingChildren.description": "Si se intenta adjuntar a procesos secundarios ya generados.",
			"node.attach.attachSpawnedProcesses.description": "Si se deben establecer variables de entorno en el proceso adjunto para realizar un seguimiento de los elementos secundarios generados.",
			"node.attach.config.name": "Asociar",
			"node.attach.processId.description": "Id. del proceso al que debe asociarse.",
			"node.attach.restart.description": "Intente volver a conectarse al programa si se pierde la conexión.",
			"node.console.title": "Consola de depuración de nodos",
			"node.disableOptimisticBPs.description": "No establecer puntos de interrupción en ningún archivo hasta que se haya cargado un sourcemap para ese archivo.",
			"node.label": "Node.js (versión preliminar)",
			"node.launch.args.description": "Argumentos de línea de comandos pasados al programa.",
			"node.launch.autoAttachChildProcesses.description": "Asociar automáticamente el depurador a los procesos secundarios nuevos.",
			"node.launch.config.name": "Lanzamiento",
			"node.launch.console.description": "Lugar donde debe iniciarse el destino de depuración.",
			"node.launch.console.externalTerminal.description": "Terminal externo que puede configurarse desde Configuración del usuario.",
			"node.launch.console.integratedTerminal.description": "Terminal integrado de VS Code",
			"node.launch.console.internalConsole.description": "Consola de depuración de VS Code (que no admite la lectura de entradas de un programa)",
			"node.launch.cwd.description": "Ruta de acceso absoluta al directorio de trabajo del programa que se está depurando.",
			"node.launch.env.description": "Variables de entorno que se pasan al programa. El valor \"null\" quita la variable del entorno. ",
			"node.launch.envFile.description": "Ruta de acceso absoluta a un archivo que contiene definiciones de variables de entorno.",
			"node.launch.logging": "Configuración de registro",
			"node.launch.logging.cdp": "Ruta al archivo de registro para los mensajes del protocolo DevTools de Chrome",
			"node.launch.logging.dap": "Ruta de acceso al archivo de registro para los mensajes del Protocolo de adaptador de depuración",
			"node.launch.outputCapture.description": "Capturar los mensajes de salida desde el API de depuración o desde los canales stdout/stderr.",
			"node.launch.program.description": "Ruta de acceso absoluta al programa. El valor generado se infiere de package.json y de los archivos abiertos. Edite este atributo.",
			"node.launch.restart.description": "Pruebe a reiniciar el programa si se cierra un código de salida distinto de cero.",
			"node.launch.runtimeArgs.description": "Argumentos opcionales pasados al ejecutable del entorno de ejecución.",
			"node.launch.runtimeExecutable.description": "Entorno de ejecución que debe usarse. Puede ser una ruta de acceso absoluta o el nombre de un entorno de ejecución disponible en PATH. Si se omite, se utiliza \"node\".",
			"node.launch.runtimeVersion.description": "Versión del entorno de ejecución de \"Node\" que debe usarse. Requiere \"NVM\".",
			"node.launch.useWSL.deprecation": "\"useWSL\" está en desuso y se eliminará el soporte correspondiente. Utilice la extensión \"Remote - WSL\" en su lugar.",
			"node.launch.useWSL.description": "Utilice el subsistema de Windows para Linux.",
			"node.localRoot.description": "Ruta de acceso al directorio local que contiene el programa.",
			"node.pauseForSourceMap.description": "Si desea esperar a que se carguen los mapas de origen para cada script entrante. Esto tiene una sobrecarga de rendimiento y puede deshabilitarse de forma segura cuando se queda sin disco, siempre y cuando \"rootPath\" no esté deshabilitado.",
			"node.port.description": "Puerto de depuración al que se va a conectar. El valor predeterminado es 5858.",
			"node.processattach.config.name": "Asociar al proceso",
			"node.remoteRoot.description": "Ruta de acceso absoluta al directorio remoto que contiene el programa.",
			"node.resolveSourceMapLocations.description": "Lista de patrones de minimatch para ubicaciones (carpetas y direcciones URL) en las que se pueden utilizar mapas de origen para resolver archivos locales. Se puede utilizar para evitar la interrupción incorrecta en el código asignado de origen externo. Los patrones se pueden prefijar con \"!\" para excluirlos. Se puede establecer en una matriz vacía o nula para evitar restricciones.",
			"node.showAsyncStacks.description": "Muestra las llamadas asincrónicas que condujeron a la pila de llamadas actual.",
			"node.snippet.attach.description": "Adjuntar a un nodo en ejecución",
			"node.snippet.attach.label": "Node.js: Attach",
			"node.snippet.attachProcess.description": "Abrir el selector de procesos para elegir el proceso de Node para conectarse",
			"node.snippet.attachProcess.label": "Node.js: adjuntar a proceso",
			"node.snippet.electron.description": "Depurar el proceso principal de Electron",
			"node.snippet.electron.label": "Node.js: proceso principal de Electron",
			"node.snippet.gulp.description": "Depurar tarea de Gulp (asegúrese de tener Gulp instalado localmente en el proyecto)",
			"node.snippet.gulp.label": "Node.js: tarea de Gulp",
			"node.snippet.launch.description": "Iniciar un programa de nodo en modo de depuración",
			"node.snippet.launch.label": "Node.js: iniciar programa",
			"node.snippet.mocha.description": "Depurar pruebas de Mocha",
			"node.snippet.mocha.label": "Node.js: pruebas de Mocha",
			"node.snippet.nodemon.description": "Use nodemon para reiniciar una sesión de depuración en los cambios de origen",
			"node.snippet.nodemon.label": "Node.js: configuración de Nodemon",
			"node.snippet.npm.description": "Inicia un programa de Node con un script \"debug\" de npm.",
			"node.snippet.npm.label": "Node.js: iniciar mediante NPM",
			"node.snippet.remoteattach.description": "Adjuntar al puerto de depuración de un programa de nodo remoto",
			"node.snippet.remoteattach.label": "Node.js: adjuntar a programa remoto",
			"node.snippet.yo.description": "Depurar generador de Yeoman (se instala ejecutando \"npm link\" en la carpeta del proyecto).",
			"node.snippet.yo.label": "Node.js: generador de Yeoman",
			"node.sourceMapPathOverrides.description": "Un conjunto de mapeos para reescribir las localizaciones de los ficheros fuente con lo que los mapas fuente indican, a sus ubicaciones en disco.",
			"node.sourceMaps.description": "Se usan los mapas de origen de JavaScript (si existen).",
			"node.stopOnEntry.description": "El programa se detiene automáticamente tras el inicio.",
			"node.timeout.description": "Vuelva a probar con este número de milisegundos para conectarse a Node.js. El valor predeterminado es 10 000 ms.",
			"open.loaded.script": "Abrir script cargado",
			"outFiles.description": "Si están habilitados los mapas de origen, estos patrones globales especifican los archivos de JavaScript generados. Si un patrón comienza con \"!\", los archivos se excluyen. Si no se especifica, se espera que el código generado esté en el mismo directorio que el origen. ",
			"pretty.print.script": "Bastante impresión para depuración",
			"remove.browser.breakpoint": "Eliminar punto de interrupción del navegador",
			"remove.browser.breakpoint.all": "Eliminar todos los puntos de interrupción del navegador",
			"skipFiles.description": "Una matriz de patrones globales para que los archivos omitan al depurar. El patrón \"<node_internals>/**\" coincide con todos los módulos internos de Node.js.",
			"smartStep.description": "Explore automáticamente el código generado que no se puede volver a asignar al código fuente original.",
			"start.with.stop.on.entry": "Iniciar depuración y detenerla tras el inicio",
			"toggle.skipping.this.file": "Alternando omitir este archivo ",
			"trace.boolean.description": "El seguimiento se puede establecer en \"true\" para escribir registros de diagnóstico en el disco.",
			"trace.console.description": "Configura si los registros también se devuelven a la consola de depuración.",
			"trace.description": "Configura qué salida de diagnóstico se produce.",
			"trace.level.description": "Configura el nivel de registros registrados.",
			"trace.logFile.description": "Configura dónde se escriben los registros de disco.",
			"trace.tags.description": "Configura qué tipos de registros se registran."
		}
	}
}