{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "Las direcciones URL de datos no son un origen de imagen válido.",
			"Embedded SVGs are not a valid image source.": "Los SGV insertados no son un origen de imagen válido.",
			"Error parsing the when-clause:": "Error al analizar la cláusula de when:",
			"Images must use the HTTPS protocol.": "Las imágenes deben utilizar el protocolo HTTPS.",
			"Language specific editor settings": "Configuración del editor específica del lenguaje",
			"Override editor settings for language": "Reemplazar configuración del editor para lenguaje",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Las direcciones URL relativas de distintivos requieren un repositorio con el protocolo HTTPS especificado en este archivo package.json.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Las direcciones URL relativas de imágenes requieren un repositorio con el protocolo HTTPS especificado en el archivo package.json.",
			"Remove activation event": "Quitar evento de activación",
			"SVGs are not a valid image source.": "Los SVG no son un origen de imagen válido.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "Este evento de activación puede eliminarse ya que VS Code los genera automáticamente a partir de sus declaraciones de contribución de package.json.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "Este evento de activación se puede quitar para las extensiones destinadas a la versión del motor ^1.75, ya que VS Code las generará automáticamente a partir de las declaraciones de contribución package.json.",
			"This activation event cannot be explicitly listed by your extension.": "La extensión no puede enumerar explícitamente este evento de activación.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Esta propuesta no se puede usar porque, para esta extensión, el producto define un conjunto fijo de propuestas de API. Puede probar la extensión, pero antes de publicarla DEBE ponerse en contacto con el equipo de VS Code.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "El uso de la activación \"*\" suele ser una mala idea, ya que afecta al rendimiento."
		},
		"package": {
			"description": "Proporciona funcionalidad de detección de errores para la creación de extensiones.",
			"displayName": "Creación de extensiones"
		}
	}
}