{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Cannot validate since a PHP installation could not be found. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "No se puede validar porque no se ha encontrado una instalación de PHP. Utilice el ajuste \"php.validate.executablePath\" para configurar el ejecutable de PHP.",
			"Cannot validate since no PHP executable is set. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "No se puede validar porque no hay ningún ejecutable PHP establecido. Use el ajuste \"php.validate.executablePath\" para configurar el ejecutable de PHP.",
			"Cannot validate since {0} is not a valid php executable. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "No se puede validar porque {0} no es un ejecutable PHP válido. Use el ajuste \"php.validate.executablePath\" para configurar el ejecutable PHP.",
			"Failed to run php using path: {0}. Reason is unknown.": "No se pudo ejecutar el archivo PHP con la ruta de acceso: {0}. Se desconoce el motivo.",
			"Open Settings": "Abrir configuración"
		},
		"package": {
			"command.untrustValidationExecutable": "No permitir el ejecutable de validación de PHP (como configuración de área de trabajo)",
			"commands.categroy.php": "PHP",
			"configuration.suggest.basic": "Controla si se habilitan las sugerencias del lenguaje PHP integradas. La asistencia sugiere variables y opciones globales de PHP.",
			"configuration.title": "PHP",
			"configuration.validate.enable": "Habilita o deshabilita la validación integrada de PHP.",
			"configuration.validate.executablePath": "Señala al ejecutable PHP.",
			"configuration.validate.run": "Indica si linter se ejecuta al guardar o al escribir.",
			"description": "Proporciona un potente soporte de lenguaje para archivos PHP.",
			"displayName": "Características del lenguaje PHP",
			"workspaceTrust": "La extensión requiere la confianza del área de trabajo cuando el ajuste \"php.validate.executablePath\" cargará una versión de PHP en el área de trabajo."
		}
	}
}