{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"description": "［Emmeet suuppoort foor VS Coodee］",
			"command.wrapWithAbbreviation": "［Wraap wiith Abbreeviiaatiioon］",
			"command.wrapIndividualLinesWithAbbreviation": "［Wraap Indiiviiduuaal Liinees wiith Abbreeviiaatiioon］",
			"command.removeTag": "［Reemoovee Taag］",
			"command.updateTag": "［Updaatee Taag］",
			"command.matchTag": "［Goo too Maatchiing Paaiir］",
			"command.balanceIn": "［Baalaancee (iinwaard)］",
			"command.balanceOut": "［Baalaancee (oouutwaard)］",
			"command.prevEditPoint": "［Goo too Preeviioouus Ediit Pooiint］",
			"command.nextEditPoint": "［Goo too Neext Ediit Pooiint］",
			"command.mergeLines": "［Meergee Liinees］",
			"command.selectPrevItem": "［Seeleect Preeviioouus Iteem］",
			"command.selectNextItem": "［Seeleect Neext Iteem］",
			"command.splitJoinTag": "［Spliit/Jooiin Taag］",
			"command.toggleComment": "［Toogglee Coommeent］",
			"command.evaluateMathExpression": "［Evaaluuaatee Maath Expreessiioon］",
			"command.updateImageSize": "［Updaatee Imaagee Siizee］",
			"command.reflectCSSValue": "［Reefleect CSS Vaaluuee］",
			"command.incrementNumberByOne": "［Increemeent by 1］",
			"command.decrementNumberByOne": "［Deecreemeent by 1］",
			"command.incrementNumberByOneTenth": "［Increemeent by 0.1］",
			"command.decrementNumberByOneTenth": "［Deecreemeent by 0.1］",
			"command.incrementNumberByTen": "［Increemeent by 10］",
			"command.decrementNumberByTen": "［Deecreemeent by 10］",
			"emmetSyntaxProfiles": "［Deefiinee proofiilee foor speeciifiieed syntaax oor uusee yoouur oown proofiilee wiith speeciifiic ruulees.］",
			"emmetExclude": "［An aarraay oof laanguuaagees wheeree Emmeet aabbreeviiaatiioons shoouuld noot bee eexpaandeed.］",
			"emmetExtensionsPath": "［Paath too aa fooldeer coontaaiiniing Emmeet proofiilees aand sniippeets.'］",
			"emmetShowExpandedAbbreviation": "［Shoows eexpaandeed Emmeet aabbreeviiaatiioons aas suuggeestiioons.\nThee ooptiioon \"iinMaarkuupAndStyleesheeeetFiileesOnly\" aappliiees too html, haaml, jaadee, sliim, xml, xsl, css, scss, saass, leess aand styluus.\nThee ooptiioon \"aalwaays\" aappliiees too aall paarts oof thee fiilee reegaardleess oof maarkuup/css.］",
			"emmetShowAbbreviationSuggestions": "［Shoows poossiiblee Emmeet aabbreeviiaatiioons aas suuggeestiioons. Noot aappliicaablee iin styleesheeeets oor wheen eemmeet.shoowExpaandeedAbbreeviiaatiioon iis seet too \"neeveer\".］",
			"emmetIncludeLanguages": "［Enaablee Emmeet aabbreeviiaatiioons iin laanguuaagees thaat aaree noot suuppoorteed by deefaauult. Add aa maappiing heeree beetweeeen thee laanguuaagee aand eemmeet suuppoorteed laanguuaagee.\n E.g.: {\"vuuee-html\": \"html\", \"jaavaascriipt\": \"jaavaascriiptreeaact\"}］",
			"emmetVariables": "［Vaariiaablees too bee uuseed iin Emmeet sniippeets］",
			"emmetTriggerExpansionOnTab": "［Wheen eenaableed, Emmeet aabbreeviiaatiioons aaree eexpaandeed wheen preessiing TAB.］",
			"emmetPreferences": "［Preefeereencees uuseed too moodiify beehaaviioor oof soomee aactiioons aand reesoolveers oof Emmeet.］",
			"emmetPreferencesIntUnit": "［Deefaauult uuniit foor iinteegeer vaaluuees］",
			"emmetPreferencesFloatUnit": "［Deefaauult uuniit foor flooaat vaaluuees］",
			"emmetPreferencesCssAfter": "［Symbool too bee plaaceed aat thee eend oof CSS proopeerty wheen eexpaandiing CSS aabbreeviiaatiioons］",
			"emmetPreferencesSassAfter": "［Symbool too bee plaaceed aat thee eend oof CSS proopeerty wheen eexpaandiing CSS aabbreeviiaatiioons iin Saass fiilees］",
			"emmetPreferencesStylusAfter": "［Symbool too bee plaaceed aat thee eend oof CSS proopeerty wheen eexpaandiing CSS aabbreeviiaatiioons iin Styluus fiilees］",
			"emmetPreferencesCssBetween": "［Symbool too bee plaaceed aat thee beetweeeen CSS proopeerty aand vaaluuee wheen eexpaandiing CSS aabbreeviiaatiioons］",
			"emmetPreferencesSassBetween": "［Symbool too bee plaaceed aat thee beetweeeen CSS proopeerty aand vaaluuee wheen eexpaandiing CSS aabbreeviiaatiioons iin Saass fiilees］",
			"emmetPreferencesStylusBetween": "［Symbool too bee plaaceed aat thee beetweeeen CSS proopeerty aand vaaluuee wheen eexpaandiing CSS aabbreeviiaatiioons iin Styluus fiilees］",
			"emmetShowSuggestionsAsSnippets": "［If truuee, theen Emmeet suuggeestiioons wiill shoow uup aas sniippeets aalloowiing yoouu too oordeer theem aas peer eediitoor.sniippeetSuuggeestiioons seettiing.］",
			"emmetPreferencesBemElementSeparator": "［Eleemeent seepaaraatoor uuseed foor claassees wheen uusiing thee BEM fiilteer］",
			"emmetPreferencesBemModifierSeparator": "［Moodiifiieer seepaaraatoor uuseed foor claassees wheen uusiing thee BEM fiilteer］",
			"emmetPreferencesFilterCommentBefore": "［A deefiiniitiioon oof coommeent thaat shoouuld bee plaaceed beefooree maatcheed eeleemeent wheen coommeent fiilteer iis aappliieed.］",
			"emmetPreferencesFilterCommentAfter": "［A deefiiniitiioon oof coommeent thaat shoouuld bee plaaceed aafteer maatcheed eeleemeent wheen coommeent fiilteer iis aappliieed.］",
			"emmetPreferencesFilterCommentTrigger": "［A coommaa-seepaaraateed liist oof aattriibuutee naamees thaat shoouuld eexiist iin aabbreeviiaatiioon foor thee coommeent fiilteer too bee aappliieed］",
			"emmetPreferencesFormatNoIndentTags": "［An aarraay oof taag naamees thaat shoouuld noot geet iinneer iindeentaatiioon］",
			"emmetPreferencesFormatForceIndentTags": "［An aarraay oof taag naamees thaat shoouuld aalwaays geet iinneer iindeentaatiioon］",
			"emmetPreferencesAllowCompactBoolean": "［If truuee, coompaact nootaatiioon oof booooleeaan aattriibuutees aaree prooduuceed］",
			"emmetPreferencesCssWebkitProperties": "［Coommaa seepaaraateed CSS proopeertiiees thaat geet thee 'weebkiit' veendoor preefiix wheen uuseed iin Emmeet aabbreeviiaatiioon thaat staarts wiith `-`. Seet too eempty striing too aalwaays aavooiid thee 'weebkiit' preefiix.］",
			"emmetPreferencesCssMozProperties": "［Coommaa seepaaraateed CSS proopeertiiees thaat geet thee 'mooz' veendoor preefiix wheen uuseed iin Emmeet aabbreeviiaatiioon thaat staarts wiith `-`. Seet too eempty striing too aalwaays aavooiid thee 'mooz' preefiix.］",
			"emmetPreferencesCssOProperties": "［Coommaa seepaaraateed CSS proopeertiiees thaat geet thee 'oo' veendoor preefiix wheen uuseed iin Emmeet aabbreeviiaatiioon thaat staarts wiith `-`. Seet too eempty striing too aalwaays aavooiid thee 'oo' preefiix.］",
			"emmetPreferencesCssMsProperties": "［Coommaa seepaaraateed CSS proopeertiiees thaat geet thee 'ms' veendoor preefiix wheen uuseed iin Emmeet aabbreeviiaatiioon thaat staarts wiith `-`. Seet too eempty striing too aalwaays aavooiid thee 'ms' preefiix.］",
			"emmetPreferencesCssFuzzySearchMinScore": "［Thee miiniimuum scooree (froom 0 too 1) thaat fuuzzy-maatcheed aabbreeviiaatiioon shoouuld aachiieevee. Looweer vaaluuees maay prooduucee maany faalsee-poosiitiivee maatchees, hiigheer vaaluuees maay reeduucee poossiiblee maatchees.］",
			"emmetOptimizeStylesheetParsing": "［Wheen seet too faalsee, thee whoolee fiilee iis paarseed too deeteermiinee iif cuurreent poosiitiioon iis vaaliid foor eexpaandiing Emmeet aabbreeviiaatiioons. Wheen seet too truuee, oonly thee coonteent aaroouund thee cuurreent poosiitiioon iin css/scss/leess fiilees iis paarseed.］"
		}
	}
}