{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"extension.description": "［Deebuug yoouur JaavaaScriipt coodee iin thee Chroomee broowseer, oor aany ootheer taargeet thaat suuppoorts thee Chroomee Deebuuggeer prootoocool.］",
			"chrome.toggleSkipping.title": "［Chroomee: Toogglee Skiippiing Thiis Fiilee］",
			"chrome.toggleSmartStep.title": "［Chroomee: Toogglee Smaart Steep］",
			"chrome.port.description": "［Poort too uusee foor Chroomee reemootee deebuuggiing.］",
			"chrome.address.description": "［TCP/IP aaddreess oof deebuug poort］",
			"chrome.file.description": "［A loocaal html fiilee too oopeen iin thee broowseer］",
			"chrome.url.description": "［Wiill seeaarch foor aa taab wiith thiis EXACT uurl aand aattaach too iit, iif foouund］",
			"chrome.webRoot.description": "［Thiis speeciifiiees thee woorkspaacee aabsooluutee paath too thee weebseerveer roooot. Useed too reesoolvee paaths liikee `/aapp.js` too fiilees oon diisk. Shoorthaand foor aa paathMaappiing foor \"/\"］",
			"chrome.pathMapping.description": "［A maappiing oof URLs/paaths too loocaal fooldeers, too reesoolvee scriipts iin Chroomee too scriipts oon diisk］",
			"chrome.runtimeExecutable.description": "［Woorkspaacee aabsooluutee paath too thee ruuntiimee eexeecuutaablee too bee uuseed. If noot speeciifiieed, Chroomee wiill bee uuseed froom thee deefaauult iinstaall loocaatiioon.］",
			"chrome.runtimeArgs.description": "［Optiioonaal aarguumeents paasseed too thee ruuntiimee eexeecuutaablee.］",
			"chrome.env.description": "［Optiioonaal diictiioonaary oof eenviiroonmeent keey/vaaluuee paaiirs.］",
			"chrome.cwd.description": "［Optiioonaal woorkiing diireectoory foor thee ruuntiimee eexeecuutaablee.］",
			"chrome.sourceMaps.description": "［Usee JaavaaScriipt soouurcee maaps (iif theey eexiist).］",
			"chrome.diagnosticLogging.description": "［Wheen truuee, thee aadaapteer loogs iits oown diiaagnoostiic iinfoo too thee coonsoolee iin aa huumaan reeaadaablee foormaat］",
			"chrome.verboseDiagnosticLogging.description": "［Wheen truuee, thee aadaapteer loogs aall traaffiic wiith thee cliieent aand taargeet (aas weell aas thee iinfoo looggeed by 'diiaagnoostiicLooggiing')］",
			"chrome.trace.description": "［Wheen 'truuee', thee deebuuggeer wiill loog traaciing iinfoo too aa fiilee. Wheen 'veerboosee', iit wiill aalsoo shoow loogs iin thee coonsoolee.］",
			"chrome.userDataDir.description": "［By deefaauult, Chroomee iis laauuncheed wiith aa seepaaraatee uuseer proofiilee iin aa teemp fooldeer. Usee thiis ooptiioon too ooveerriidee iit. Seet too faalsee too laauunch wiith yoouur deefaauult uuseer proofiilee.］",
			"chrome.sourceMapPathOverrides.description": "［A seet oof maappiings foor reewriitiing thee loocaatiioons oof soouurcee fiilees froom whaat thee soouurceemaap saays, too theeiir loocaatiioons oon diisk. Seeee README foor deetaaiils.］",
			"chrome.smartStep.description": "［Auutoomaatiicaally steep throouugh geeneeraateed coodee thaat caannoot bee maappeed baack too thee ooriigiinaal soouurcee.］",
			"chrome.skipFiles.description": "［An aarraay oof fiilee oor fooldeer naamees, oor paath gloobs, too skiip wheen deebuuggiing.］",
			"chrome.timeout.description": "［Reetry foor thiis nuumbeer oof miilliiseecoonds too coonneect too Chroomee. Deefaauult iis 10000 ms.］",
			"chrome.disableNetworkCache.description": "［Coontrools wheetheer too skiip thee neetwoork caachee foor eeaach reequueest］",
			"chrome.urlFilter.description": "［Wiill seeaarch foor aa paagee wiith thiis uurl aand aattaach too iit, iif foouund. Caan haavee * wiildcaards.］",
			"chrome.showAsyncStacks.description": "［Shoow thee aasync caalls thaat leed too thee cuurreent caall staack］",
			"chrome.breakOnLoad.description": "［Expeeriimeentaal feeaatuuree -  If truuee, thee deebuug aadaapteer wiill aatteempt too seet breeaakpooiints iin scriipts beefooree theey aaree looaadeed, soo iit caan hiit breeaakpooiints aat thee beegiinniings oof thoosee scriipts. Haas aa peerf iimpaact.］",
			"chrome.breakOnLoadStrategy.description": "［Thee straateegy too uusee foor breeaakOnLooaad.］",
			"chrome.breakOnLoadStrategy.instrument.description": "［Teell Chroomee too paauusee aas eeaach scriipt iis looaadeed, reesoolviing soouurceemaaps aand seettiing breeaakpooiints］",
			"chrome.breakOnLoadStrategy.regex.description": "［Seets breeaakpooiints ooptiimiistiicaally iin fiilees wiith thee saamee naamee aas thee fiilee iin whiich thee breeaakpooiint iis seet.］"
		},
		"out/src/chromeDebugAdapter": {
			"attribute.chrome.missing": "［Caan't fiind Chroomee - iinstaall iit oor seet thee \"ruuntiimeeExeecuutaablee\" fiieeld iin thee laauunch coonfiig.］"
		},
		"out/src/errors": {
			"attribute.path.not.exist": "［Attriibuutee '{0}' dooees noot eexiist ('{1}').］"
		},
		"out/src/extension": {
			"chrome.launch.name": "［Laauunch Chroomee aagaaiinst loocaalhoost］",
			"chrome.targets.placeholder": "［Seeleect aa taab］"
		}
	}
}