{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "Les URL de données ne sont pas une source d'images valide.",
			"Embedded SVGs are not a valid image source.": "Les SVG incorporés ne sont pas une source d'images valide.",
			"Error parsing the when-clause:": "Erreur lors de l’analyse de la clause when :",
			"Images must use the HTTPS protocol.": "Les images doivent utiliser le protocole HTTPS.",
			"Language specific editor settings": "Paramètres d'éditeur spécifiques au langage",
			"Override editor settings for language": "Remplacer les paramètres de l'éditeur pour le langage",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Les URL de badge relatives nécessitent un dépôt avec le protocole HTTPS dans package.json.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Les URL d'image relatives nécessitent un dépôt avec le protocole HTTPS dans package.json.",
			"Remove activation event": "Supprimer l'événement d'activation",
			"SVGs are not a valid image source.": "Les SVG ne sont pas une source d'images valide.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "Cet événement d’activation peut être supprimé, car VS Code les génère automatiquement à partir de vos déclarations de contribution package.json.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "Cet événement d’activation peut être supprimé pour les extensions ciblant la version du moteur ^1.75, car VS Code les génère automatiquement à partir de vos déclarations de contribution package.json.",
			"This activation event cannot be explicitly listed by your extension.": "Cet événement d’activation ne peut pas être répertorié explicitement par votre extension.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Impossible d’utiliser cette proposition, car pour cette extension, le produit définit un ensemble fixe de propositions d’API. Vous pouvez tester votre extension, mais avant de publier, vous DEVEZ contacter l’équipe VS Code.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "L’utilisation de l’activation « * » est généralement une mauvaise idée, car elle affecte les performances."
		},
		"package": {
			"description": "Fournit des fonctions de linting pour la création d’extensions.",
			"displayName": "Création d’extension"
		}
	}
}