{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"description": "Поддръжка на Emmet за VS Code",
			"command.wrapWithAbbreviation": "Обвиване със съкращение",
			"command.wrapIndividualLinesWithAbbreviation": "Обвиване на отделните редове със съкращение",
			"command.removeTag": "Премахване на елемента",
			"command.updateTag": "Обновяване на елемента",
			"command.matchTag": "Към съответстващата двойка",
			"command.balanceIn": "Балансиране (навътре)",
			"command.balanceOut": "Балансиране (навън)",
			"command.prevEditPoint": "Към предишното място на редакция",
			"command.nextEditPoint": "Към следващото място на редакция",
			"command.mergeLines": "Сливане на редовете",
			"command.selectPrevItem": "Избиране на предишния елемент",
			"command.selectNextItem": "Избиране на следващия елемент",
			"command.splitJoinTag": "Разделяне/сливане на елемента",
			"command.toggleComment": "Превключване на коментар",
			"command.evaluateMathExpression": "Изчисляване на математически израз",
			"command.updateImageSize": "Обновяване на размера на изображението",
			"command.reflectCSSValue": "Отразяване на стойността в CSS",
			"command.incrementNumberByOne": "Увеличаване с 1",
			"command.decrementNumberByOne": "Намаляване с 1",
			"command.incrementNumberByOneTenth": "Увеличаване с 0,1",
			"command.decrementNumberByOneTenth": "Намаляване с 0,1",
			"command.incrementNumberByTen": "Увеличаване с 10",
			"command.decrementNumberByTen": "Намаляване с 10",
			"emmetSyntaxProfiles": "Дефинирайте профил за посочения синтаксис, или използвайте свой собствен профил със специфични правила.",
			"emmetExclude": "Масив от езици, за които съкращенията на Emmet не трябва да се разгъват.",
			"emmetExtensionsPath": "Път до папка, съдържаща профили и отрязъци за Emmet.",
			"emmetShowExpandedAbbreviation": "Показва разгънати съкращения от Emmet като предложения.\nСтойността `\"inMarkupAndStylesheetFilesOnly\"` означава да се ползват само за html, haml, jade, slim, xml, xsl, css, scss, sass, less и stylus.\nСтойността `\"always\"` означава да се прилагане към всички части на файла, независимо дали съдържанието е код за маркиране/css.",
			"emmetShowAbbreviationSuggestions": "Показва възможните съкращения от Emmet като предложения. Това не е приложимо в стилови таблици или когато „emmet.showExpandedAbbreviation“ има стойност `\"never\"`.",
			"emmetIncludeLanguages": "Включване на съкращенията от Emmet в езици, които не се поддържат по подразбиране. Добавете връзка тук между езика и поддържания от emmet език.\n Например: `{\"vue-html\": \"html\", \"javascript\": \"javascriptreact\"}`",
			"emmetVariables": "Променливи, които да се използват във фрагментите на Emmet",
			"emmetTriggerExpansionOnTab": "Когато е включено, съкращенията на Emmet ще се разгъват при натискане на TAB.",
			"emmetPreferences": "Настройки използвани за промяна на поведението на някои действия и преобразуватели на Emmet.",
			"emmetPreferencesIntUnit": "Единица по подразбиране за целочислените стойности",
			"emmetPreferencesFloatUnit": "Единица по подразбиране за стойностите с плаваща запетая",
			"emmetPreferencesCssAfter": "Знак, който да бъде поставян в края на свойствата в CSS при разгъване на съкращенията от CSS",
			"emmetPreferencesSassAfter": "Знак, който да бъде поставян в края на свойствата в CSS при разгъване на съкращенията от CSS във файлове от тип Sass",
			"emmetPreferencesStylusAfter": "Знак, който да бъде поставян в края на свойствата в CSS при разгъване на съкращенията от CSS във файлове от тип Stylus",
			"emmetPreferencesCssBetween": "Знак, който да бъде поставян между свойството от CSS и стойността му при разгъване на съкращенията от CSS",
			"emmetPreferencesSassBetween": "Знак, който да бъде поставян между свойството от CSS и стойността му при разгъване на съкращенията от CSS във файлове от тип Sass",
			"emmetPreferencesStylusBetween": "Знак, който да бъде поставян между свойството от CSS и стойността му при разгъване на съкращенията от CSS във файлове от тип Stylus",
			"emmetShowSuggestionsAsSnippets": "Ако е `true`, предложенията на Emmet ще се показват като отрязъци, позволявайки Ви да ги подреждате според стойността на настройката `#editor.snippetSuggestions#`.",
			"emmetPreferencesBemElementSeparator": "Разделител на елементите използван за класовете при използване на филтъра „BEM“",
			"emmetPreferencesBemModifierSeparator": " Разделител на модификаторите използван за класовете при използване на филтъра „BEM“ ",
			"emmetPreferencesFilterCommentBefore": "Дефиниция на коментар, който да бъде поставян преди съответстващия елемент, когато се прилага филтър за коментари.",
			"emmetPreferencesFilterCommentAfter": "Дефиниция на коментар, който да бъде поставян след съответстващия елемент, когато се прилага филтър за коментари.",
			"emmetPreferencesFilterCommentTrigger": "Списък от имена на атрибути разделени със запетаи, които трябва да съществуват в дадено съкращение, за да може да се приложи филтър за коментари",
			"emmetPreferencesFormatNoIndentTags": "Масив от имена на елементи, които не трябва да получават вътрешен отстъп",
			"emmetPreferencesFormatForceIndentTags": "Масив от имена на елементи, които винаги трябва да получават вътрешен отстъп",
			"emmetPreferencesAllowCompactBoolean": "Ако е включено, ще се създава компактен запис на булевите атрибути",
			"emmetPreferencesCssWebkitProperties": "Разделени със запетаи свойства на CSS, пред които да бъде поставяна представка „webkit“, когато се използват в съкращения на Emmet, започващи с `-`. Ако зададете празен низ, винаги ще се избягва представката „webkit“.",
			"emmetPreferencesCssMozProperties": "Разделени със запетаи свойства на CSS, пред които да бъде поставяна представка „moz“, когато се използват в съкращения на Emmet, започващи с `-`. Ако зададете празен низ, винаги ще се избягва представката „moz“.",
			"emmetPreferencesCssOProperties": "Разделени със запетаи свойства на CSS, пред които да бъде поставяна представка „o“, когато се използват в съкращения на Emmet, започващи с `-`. Ако зададете празен низ, винаги ще се избягва представката „o“.",
			"emmetPreferencesCssMsProperties": "Разделени със запетаи свойства на CSS, пред които да бъде поставяна представка „ms“, когато се използват в съкращения на Emmet, започващи с `-`. Ако зададете празен низ, винаги ще се избягва представката „ms“.",
			"emmetPreferencesCssFuzzySearchMinScore": "Минималната оценка (между 0 и 1), която трябва да постигне едно съкращение при размито съвпадение. По-ниските стойности може да произведат много грешни съвпадения, а по-високите може да ограничат възможните съвпадения.",
			"emmetOptimizeStylesheetParsing": "Ако е зададено `false`, ще се анализира целият файл, за да се определи дали текущата позиция е подходяща за разгъване на съкращения на Emmet. Ако е зададено `true`, ще се анализира само съдържанието около текущата позиция във файловете css/scss/less."
		}
	}
}