{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"extension.description": "Проследявайте кода си на JavaScript и отстранявайте грешките в него чрез браузъра Chrome, или чрез всяка друга система, която поддържа протокола за отстраняване на грешки на Chrome.",
			"chrome.toggleSkipping.title": "Chrome: Превключване на пропускането на този файл",
			"chrome.toggleSmartStep.title": "Chrome: Превключване на умното пристъпване",
			"chrome.port.description": "Порт за отдалечено отстраняване на грешки чрез Chrome.",
			"chrome.address.description": "TCP/IP адрес на порта за отстраняване на грешки",
			"chrome.file.description": "Местен файл HTML, който да се отвори в браузъра",
			"chrome.url.description": "Ще се търси раздел с ТОЧНО този адрес и ще се прикачи към него, ако бъде намерен",
			"chrome.webRoot.description": "Това указва пълния път на работното място до основната папка на уеб-сървъра. Използва се за откриване на пътища като `/app.js` до файлове на диска. Това е съкратен вид `pathMapping` за `/`.",
			"chrome.pathMapping.description": "Свързване на адреси/пътища с местни папки, с цел откриване на кои скриптове на диска отговарят скриптовете в Chrome",
			"chrome.runtimeExecutable.description": "Пълен път на работното място до изпълнимия файл, който да се използва. Ако не е указан, ще се използва Chrome от инсталационната папка по подразбиране.",
			"chrome.runtimeArgs.description": "Аргументи, които да бъдат подадени на изпълнимия файл (незадължително).",
			"chrome.env.description": "Списък от двойки ключ-стойност за променливи на средата (незадължително).",
			"chrome.cwd.description": "Работна папка за изпълнимия файл (незадължително).",
			"chrome.sourceMaps.description": "Използване на кодови съответствия на JavaScript (ако съществуват).",
			"chrome.diagnosticLogging.description": "Ако е „true“ (вярно), адаптерът ща извежда своя собствена диагностична информация в конзолата, в четим формат.",
			"chrome.verboseDiagnosticLogging.description": "Ако е „true“ (вярно), адаптерът ще извежда цялата информация за трафика между клиента и целта (заедно с цялата информация от „diagnosticLogging“)",
			"chrome.trace.description": "Ако е „true“ (вярно), дебъгерът ще извежда подробна информация във файл. Ако е „verbose“, ще показва информацията и в конзолата.",
			"chrome.userDataDir.description": "По подразбиране Chrome се пуска с отделен потребителски профил във временна папка. Използвайте тази опция, за да го замените. Задайте „false“ (невярно), за да го пуснете с профила си по подразбиране.",
			"chrome.sourceMapPathOverrides.description": "Набор от съответствия за замяна на местоположенията на изходните файлове от това, което е посочено в кодовото съответствие, към истинските местоположения на диска. Вижте файла „README“ за повече подробности.",
			"chrome.smartStep.description": "Автоматично преминаване през произведения код, който не може да бъде свързан с оригиналния изходен код.",
			"chrome.skipFiles.description": "Масив от имена на файлове или папки, или шаблони на пътища, които да бъдат пропускани при дебъгване.",
			"chrome.timeout.description": "Това е период (в милисекунди), в който ще се правят опити за свързване с Chrome. По подразбиране стойността е 10000 мсек.",
			"chrome.disableNetworkCache.description": "Определя дали да се пропуска мрежовия кеш при всяка заявка",
			"chrome.urlFilter.description": "Ще се търси страница с този адрес и ще се прикачи към него, ако бъде намерен. Може да съдържа „*“ за заместване.",
			"chrome.showAsyncStacks.description": "Показване на асинхронните извиквания, които са довели до текущия стек на извикванията",
			"chrome.breakOnLoad.description": "Експериментална функционалност – ако е „true“ (вярно), адаптерът за дебъгване ще се опита да постави точки на прекъсване в скриптовете преди те да бъдат заредени, така че да може да спира при достигане на точки в началото на тези скриптове. Това може да влоши производителността.",
			"chrome.breakOnLoadStrategy.description": "Каква стратегия да се ползва за „breakOnLoad“.",
			"chrome.breakOnLoadStrategy.instrument.description": "Инструктиране на „Chrome“ да спира на пауза при зареждането на всеки скрипт, за обработка на кодовите съответствия и поставяне на точки на прекъсване.",
			"chrome.breakOnLoadStrategy.regex.description": "Поставя точки на прекъсване във файловете със същото име като файла, в който е поставена точката на прекъсване."
		},
		"out/src/chromeDebugAdapter": {
			"attribute.chrome.missing": "Chrome не е открит. Инсталирайте го или задайте стойност на полето „runtimeExecutable“ в настройките за пускане."
		},
		"out/src/errors": {
			"attribute.path.not.exist": "Атрибутът „{0}“ не съществува („{1}“)."
		},
		"out/src/extension": {
			"chrome.launch.name": "Пускане на Chrome с адрес „localhost“",
			"chrome.targets.placeholder": "Изберете раздел"
		}
	}
}