{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"description": "Podpora modulu plug-in Emmet pro VS Code",
			"command.wrapWithAbbreviation": "Zabalit pomocí zkratky",
			"command.wrapIndividualLinesWithAbbreviation": "Zabalit jednotlivé řádky pomocí zkratky",
			"command.removeTag": "Odebrat značku",
			"command.updateTag": "Aktualizovat značku",
			"command.matchTag": "Přejít na odpovídající pár",
			"command.balanceIn": "Vyvážení (směrem dovnitř)",
			"command.balanceOut": "Vyvážení (směrem ven)",
			"command.prevEditPoint": "Přejít na předchozí bod úprav",
			"command.nextEditPoint": "Přejít na další bod úprav",
			"command.mergeLines": "Sloučit řádky",
			"command.selectPrevItem": "Vybrat předchozí položku",
			"command.selectNextItem": "Vybrat další položku",
			"command.splitJoinTag": "Značka rozdělení/spojení",
			"command.toggleComment": "Přepnout komentář",
			"command.evaluateMathExpression": "Vyhodnotit matematický výraz",
			"command.updateImageSize": "Aktualizovat velikost obrázku",
			"command.reflectCSSValue": "Rozkopírovat hodnotu CSS",
			"command.incrementNumberByOne": "Zvýšit o 1",
			"command.decrementNumberByOne": "Snížit o 1",
			"command.incrementNumberByOneTenth": "Zvýšit o 0,1",
			"command.decrementNumberByOneTenth": "Snížit o 0,1",
			"command.incrementNumberByTen": "Zvýšit o 10",
			"command.decrementNumberByTen": "Snížit o 10",
			"emmetSyntaxProfiles": "Definujte profil pro zadanou syntaxi nebo použijte svůj vlastní profil se specifickými pravidly.",
			"emmetExclude": "Pole hodnot jazyků, kde by se neměly rozbalovat zkratky Emmet",
			"emmetExtensionsPath": "Cesta ke složce obsahující profily a fragmenty kódu Emmet",
			"emmetShowExpandedAbbreviation": "Umožňuje zobrazovat rozbalené zkratky Emmet jako návrhy.\r\nMožnost inMarkupAndStylesheetFilesOnly platí pro html, haml, jade, slim, xml, xsl, css, scss, sass, less a stylus.\r\nMožnost always se vztahuje na všechny části souboru bez ohledu na značky/css.",
			"emmetShowAbbreviationSuggestions": "Umožňuje zobrazovat možné zkratky Emmet jako návrhy. Nelze použít v šablonách stylů nebo v případě, že má nastavení emmet.showExpandedAbbreviation hodnotu never.",
			"emmetIncludeLanguages": "Umožňuje povolit zkratky Emmet v jazycích, které nejsou ve výchozím nastavení podporovány. Sem přidejte mapování mezi jazykem a jazykem podporovaným modulem plug-in Emmet.\r\n Například {\"vue-html\": \"html\", \"javascript\": \"javascriptreact\"}",
			"emmetVariables": "Proměnné, které se mají používat ve fragmentech kódu Emmet",
			"emmetTriggerExpansionOnTab": "Pokud je povoleno, zkratky Emmet se rozbalí při stisknutí klávesy Tab.",
			"emmetPreferences": "Předvolby používané k úpravě chování určitých akcí a překladačů v modulu plug-in Emmet",
			"emmetPreferencesIntUnit": "Výchozí jednotka pro hodnoty integer",
			"emmetPreferencesFloatUnit": "Výchozí jednotka pro hodnoty float",
			"emmetPreferencesCssAfter": "Symbol, který se má umístit na konec vlastnosti CSS při rozbalování zkratek CSS",
			"emmetPreferencesSassAfter": "Symbol, který se má umístit na konec vlastnosti CSS při rozbalování zkratek CSS v souborech Sass",
			"emmetPreferencesStylusAfter": "Symbol, který se má umístit na konec vlastnosti CSS při rozbalování zkratek CSS v souborech Stylus",
			"emmetPreferencesCssBetween": "Symbol, který se má umístit mezi vlastnost CSS a hodnotu při rozbalování zkratek CSS",
			"emmetPreferencesSassBetween": "Symbol, který se má umístit mezi vlastnost CSS a hodnotu při rozbalování zkratek CSS v souborech Sass",
			"emmetPreferencesStylusBetween": "Symbol, který se má umístit mezi vlastnost CSS a hodnotu při rozbalování zkratek CSS v souborech Stylus",
			"emmetShowSuggestionsAsSnippets": "Pokud má hodnotu true, návrhy Emmet se zobrazí jako fragmenty kódu, což vám umožní uspořádat je podle nastavení #editor.snippetSuggestions#.",
			"emmetPreferencesBemElementSeparator": "Oddělovač elementů používaný pro třídy při použití filtru BEM",
			"emmetPreferencesBemModifierSeparator": "Oddělovač modifikátorů používaný pro třídy při použití filtru BEM",
			"emmetPreferencesFilterCommentBefore": "Definice komentáře, který by měl být umístěn před odpovídajícím elementem, když je aplikován filtr komentáře",
			"emmetPreferencesFilterCommentAfter": "Definice komentáře, který by měl být umístěn za odpovídající element, když je aplikován filtr komentáře",
			"emmetPreferencesFilterCommentTrigger": "Seznam názvů atributů oddělených čárkami, které se musí ve zkratce objevit, aby se aplikoval filtr komentářů",
			"emmetPreferencesFormatNoIndentTags": "Pole hodnot názvů značek, které by nemělo získávat vnitřní odsazení",
			"emmetPreferencesFormatForceIndentTags": "Pole hodnot názvů značek, které by mělo vždy získávat vnitřní odsazení",
			"emmetPreferencesAllowCompactBoolean": "Při hodnotě true se vytvoří kompaktní notace logických atributů.",
			"emmetPreferencesCssWebkitProperties": "Vlastnosti CSS oddělené čárkami, které dostanou předponu dodavatele „webkit“ při použití ve zkratce Emmet, která začíná znakem „-“. Pokud chcete vždy zabránit použití předpony „webkit“, nastavte prázdný řetězec.",
			"emmetPreferencesCssMozProperties": "Vlastnosti CSS oddělené čárkami, které dostanou předponu dodavatele „moz“ při použití ve zkratce Emmet, která začíná znakem „-“. Pokud chcete vždy zabránit použití předpony „moz“, nastavte prázdný řetězec.",
			"emmetPreferencesCssOProperties": "Vlastnosti CSS oddělené čárkami, které dostanou předponu dodavatele „o“ při použití ve zkratce Emmet, která začíná znakem „-“. Pokud chcete vždy zabránit použití předpony „o“, nastavte prázdný řetězec.",
			"emmetPreferencesCssMsProperties": "Vlastnosti CSS oddělené čárkami, které dostanou předponu dodavatele „ms“ při použití ve zkratce Emmet, která začíná znakem „-“. Pokud chcete vždy zabránit použití předpony „ms“, nastavte prázdný řetězec.",
			"emmetPreferencesCssFuzzySearchMinScore": "Minimální skóre (0 až 1), kterého by měla dosáhnout zkratka s částečnou shodou. Nižší hodnoty mohou mít za následek mnoho falešně pozitivních shod, vyšší hodnoty mohou snížit počet možných shod.",
			"emmetOptimizeStylesheetParsing": "Pokud je nastaveno na hodnotu false, parsuje se celý soubor, aby se zjistilo, jestli je aktuální pozice platná pro rozbalení zkratek Emmet. Pokud je nastaveno na hodnotu true, bude parsován pouze obsah na aktuální pozici v souborech css/scss/less."
		}
	}
}