{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"displayName": "Funkce jazyka HTML",
			"description": "Poskytuje rozšířenou podporu jazyka pro soubory HTML a Handlebar.",
			"html.customData.desc": "Seznam relativních cest k souborům odkazující na soubory JSON používající [formát vlastních dat](https://github.com/microsoft/vscode-html-languageservice/blob/master/docs/customData.md).\r\n\r\nVS Code načte vlastní data při spuštění a rozšíří svou podporu HTML o vlastní značky HTML, atributy a hodnoty atributů, které zadáte v souborech JSON.\r\n\r\nCesty k souborům jsou relativní vzhledem k pracovnímu prostoru a zvažují se jenom nastavení složek pracovního prostoru.",
			"html.format.enable.desc": "Umožňuje povolit nebo zakázat výchozí formátovací modul HTML.",
			"html.format.wrapLineLength.desc": "Maximální počet znaků na řádek (0 = zakázat)",
			"html.format.unformatted.desc": "Seznam značek oddělených čárkami, které by neměly být přeformátovávány. Výchozím nastavením při hodnotě null jsou všechny značky uvedené na https://www.w3.org/TR/html5/dom.html#phrasing-content.",
			"html.format.contentUnformatted.desc": "Seznam značek oddělených čárkami, ve kterých by se neměl přeformátovávat obsah. Výchozím nastavením při hodnotě null je značka pre.",
			"html.format.indentInnerHtml.desc": "Odsadit oddíly <head> a <body>",
			"html.format.preserveNewLines.desc": "Určuje, jestli mají být zachovány existující konce řádků před elementy. Funguje pouze před elementy, nikoli uvnitř značek nebo pro text.",
			"html.format.maxPreserveNewLines.desc": "Maximální počet konců řádků, které mají být zachovány v jednom bloku. Pro neomezený počet použijte hodnotu null.",
			"html.format.indentHandlebars.desc": "Naformátovat a odsadit {{#foo}} a {{/foo}}",
			"html.format.endWithNewline.desc": "Ukončení symbolem nového řádku",
			"html.format.extraLiners.desc": "Seznam značek oddělených čárkami, před kterými by měl být navíc doplněn symbol nového řádku. Výchozím nastavením při hodnotě null je \"head, body, /html\".",
			"html.format.wrapAttributes.desc": "Zalamovat atributy",
			"html.format.wrapAttributes.auto": "Atributy zalamovat pouze v případě překročení délky řádku",
			"html.format.wrapAttributes.force": "Zalomit každý atribut s výjimkou prvního",
			"html.format.wrapAttributes.forcealign": "Zalomit každý atribut s výjimkou prvního a zachovat zarovnání",
			"html.format.wrapAttributes.forcemultiline": "Zalomit každý atribut",
			"html.format.wrapAttributes.alignedmultiple": "Zalamovat při překročení délky řádku, zarovnat atributy svisle",
			"html.format.wrapAttributes.preserve": "Zachovat zalamování atributů",
			"html.format.wrapAttributes.preservealigned": "Zachovat zalamování atributů, ale zarovnávat",
			"html.format.templating.desc": "Dodržovat značky jazyka django, erb, handlebars a php pro šablony",
			"html.format.unformattedContentDelimiter.desc": "Mezi tímto řetězcem uchovávat obsah textu pohromadě",
			"html.format.wrapAttributesIndentSize.desc": "Velikost zarovnání při použití hodnoty vynucené zarovnání (force aligned) a vícenásobné zarovnání (aligned multiple) v #html.format.wrapAttributes# nebo null k použití výchozí velikosti odsazení",
			"html.suggest.html5.desc": "Určuje, jestli integrovaná podpora jazyka HTML navrhuje hodnoty, vlastnosti a značky jazyka HTML5.",
			"html.trace.server.desc": "Sleduje komunikaci mezi VS Code a serverem jazyka HTML.",
			"html.validate.scripts": "Určuje, jestli integrovaná podpora jazyka HTML ověřuje vložené skripty.",
			"html.validate.styles": "Určuje, jestli integrovaná podpora jazyka HTML ověřuje vložené styly.",
			"html.autoClosingTags": "Umožňuje povolit nebo zakázat automatické uzavírání značek HTML.",
			"html.mirrorCursorOnMatchingTag": "Umožňuje povolit nebo zakázat zrcadlení kurzoru pro párovou značku HTML.",
			"html.mirrorCursorOnMatchingTagDeprecationMessage": "Tato možnost je zastaralá. Místo ní se používá možnost editor.linkedEditing.",
			"html.hover.documentation": "Po najetí myší zobrazovat značku a dokumentaci k atributu",
			"html.hover.references": "Po najetí myší zobrazovat odkazy na MDN"
		},
		"client\\dist\\node/htmlClient": {
			"htmlserver.name": "Server jazyka HTML",
			"folding.start": "Začátek oblasti sbalení",
			"folding.end": "Konec oblasti sbalení",
			"folding.html": "Jednoduchý výchozí bod pro HTML5",
			"configureButton": "Konfigurovat",
			"linkedRenameQuestion": "VS Code má nyní integrovanou podporu pro automatické přejmenovávání značek. Chcete ji povolit?"
		}
	}
}