{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"add.browser.breakpoint": "Přidat zarážku prohlížeče",
			"attach.node.process": "Připojit k procesu uzlu (Preview)",
			"base.cascadeTerminateToConfigurations.label": "Seznam relací ladění, které budou také zastaveny, když bude ukončena tato relace ladění",
			"browser.address.description": "IP adresa nebo název hostitele, na kterých naslouchá laděný prohlížeč",
			"browser.attach.port.description": "Port, který se má použít ke vzdálenému ladění prohlížeče, zadaný jako --remote-debugging-port při spuštění prohlížeče",
			"browser.baseUrl.description": "Základní adresa URL pro překlad cest baseUrl. BaseURL se při mapování adres URL na soubory na disku zkracuje. Ve výchozím nastavení je to doména adresy URL spuštění.",
			"browser.browserAttachLocation.description": "Vynutí připojení prohlížeče v jednom umístění. Ve vzdáleném pracovním prostoru (například přes SSH nebo WSL) lze pomocí tohoto nastavení připojit prohlížeč na vzdáleném počítači (místo toho, aby byl připojen místně).",
			"browser.browserLaunchLocation.description": "Vynutí spuštění prohlížeče v jednom umístění. Ve vzdáleném pracovním prostoru (například přes SSH nebo WSL) lze pomocí tohoto nastavení otevřít prohlížeč na vzdáleném počítači (místo toho, aby byl připojen místně).",
			"browser.cleanUp.description": "Jaké čištění se má provést po dokončení relace ladění. Určuje, jestli se má zavřít pouze laděná karta nebo celý prohlížeč.",
			"browser.cwd.description": "Volitelný pracovní adresář pro spustitelný soubor modulu runtime",
			"browser.disableNetworkCache.description": "Určuje, jestli se má u každého požadavku přeskočit mezipaměť sítě.",
			"browser.env.description": "Volitelný slovník dvojic klíč/hodnota prostředí pro prohlížeč",
			"browser.file.description": "Místní soubor HTML, který se má otevřít v prohlížeči",
			"browser.includeDefaultArgs.description": "Určuje, jestli se pro spuštění použijí výchozí argumenty pro spuštění prohlížeče (k zakázání funkcí, které by mohly ladění ztížit).",
			"browser.inspectUri.description": "Formát, který se má použít k přepsání inspectUri: Je to řetězec šablony, který interpoluje klíče v {curlyBraces}. Dostupné klíče jsou:\r\n - url.* je parsovaná adresa spuštěné aplikace. Příklad: {url.port}, {url.hostname}\r\n - port je ladicí port, na kterém Chrome naslouchá.\r\n - browserInspectUri je identifikátor URI inspektoru ve spuštěném prohlížeči.\r\n - wsProtocol je protokol websocket doporučený v tipu. Pokud je původní adresa URL https, je nastaveno na wss, jinak je nastaveno na ws.\r\n",
			"browser.launch.port.description": "Port, na kterém má prohlížeč naslouchat. Výchozí nastavení 0 způsobí, že prohlížeč bude laděn přes kanály, což je obecně bezpečnější možnost, kterou se doporučuje zvolit, pokud se nebudete chtít k prohlížeči připojovat z jiného nástroje.",
			"browser.pathMapping.description": "Mapování adres URL / cest na místní složky pro překlad skriptů v prohlížeči na skripty na disku",
			"browser.perScriptSourcemaps.description": "Určuje, jestli se skripty načítají jednotlivě s jedinečnými soubory sourcemap, které obsahují základní název zdrojového souboru. Tato možnost se dá nastavit, aby se optimalizovalo zpracování souboru sourcemap při práci s velkým počtem malých skriptů. Když se nastaví auto, zjistíme známé případy, kdy je to žádoucí.",
			"browser.profileStartup.description": "V případě hodnoty true bude profilování spuštěno při spuštění procesu.",
			"browser.restart": "Určuje, jestli se má obnovit připojení při zavření připojení prohlížeče.",
			"browser.revealPage": "Přepnout fokus na kartu",
			"browser.runtimeArgs.description": "Nepovinné argumenty se předaly do spustitelného souboru modulu runtime.",
			"browser.runtimeExecutable.description": "Může mít hodnotu canary, stable nebo custom, případně to může být cesta ke spustitelnému souboru prohlížeče. Možnost custom znamená vlastní obálku, vlastní sestavení nebo proměnnou prostředí CHROME_PATH.",
			"browser.runtimeExecutable.edge.description": "Může mít hodnotu canary, stable, dev nebo custom, případně to může být cesta ke spustitelnému souboru prohlížeče. Možnost custom znamená vlastní obálku, vlastní sestavení nebo proměnnou prostředí EDGE_PATH.",
			"browser.server.description": "Nakonfiguruje webový server, který má být spuštěn. Používá stejnou konfiguraci jako úloha spuštění node.",
			"browser.skipFiles.description": "Pole s názvy souborů či složek nebo globy cesty, které se mají při ladění přeskočit",
			"browser.smartStep.description": "Automatické krokování pro nenamapované řádky v souborech sourcemap. Například kód, který TypeScript vytváří automaticky při kompilaci async/await nebo jiných funkcí.",
			"browser.sourceMapPathOverrides.description": "Sada mapování pro přepsání umístění zdrojových souborů z umístění podle sourcemapu na jejich umístění na disku. Podrobnosti najdete v souboru README.",
			"browser.sourceMaps.description": "Použijí se soubory sourcemap JavaScriptu (pokud existují).",
			"browser.targetSelection": "Určuje, jestli se má provést připojení ke všem cílům, které odpovídají filtru adresy URL (automatic), nebo jestli se má zobrazit výzva k výběru jednoho z nich (pick).",
			"browser.timeout.description": "Doba opakování pokusů o připojení k prohlížeči v milisekundách. Výchozí hodnota je 10 000 ms.",
			"browser.url.description": "Bude hledat kartu s touto přesnou adresou URL a připojí se k ní, pokud bude nalezena.",
			"browser.urlFilter.description": "Bude hledat stránku s touto adresou URL, a pokud ji najde, připojí se k ní. Může obsahovat zástupné znaky *.",
			"browser.userDataDir.description": "Ve výchozím nastavení je prohlížeč spuštěn se samostatným profilem uživatele v dočasné složce. Pomocí této možnosti to lze přepsat. Pokud chcete prohlížeč spustit s výchozím profilem uživatele, nastavte hodnotu false.",
			"browser.vueComponentPaths": "Seznam vzorů glob souboru pro hledání komponent *.vue. Ve výchozím nastavení se vyhledávání provádí v celém pracovním prostoru. Tento seznam musí být specifikován z důvodu dalších vyhledávání požadovaných mapováními zdroje ve Vue CLI 4. Pokud chcete toto speciální zpracovávání zakázat, zadejte jako hodnotu tohoto nastavení prázdné pole hodnot.",
			"browser.webRoot.description": "Určuje absolutní cestu pracovního prostoru ke kořenovému adresáři webového serveru. Používá se pro překlad cest k souborům na disku, například /app.js. Zkratka pro pathMapping pro /",
			"chrome.attach.description": "Připojit k instanci Chromu, která už je v režimu ladění",
			"chrome.attach.label": "Chrome: připojení",
			"chrome.label": "Chrome (Preview)",
			"chrome.launch.description": "Spustit Chrome pro ladění adresy URL",
			"chrome.launch.label": "Chrome: spustit",
			"configuration.autoAttachMode": "Konfiguruje, které procesy se mají automaticky připojovat a ladit, když je zapnuté nastavení #debug.node.autoAttach#. Proces uzlu spuštěný s příznakem --inspect bude bez ohledu na toto nastavení připojen vždy.",
			"configuration.autoAttachMode.always": "Automaticky připojovat ke každému procesu Node.js spuštěnému v terminálu",
			"configuration.autoAttachMode.disabled": "Automatické připojení je zakázáno a nezobrazuje se na stavovém řádku.",
			"configuration.autoAttachMode.explicit": "Připojit, pouze pokud je zadán parametr --inspect",
			"configuration.autoAttachMode.smart": "Automaticky připojit při spouštění skriptů, které nejsou ve složce node_modules",
			"configuration.autoAttachSmartPatterns": "Konfiguruje vzory globů pro určení, kdy se má k připojení použít inteligentní režim #debug.javascript.autoAttachFilter#. Parametr $KNOWN_TOOLS$ se nahradí seznamem názvů běžných spouštěčů testů a kódu. [Další informace najdete v dokumentaci pro VS Code](https://code.visualstudio.com/docs/nodejs/nodejs-debugging#_auto-attach-smart-patterns).",
			"configuration.autoExpandGetters": "Konfiguruje, jestli se budou automaticky rozbalovat metody getter vlastností. Pokud má hodnotu false, metoda getter se zobrazí jako get propertyName a bude vyhodnocena až při kliknutí na ni.",
			"configuration.automaticallyTunnelRemoteServer": "Při ladění vzdálené webové aplikace určuje, jestli se má automaticky vytvářet tunelové připojení mezi vzdáleným serverem a vaším místním počítačem.",
			"configuration.breakOnConditionalError": "Určuje, jestli se má zastavit provádění, pokud podmíněné zarážky způsobí chybu. Poznámka: Pokud chcete použít toto nastavení, musíte zadat předponu pwa- pro typ (type) v souboru launch.json, například pwa-node.",
			"configuration.debugByLinkOptions": "Možnosti použité při ladění otevřených odkazů, na které se kliklo z terminálu ladění JavaScriptu. Pokud chcete toto chování zakázat, můžete pro toto nastavení zadat hodnotu off (vypnuto). Hodnota always (vždy) povolí ladění na všech terminálech.",
			"configuration.npmScriptLensLocation": "Kde chcete ve svých skriptech npm zobrazit informace CodeLens pro možnosti Run (Spustit) a Debug (Ladit). Možné hodnoty: all (všechny skripty), top (v horní části oddílu skriptů) nebo never (nikdy)",
			"configuration.pickAndAttachOptions": "Výchozí možnosti používané při ladění procesu pomocí příkazu Ladit: připojit k procesu Node.js",
			"configuration.suggestPrettyPrinting": "Určuje, jestli se má navrhnout přehledný výpis kódu JavaScriptu, který při krokování s vnořením vypadá jako minifikovaný.",
			"configuration.terminalOptions": "Výchozí možnosti spuštění pro terminál ladění JavaScriptu a skripty npm",
			"configuration.unmapMissingSources": "Konfiguruje, jestli se automaticky zruší mapování souboru sourcemapped v případech, kdy se původní soubor nedá přečíst. Pokud je tato hodnota false (výchozí), zobrazí se výzva.",
			"configuration.usePreview": "Použít nový ladicí program JavaScriptu pro Node.js a Chrome ve verzi Preview",
			"createDiagnostics.label": "Vytvořit diagnostické informace pro aktuální relaci",
			"customDescriptionGenerator.description": "Přizpůsobte si textový popis, který ladicí program zobrazí pro objekty (místní proměnné atd.). Příklady:\r\n      1. this.toString()// bude volat metodu toString pro tisk všech objektů.\r\n      2. this.customDescription ? this.customDescription() : defaultValue // Použít metodu customDescription, pokud je k dispozici, jinak vrátit hodnotu defaultValue\r\n      3. function (def) { return this.customDescription ? this.customDescription() : def } // Použít metodu customDescription, pokud je k dispozici, jinak vrátit hodnotu defaultValue\r\n      ",
			"debug.npm.edit": "Upravit soubor package.json",
			"debug.npm.noScripts": "Ve vašem souboru package.json nebyly nalezeny žádné skripty npm.",
			"debug.npm.noWorkspaceFolder": "Pokud chcete ladit skripty npm, musíte otevřít složku pracovního prostoru.",
			"debug.npm.parseError": "Nelze přečíst {0}: {1}",
			"debug.npm.script": "Ladit skript NPM",
			"debug.terminal.attach": "Připojit k procesu terminálu Node.js",
			"debug.terminal.label": "Vytvořit terminál pro ladění JavaScriptu",
			"debug.terminal.program.description": "Příkaz, který se má spustit na spuštěném terminálu. Pokud není zadáno, terminál se otevře bez spuštění programu.",
			"debug.terminal.snippet.label": "Spustit npm start v terminálu ladění",
			"debug.terminal.toggleAuto": "Přepnout automatické připojení Node.js terminálu",
			"debug.terminal.welcome": "[Terminál pro ladění JavaScriptu](command:extension.pwa-node-debug.createDebuggerTerminal)\r\n\r\nPomocí terminálu pro ladění JavaScriptu můžete ladit procesy Node.js spuštěné na příkazovém řádku.\r\n\r\n[Adresa URL pro ladění](command:extension.js-debug.debugLink)",
			"debugLink.label": "Otevřít odkaz",
			"edge.address.description": "IP adresa nebo název hostitele, kterým webové zobrazení naslouchá při ladění webových zobrazení. Pokud není nastaveno, bude automaticky zjištěno.",
			"edge.attach.description": "Připojit k instanci Microsoft Edge, která už je v režimu ladění",
			"edge.attach.label": "Edge: připojit",
			"edge.label": "Edge (Preview)",
			"edge.launch.description": "Spustit Edge pro ladění adresy URL",
			"edge.launch.label": "Edge: spustit",
			"edge.port.description": "Port, na kterém ladicí program webového zobrazení naslouchá při ladění webových zobrazení. Pokud není nastaveno, bude automaticky zjištěno.",
			"edge.useWebView.description": "(Pouze Edge (Chromium)) Když má hodnotu true, bude ladicí program považovat spustitelný soubor modulu runtime za hostitelskou aplikaci, která obsahuje webové zobrazení (WebView), což vám umožní ladit obsah skriptu webového zobrazení.",
			"enableContentValidation.description": "Určuje, jestli budeme ověřovat, že se obsah souborů na disku shoduje s těmi, které jsou načteny za běhu. To je užitečné v různých scénářích (a v některých z nich je to vyžadováno), může to však také vést k problémům, například pokud se použije transformace skriptů na straně serveru.",
			"errors.timeout": "{0}: vypršení časového limitu po {1} ms",
			"extension.description": "Rozšíření pro ladění programů Node.js a Chromu",
			"extensionHost.label": "Vývoj rozšíření pro VS Code (Preview)",
			"extensionHost.launch.config.name": "Spustit rozšíření",
			"extensionHost.launch.debugWebWorkerHost": "Konfiguruje, jestli se máme zkusit připojit k hostiteli rozšíření webového pracovního procesu.",
			"extensionHost.launch.debugWebviews": "Umožňuje nakonfigurovat, jestli se máme zkusit připojit k webovým zobrazením ve spuštěné instanci editoru VS Code. **Poznámka:** Ke správnému fungování je aktuálně nutné nastavit možnost webview.experimental.useIframes na true a funkce je dostupná jenom v desktopové verzi editoru VS Code.",
			"extensionHost.launch.env.description": "Proměnné prostředí se předaly hostiteli rozšíření.",
			"extensionHost.launch.rendererDebugOptions": "Možnosti spuštění prohlížeče Chrome, které se mají použít při připojování k procesu vykreslování pomocí nastavení debugWebviews nebo debugWebWorkerHost",
			"extensionHost.launch.runtimeExecutable.description": "Absolutní cesta k VS Code",
			"extensionHost.launch.stopOnEntry.description": "Po spuštění automaticky zastaví hostitele rozšíření.",
			"extensionHost.snippet.launch.description": "Spustit rozšíření VS Code v režimu ladění",
			"extensionHost.snippet.launch.label": "Vývoj rozšíření VS Code",
			"longPredictionWarning.disable": "Znovu nezobrazovat",
			"longPredictionWarning.message": "Konfigurace zarážek trvá delší dobu. Můžete ji urychlit aktualizací nastavení outFiles v souboru launch.json.",
			"longPredictionWarning.noFolder": "Není otevřená žádná složka pracovního prostoru.",
			"longPredictionWarning.open": "Otevřít soubor launch.json",
			"node.address.description": "Adresa TCP/IP procesu, který se má ladit. Výchozí hodnota je localhost.",
			"node.attach.attachExistingChildren.description": "Určuje, jestli má být proveden pokus o připojení k již vytvořeným podřízeným procesům.",
			"node.attach.attachSpawnedProcesses.description": "Určuje, jestli se mají nastavit proměnné prostředí v připojeném procesu ke sledování vytvořených podřízených položek.",
			"node.attach.config.name": "Připojit",
			"node.attach.continueOnAttach": "Pokud je nastavena hodnota true, automaticky obnovíme programy, které byly spuštěny a které čekají na --inspect-brk.",
			"node.attach.processId.description": "ID procesu, ke kterému se má provést připojení",
			"node.attach.restart.description": "Umožňuje pokusit se k programu znovu připojit v případě ztráty připojení. Pokud je nastavena hodnota true, budou pokusy o opětovné připojení prováděny jednou za sekundu bez omezení počtu pokusů. Interval a maximální počet opakovaných pokusů můžete upravit tak, že místo toho v objektu zadáte hodnoty pro nastavení delay a maxAttempts.",
			"node.attachSimplePort.description": "Pokud je nastaveno, provede se připojení k procesu přes zadaný port. Obecně to pro programy Node.js již není nutné a ztrácí se tím možnost ladit podřízené procesy, ale může to být užitečné v některých neobvyklých scénářích, například při spuštění Deno a Dockeru. Pokud je nastaveno na hodnotu 0, zvolí se náhodný port a k argumentům spuštění se automaticky přidá volba --inspect-brk.",
			"node.console.title": "Konzola ladění uzlů",
			"node.disableOptimisticBPs.description": "Nenastavujte zarážky do žádného souboru, dokud se pro daný soubor nenačte sourcemap.",
			"node.label": "Node.js (Preview)",
			"node.launch.args.description": "Argumenty příkazového řádku, které se předávají do programu",
			"node.launch.autoAttachChildProcesses.description": "Automaticky připojovat ladicí program k novým podřízených procesům",
			"node.launch.config.name": "Spustit",
			"node.launch.console.description": "Kde se má spustit cíl ladění",
			"node.launch.console.externalTerminal.description": "Externí terminál, který lze konfigurovat pomocí uživatelského nastavení",
			"node.launch.console.integratedTerminal.description": "Integrovaný terminál VS Code",
			"node.launch.console.internalConsole.description": "Konzola ladění VS Code (nepodporující vstup čtení z programu)",
			"node.launch.cwd.description": "Absolutní cesta k pracovnímu adresáři laděného programu",
			"node.launch.env.description": "Proměnné prostředí se předaly do programu. Hodnota null odebere proměnnou z prostředí.",
			"node.launch.envFile.description": "Absolutní cesta k souboru, který obsahuje definice proměnných prostředí",
			"node.launch.logging": "Konfigurace protokolování",
			"node.launch.logging.cdp": "Cesta k souboru protokolu pro zprávy protokolu Chrome DevTools",
			"node.launch.logging.dap": "Cesta k souboru protokolu pro zprávy protokolu adaptéru ladění",
			"node.launch.outputCapture.description": "Určuje, odkud se mají zachycovat výstupní zprávy: výchozí rozhraní API pro ladění, pokud je nastaveno na hodnotu console, nebo streamy stdout/stderr, pokud je nastaveno na hodnotu std.",
			"node.launch.program.description": "Absolutní cesta k programu. Vygenerovaná hodnota je odhadnuta podle souboru package.json a otevřených souborů. Upravte tento atribut.",
			"node.launch.restart.description": "Zkusit program restartovat, pokud je ukončen s nenulovým ukončovacím kódem",
			"node.launch.runtimeArgs.description": "Nepovinné argumenty se předaly do spustitelného souboru modulu runtime.",
			"node.launch.runtimeExecutable.description": "Modul runtime, který se má použít. Absolutní cesta nebo název modulu runtime, který je k dispozici prostřednictvím proměnné PATH. V případě vynechání se předpokládá hodnota node.",
			"node.launch.runtimeSourcemapPausePatterns": "Seznam vzorů pro ruční vkládání zarážek pro vstupní body. Lze to použít k tomu, aby měl ladicí program možnost nastavit zarážky při použití mapování zdroje, která neexistují nebo která nebylo možné najít před spuštěním, jako například [v případě Serverless Framework](https://github.com/microsoft/vscode-js-debug/issues/492).",
			"node.launch.runtimeVersion.description": "Verze modulu runtime node, která se má používat. Vyžaduje nvm.",
			"node.launch.useWSL.deprecation": "Rozšíření useWSL je zastaralé a přestane se podporovat. Místo toho použijte rozšíření Remote - WSL.",
			"node.launch.useWSL.description": "Použít subsystém Windows pro Linux",
			"node.localRoot.description": "Cesta k místnímu adresáři obsahujícímu program",
			"node.pauseForSourceMap.description": "Určuje, jestli se má počkat, než se načtou mapování zdroje pro každý příchozí skript. Toto nastavení snižuje výkon (zvyšuje režii zpracování) a při spuštění z disku je možné ho bezpečně zakázat, pokud není zakázána možnost rootPath.",
			"node.port.description": "Port ladění, ke kterému se chcete připojit. Výchozí hodnota je 5858.",
			"node.processattach.config.name": "Připojit k procesu",
			"node.profileStartup.description": "V případě hodnoty true bude profilování spuštěno při spuštění procesu.",
			"node.remoteRoot.description": "Absolutní cesta ke vzdálenému adresáři obsahujícímu program",
			"node.resolveSourceMapLocations.description": "Seznam vzorů minimatch pro umístění (složky a adresy URL), kde je možné použít mapování zdroje k vyhodnocení umístění místních souborů. Lze tím zabránit případné chybě v kódu při mapování na externí zdroj. Vzory lze vyloučit tak, že k nim přidáte předponu !. Omezení lze zabránit nastavením prázdného pole hodnot nebo hodnoty null.",
			"node.showAsyncStacks.description": "Zobrazí se asynchronní volání, která vedla k aktuálnímu zásobníku volání.",
			"node.snippet.attach.description": "Připojit k běžícímu programu uzlu",
			"node.snippet.attach.label": "Node.js: připojit",
			"node.snippet.attachProcess.description": "Otevřít výběr procesu k výběru procesu uzlu, ke kterému se má provést připojení",
			"node.snippet.attachProcess.label": "Node.js: připojit k procesu",
			"node.snippet.electron.description": "Ladit hlavní proces Electron",
			"node.snippet.electron.label": "Node.js: hlavní proces Electron",
			"node.snippet.gulp.description": "Ladit úlohu Gulp (zajistěte, abyste měli v projektu místně nainstalovaný Gulp)",
			"node.snippet.gulp.label": "Node.js: úloha Gulp",
			"node.snippet.launch.description": "Spustit program uzlu v režimu ladění",
			"node.snippet.launch.label": "Node.js: spustit program",
			"node.snippet.mocha.description": "Ladit testy Mocha",
			"node.snippet.mocha.label": "Node.js: testy Mocha",
			"node.snippet.nodemon.description": "Použít nástroj nodemon k opětovnému spuštění relace ladění při změnách zdroje",
			"node.snippet.nodemon.label": "Node.js: instalace nástroje Nodemon",
			"node.snippet.npm.description": "Spustit program uzlu prostřednictvím npm skriptu debug",
			"node.snippet.npm.label": "Node.js: spustit přes NPM",
			"node.snippet.remoteattach.description": "Připojit k portu ladění programu vzdáleného uzlu",
			"node.snippet.remoteattach.label": "Node.js: připojit ke vzdálenému programu",
			"node.snippet.yo.description": "Ladit generátor Yeoman (nainstalujte spuštěním příkazu npm link v projektové složce)",
			"node.snippet.yo.label": "Node.js: generátor Yeoman",
			"node.sourceMapPathOverrides.description": "Sada mapování pro přepsání umístění zdrojových souborů z umístění, která jsou uvedena v mapování zdrojů, na jejich umístění na disku",
			"node.sourceMaps.description": "Použijí se soubory sourcemap JavaScriptu (pokud existují).",
			"node.stopOnEntry.description": "Po spuštění se program automaticky zastaví.",
			"node.timeout.description": "Opakované pokusy o připojení k Node.js se budou provádět tento počet milisekund. Výchozí hodnota je 10000 ms.",
			"node.versionHint.description": "Umožňuje explicitně zadat spuštěnou verzi uzlu, která se dá použít k zakázání nebo povolení určitých chování v případech, kdy nefunguje automatická detekce verze.",
			"node.websocket.address.description": "Přesná adresa protokolu WebSocket pro připojení. Pokud není zadáno, bude zjištěno z adresy a portu.",
			"outFiles.description": "Při povolení souborů sourcemap tyto vzory glob určují vygenerované soubory JavaScriptu. Pokud vzor začíná znakem !, budou soubory vyloučeny. Pokud není zadán, bude se vygenerovaný kód očekávat ve stejném adresáři jako jeho zdroj.",
			"pretty.print.script": "Přehledný výpis pro ladění",
			"profile.start": "Použít profil výkonu",
			"profile.stop": "Zastavit profil výkonu",
			"remove.browser.breakpoint": "Odebrat zarážku prohlížeče",
			"remove.browser.breakpoint.all": "Odebrat všechny zarážky prohlížeče",
			"skipFiles.description": "Pole hodnot vzorů glob pro soubory, které se mají přeskočit při ladění. Vzor <node_internals>/** odpovídá všem interním modulům Node.js.",
			"smartStep.description": "Provede se automatické krokování vygenerovaného kódu, který nelze namapovat zpět do původního zdroje.",
			"start.with.stop.on.entry": "Spustit ladění a zastavit na vstupu",
			"timeouts.generalDescription": "Časové limity pro několik operací ladicího programu",
			"timeouts.generalDescription.markdown": "Časové limity pro několik operací ladicího programu",
			"timeouts.sourceMaps.description": "Časové limity související s operacemi mapování zdroje",
			"timeouts.sourceMaps.sourceMapCumulativePause.description": "Doba navíc (v milisekundách) povolená pro relaci, po kterou je možné čekat na zpracování mapování zdroje po vyčerpání minimální doby (sourceMapMinPause)",
			"timeouts.sourceMaps.sourceMapMinPause.description": "Minimální doba (v milisekundách) strávená čekáním na zpracování jednotlivých mapování zdroje při parsování skriptu",
			"toggle.skipping.this.file": "Přepnout možnost přeskočení tohoto souboru",
			"trace.boolean.description": "Trasování lze nastavit na hodnotu true pro zápis diagnostických protokolů na disk.",
			"trace.console.description": "Konfiguruje, jestli jsou protokoly vraceny také do konzoly ladění.",
			"trace.description": "Konfiguruje, jaký diagnostický výstup je vytvořen.",
			"trace.level.description": "Určuje úroveň zaznamenaných protokolů.",
			"trace.logFile.description": "Určuje, kam jsou na disku zapisovány protokoly.",
			"trace.stdio.description": "Určuje, jestli se mají vrátit data trasování ze spuštěné aplikace nebo prohlížeče.",
			"trace.tags.description": "Konfiguruje, jaké typy protokolů jsou zaznamenávány."
		},
		"/src/binder": {
			"breakpoint.provisionalBreakpoint": "Nevázaná zarážka"
		},
		"/src/debugServer": {
			"breakpoint.provisionalBreakpoint": "Nevázaná zarážka"
		},
		"/src/vsDebugServer": {
			"session.rootSessionName": "Adaptér ladění JavaScriptu"
		},
		"/src/adapter/customBreakpoints": {
			"breakpoint.webglErrorNamed": "Chyba WebGL {0}",
			"breakpoint.webglErrorNamedDetails": "Pozastaveno na zarážce instrumentace chyby WebGL. Chyba: {0}",
			"breakpoint.cspViolationNamed": "Porušení zásad zabezpečení obsahu (CSP) {0}",
			"breakpoint.cspViolationNamedDetails": "Pozastaveno na zarážce instrumentace porušení zásad zabezpečení obsahu (CSP), direktiva {0}",
			"breakpoint.instrumentationNamed": "Pozastaveno na zarážce instrumentace {0}",
			"breakpoint.eventListenerNamed": "Pozastaveno na zarážce naslouchacího procesu události {0}, vyvoláno na {1}",
			"breakpoint.requestAnimationFrame": "Požádat o snímek animace",
			"breakpoint.cancelAnimationFrame": "Zrušit snímek animace",
			"breakpoint.animationFrameFired": "Vyvolán snímek animace",
			"breakpoint.createCanvasContext": "Vytvořit kontext plátna",
			"breakpoint.webglErrorFired": "Vyvolána chyba WebGL",
			"breakpoint.webglWarningFired": "Vyvoláno upozornění WebGL",
			"breakpoint.scriptFirstStatement": "První příkaz skriptu",
			"breakpoint.cspViolation": "Skript zablokován zásadami zabezpečení obsahu",
			"breakpoint.setInnerHtml": "Nastavit innerHTML",
			"breakpoint.setTimeoutFired": "Vyvoláno setTimeout",
			"breakpoint.setIntervalFired": "Vyvoláno setInterval",
			"breakpoint.createAudioContext": "Vytvořit AudioContext",
			"breakpoint.closeAudioContext": "Zavřít AudioContext",
			"breakpoint.resumeAudioContext": "Obnovit AudioContext",
			"breakpoint.suspendAudioContext": "Pozastavit AudioContext"
		},
		"/src/adapter/debugAdapter": {
			"breakpoint.caughtExceptions": "Zachycené výjimky",
			"breakpoint.uncaughtExceptions": "Nezachycené výjimky",
			"`errors.setExceptionBreakpoints.async.failed`": "Nepovedlo se nakonfigurovat výjimky, pro které se má provést pozastavení. Důvod: {0}",
			"errors.unknown": "Neznámá chyba",
			"error.sourceNotFound": "Zdroj nenalezen",
			"error.sourceContentDidFail": "Nelze načíst zdrojový obsah.",
			"error.variableNotFound": "Proměnná se nenašla.",
			"error.threadNotFound": "Podproces nenalezen",
			"error.cannotPrettyPrint": "Nelze provést přehledný výpis."
		},
		"/src/adapter/sources": {
			"source.skipFiles": "Přeskočeno přes skipFiles"
		},
		"/src/adapter/stackTrace": {
			"scope.global": "Globální",
			"scope.local": "Místní",
			"scope.with": "Blok With",
			"scope.closure": "Uzavření",
			"scope.catch": "Blok catch",
			"scope.block": "Blok",
			"scope.script": "Skript",
			"scope.eval": "Vyhodnocení",
			"scope.module": "Modul",
			"scope.closureNamed": "Zavření ({0})",
			"smartStepSkipLabel": "Přeskočeno přes smartStep",
			"scope.returnValue": "Návratová hodnota"
		},
		"/src/adapter/threads": {
			"error.resumeDidFail": "Nelze pokračovat.",
			"error.pauseDidFail": "Nelze pozastavit.",
			"error.stepOverDidFail": "Nelze krokovat na další.",
			"error.stepInDidFail": "Nelze krokovat s vnořením.",
			"error.stepOutDidFail": "Nelze krokovat s vystoupením.",
			"error.stackFrameNotFound": "Blok zásobníku nebyl nalezen.",
			"error.evaluateOnAsyncStackFrame": "Nelze vyhodnotit v asynchronním bloku zásobníku.",
			"error.restartFrameAsync": "Nelze restartovat asynchronní blok zásobníku.",
			"reason.description.restart": "Pozastaveno na položce rámce",
			"error.threadNotPaused": "Podproces není pozastaven.",
			"error.threadNotPausedOnException": "Podproces není pozastaven při výjimce.",
			"error.evaluateDidFail": "Nelze vyhodnotit.",
			"pause.breakpoint": "Pozastaveno na zarážce",
			"pause.default": "Pozastaveno",
			"pause.assert": "Pozastaveno na kontrolním příkazu",
			"pause.debugCommand": "Pozastaveno při volání metody debug()",
			"pause.DomBreakpoint": "Pozastaveno na zarážce DOM",
			"pause.exception": "Pozastaveno na výjimce",
			"pause.promiseRejection": "Pozastaveno na zamítnutí příslibu",
			"pause.instrumentation": "Pozastaveno na zarážce instrumentace",
			"pause.xhr": "Pozastaveno na XMLHttpRequest nebo při načtení",
			"pause.oom": "Pozastaveno před výjimkou při nedostatku paměti",
			"pause.eventListener": "Pozastaveno na naslouchacím procesu událostí",
			"warnings.handleSourceMapPause.didNotWait": "UPOZORNĚNÍ: Zpracování mapování zdroje {0} trvalo přes {1} ms, takže jsme pokračovali v provádění bez čekání na nastavení všech zarážek pro skript."
		},
		"/src/adapter/variables": {
			"error.variableNotFound": "Proměnná se nenašla.",
			"error.emptyExpression": "Nelze nastavit prázdnou hodnotu.",
			"error.invalidExpression": "Neplatný výraz",
			"error.setVariableDidFail": "Nelze nastavit hodnotu proměnné.",
			"error.unknown": "Neznámá chyba",
			"error.customValueDescriptionGeneratorFailed": "{0} (nepovedlo se popsat: {1})"
		},
		"/src/dap/errors": {
			"NVS_HOME.not.found.message": "Atribut runtimeVersion vyžaduje, aby byl nainstalován správce verzí Node.js nvs nebo nvm.",
			"NVM_HOME.not.found.message": "Atribut runtimeVersion vyžaduje správce verzí Node.js nvm-windows nebo nvs.",
			"runtime.version.not.found.message": "Node.js verze {0} není nainstalovaný pomocí správce verzí {1}.",
			"VSND2011": "Nelze spustit cíl ladění v terminálu ({0}).",
			"VSND2029": "Nelze načíst proměnné prostředí ze souboru ({0}).",
			"runtime.node.notfound": "Nelze najít binární soubor Node.js {0}: {1}. Zkontrolujte, že je Node.js nainstalovaný a je uveden v proměnné PATH, nebo nastavte runtimeExecutable v souboru launch.json.",
			"runtime.node.outdated": "Verze Node v „{0}“ je zastaralá (verze {1}). Je vyžadován Node 8.x nebo vyšší verze.",
			"invalidHitCondition": "Neplatná podmínka průchodu {0}. Očekává se výraz, například > 42 nebo == 2.",
			"profile.error.generic": "Při načítání profilu z cíle došlo k chybě.",
			"profile.error.concurrent": "Před spuštěním nového profilu prosím zastavte běžící profil.",
			"noBrowserInstallFound": "V systému nelze najít instalaci prohlížeče {0}. Zkuste ho nainstalovat nebo v souboru launch.json zadejte v parametru runtimeExecutable absolutní cestu k prohlížeči.",
			"browserVersionNotFound": "Nelze najít {0} verze {1}. Dostupné automaticky zjištěné verze: {2}. Jednu z těchto verzí můžete určit jako hodnotu parametru runtimeExecutable v souboru launch.json nebo můžete zadat absolutní cestu ke spustitelnému souboru prohlížeče.",
			"error.browserLaunchError": "Nelze spustit prohlížeč: {0}.",
			"error.browserAttachError": "Nelze připojit k prohlížeči.",
			"error.threadNotFound": "Cílová stránka nebyla nalezena. Možná budete muset aktualizovat nastavení urlFilter tak, aby odpovídalo stránce, kterou chcete ladit.",
			"asyncScopesNotAvailable": "Proměnné nejsou dostupné v asynchronních zásobnících.",
			"breakpointSyntaxError": "Chyba syntaxe při nastavování zarážky s podmínkou {0} na řádku {1}: {2}",
			"sourcemapParseError": "Nepovedlo se přečíst mapování zdroje pro {0}: {1}"
		},
		"/src/ui/autoAttach": {
			"details": "Podrobnosti"
		},
		"/src/ui/companionBrowserLaunch": {
			"cannotDebugInBrowser": "Prohlížeč odsud nemůžeme spustit v režimu ladění. Pokud chcete povolit ladění, otevřete tento pracovní prostor ve VS Code na počítači."
		},
		"/src/ui/debugLinkUI": {
			"debugLink.invalidUrl": "Zadaná adresa URL je neplatná.",
			"yes": "Ano",
			"never": "Nikdy",
			"debugLink.savePrompt": "Chcete si uložit konfiguraci do souboru launch.json, abyste k ní měli snadný přístup později?",
			"no": "Ne"
		},
		"/src/ui/debugNpmScript": {
			"debug.npm.noWorkspaceFolder": "Pokud chcete ladit skripty npm, musíte otevřít složku pracovního prostoru.",
			"debug.npm.parseError": "Nelze přečíst {0}: {1}",
			"debug.npm.noScripts": "Ve vašem souboru package.json nebyly nalezeny žádné skripty npm.",
			"debug.npm.notFound.open": "Upravit soubor package.json"
		},
		"/src/ui/debugTerminalUI": {
			"terminal.cwdpick": "Select current working directory for new terminal"
		},
		"/src/ui/diagnosticsUI": {
			"createDiagnostics.copied": "Cesta k diagnostické sestavě se zkopírovala do schránky."
		},
		"/src/ui/disableSourceMapUI": {
			"always": "Vždy",
			"yes": "Ano",
			"disableSourceMapUi.msg": "Jedná se o chybějící cestu k souboru, na kterou odkazuje sourcemap. Chcete místo toho ladit zkompilovanou verzi?",
			"no": "Ne"
		},
		"/src/ui/experimentEnlist": {
			"experimentEnlist": "Nový ladicí program můžete vypnout pomocí nastavení debug.javascript.usePreview. Nahlaste prosím všechny problémy, na které narazíte. Děkujeme za jeho vyzkoušení!"
		},
		"/src/ui/longPredictionUI": {
			"longPredictionWarning.message": "Konfigurace zarážek trvá delší dobu. Můžete ji urychlit aktualizací nastavení outFiles v souboru launch.json.",
			"longPredictionWarning.open": "Otevřít soubor launch.json",
			"longPredictionWarning.disable": "Znovu nezobrazovat",
			"longPredictionWarning.noFolder": "Není otevřená žádná složka pracovního prostoru."
		},
		"/src/ui/npmScriptLens": {
			"codelens.debug": "{0} – ladění"
		},
		"/src/ui/prettyPrint": {
			"yes": "Ano",
			"no": "Ne",
			"never": "Nikdy"
		},
		"/src/ui/processPicker": {
			"process.id.error": "Připojit k procesu: {0} nevypadá jako ID procesu.",
			"process.picker.error": "Výběr procesu selhal ({0})",
			"pickNodeProcess": "Vyberte proces node.js, ke kterému se má provést připojení.",
			"process.id.port.signal": "ID procesu: {0}, port ladění: {1} ({2})",
			"process.id.signal": "ID procesu: {0} ({1})",
			"cannot.enable.debug.mode.error": "Připojit k procesu: Nelze povolit režim ladění pro proces {0} ({1})."
		},
		"/src/ui/terminalLinkHandler": {
			"terminalLinkHover.debug": "Adresa URL ladění",
			"cantOpenChromeOnWeb": "Prohlížeč odsud nemůžeme spustit v režimu ladění. Pokud chcete ladit tuto webovou stránku, otevřete tento pracovní prostor z VS Code na počítači."
		},
		"/src/adapter/breakpoints/userDefinedBreakpoint": {
			"breakpoint.provisionalBreakpoint": "Nevázaná zarážka"
		},
		"/src/adapter/console/queryObjectsMessage": {
			"queryObject.invalidObject": "Dotazy lze zadávat pouze na objekty.",
			"queryObject.couldNotQuery": "Nepovedlo se zadat dotaz na zadaný objekt.",
			"queryObject.errorPreview": "Povedlo se vygenerovat náhled: {0}"
		},
		"/src/adapter/console/textualMessage": {
			"console.assert": "Kontrolní výraz selhal."
		},
		"/src/adapter/profiling/basicCpuProfiler": {
			"profile.cpu.label": "Profil CPU",
			"profile.cpu.description": "Vygeneruje soubor .cpuprofile, který můžete otevřít v Chrome DevTools."
		},
		"/src/targets/browser/browserAttacher": {
			"chrome.targets.placeholder": "Vyberte kartu.",
			"attach.cannotConnect": "Nelze se připojit k cíli: {0}: {1}"
		},
		"/src/targets/node/nodeAttacher": {
			"node.attach.restart.message": "Bylo ztraceno připojení k laděné součásti. Pokus o opětovné připojení bude proveden za {0} ms.\r\n"
		},
		"/src/targets/node/nodeBinaryProvider": {
			"runtime.node.notfound.enoent": "cesta neexistuje",
			"runtime.node.notfound.spawnErr": "chyba při získávání verze: {0}"
		},
		"/src/targets/node/terminalProgramLauncher": {
			"node.console.title": "Konzola ladění uzlů"
		},
		"/src/ui/configuration/chromiumDebugConfigurationProvider": {
			"existingBrowser.debugAnyway": "Přesto ladit",
			"existingBrowser.alert": "Vypadá to, že prohlížeč je již spuštěn z {0}. Před pokusem o ladění ho prosím zavřete, jinak by se k němu VS Code nemusel být schopen připojit.",
			"existingBrowser.location.default": "stará relace ladění",
			"existingBrowser.location.userDataDir": "nakonfigurovaný adresář userDataDir",
			"cancel": "Zrušit",
			"chrome.launch.name": "Spustit Chrome proti localhostu"
		},
		"/src/ui/configuration/nodeDebugConfigurationProvider": {
			"debug.terminal.label": "Vytvořit terminál pro ladění JavaScriptu",
			"node.launch.script": "Spustit skript: {0}",
			"node.launch.currentFile": "Spustit aktuální soubor"
		},
		"/src/ui/configuration/nodeDebugConfigurationResolver": {
			"program.not.found.message": "Nelze najít program k ladění.",
			"node.launch.config.name": "Spustit program",
			"mern.starter.explanation": "Spustit konfiguraci pro vytvořený projekt {0}",
			"program.guessed.from.package.json.explanation": "Spustit konfiguraci vytvořenou na základě souboru package.json",
			"outFiles.explanation": "Upravte vzory glob v atributu outFiles tak, aby pokrývaly vygenerovaný JavaScript."
		},
		"/src/ui/profiling/breakpointTerminationCondition": {
			"profile.termination.breakpoint.label": "Vybrat zarážku",
			"profile.termination.breakpoint.description": "Provádět, dokud nebude dosaženo konkrétní zarážky",
			"breakpointTerminationWarnSlow": "Profilování s povolenými zarážkami může změnit výkon vašeho kódu. Může být užitečné ověřit zjištěné výsledky pomocí podmínek ukončení duration (doba trvání) nebo manual (ručně).",
			"breakpointTerminationWarnConfirm": "OK"
		},
		"/src/ui/profiling/durationTerminationCondition": {
			"profile.termination.duration.label": "Doba trvání",
			"profile.termination.duration.description": "Provádět po konkrétní dobu",
			"profile.termination.duration.inputTitle": "Doba trvání profilu",
			"profile.termination.duration.placeholder": "Doba trvání profilu v sekundách, například 5",
			"profile.termination.duration.invalidFormat": "Zadejte prosím číslo.",
			"profile.termination.duration.invalidLength": "Zadejte prosím číslo větší než 1."
		},
		"/src/ui/profiling/manualTerminationCondition": {
			"profile.termination.duration.label": "Ručně",
			"profile.termination.duration.description": "Provádět do ručního zastavení"
		},
		"/src/ui/profiling/uiProfileManager": {
			"profile.sessionState": "Profilování",
			"profile.status.single": "$(loading) Kliknutím zastavíte profilování ({0}).",
			"profile.status.default": "$(loading) Kliknutím zastavíte profilování.",
			"profile.status.multiSession": "$(loading) Kliknutím zastavíte profilování (počet relací: {0}).",
			"yes": "Ano",
			"no": "Ne",
			"profile.alreadyRunning": "Relace profilování je už spuštěná. Chcete ji zastavit a spustit novou relaci?",
			"profile.type.title": "Typ profilu:",
			"profile.termination.title": "Jak dlouho má být profil spuštěn:"
		},
		"/src/ui/profiling/uiProfileSession": {
			"profile.saving": "Ukládání"
		}
	}
}