{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"package": {
			"description": "Poskytuje rozšířenou podporu jazyka pro soubory JSON.",
			"displayName": "JSON Language Features",
			"json.clickToRetry": "Click to retry.",
			"json.colorDecorators.enable.deprecationMessage": "Nastavení json.colorDecorators.enable je zastaralé. Místo něj se používá nastavení editor.colorDecorators.",
			"json.colorDecorators.enable.desc": "Povolí nebo zakáže dekoratéry barev.",
			"json.command.clearCache": "Clear schema cache",
			"json.enableSchemaDownload.desc": "Pokud je tato možnost povolená, schémata JSON se dají načíst z umístění HTTP a HTTPS.",
			"json.format.enable.desc": "Umožňuje povolit nebo zakázat výchozí formátovací modul JSON.",
			"json.format.keepLines.desc": "Při formátování zachovejte všechny existující nové řádky.",
			"json.maxItemsComputed.desc": "Maximální počet symbolů osnovy a vypočítaných oblastí sbalení (omezeno kvůli výkonu)",
			"json.maxItemsExceededInformation.desc": "Zobrazí oznámení při překročení maximálního počtu symbolů osnovy a oblastí sbalení.",
			"json.schemaResolutionErrorMessage": "Schéma nelze vyhodnotit.",
			"json.schemas.desc": "Přidružit schémata k souborům JSON v aktuálním projektu",
			"json.schemas.fileMatch.desc": "Pole hodnot vzorů souborů, které se používají k porovnávání při překladu souborů JSON na schémata. Znak „*“ lze použít jako zástupný znak. Můžete také definovat vzory vyloučení začínající symbolem „!“. Soubor se shoduje, když existuje minimálně jeden odpovídající vzor a poslední odpovídající vzor není vzorem vyloučení.",
			"json.schemas.fileMatch.item.desc": "Vzor souboru, který může obsahovat hvězdičku (*) a který umožňuje vyhledat shody při překladu souborů JSON na schémata.",
			"json.schemas.schema.desc": "Definice schématu pro danou adresu URL. Schéma musí být zadáno pouze proto, aby se zabránilo přístupu k adrese URL schématu.",
			"json.schemas.url.desc": "Adresa URL schématu nebo relativní cesta ke schématu v aktuálním adresáři",
			"json.tracing.desc": "Umožňuje sledovat komunikaci mezi VS Code a serverem jazyka JSON.",
			"json.validate.enable.desc": "Enable/disable JSON validation."
		}
	}
}