{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"A reload is required for the fetch setting change to take effect.": "Změna nastavení načítání se projeví až po opětovném načtení.",
			"Apple": "Apple",
			"Continue to GitHub": "Pokračovat na GitHub.",
			"Continue to GitHub to create a Personal Access Token (PAT)": "Pokračovat na GitHub a vytvořit osobní přístupový token (PAT).",
			"Copy & Continue to {0}": "Kopírovat a pokračovat na {0}",
			"GitHub": "GitHub",
			"GitHub Authentication - Reload required": "Ověření GitHubu – vyžaduje se opětovné načtení",
			"GitHub Enterprise Server URI is not a valid URI: {0}": "Identifikátor URI serveru GitHub Enterprise není platný identifikátor URI: {0}",
			"Google": "Google",
			"Having trouble logging in? Would you like to try a different way? ({0})": "Máte potíže s přihlášením? Chcete zkusit jiný způsob? ({0})",
			"No": "Ne",
			"Open [{0}]({0}) in a new tab and paste your one-time code: {1}/The [{0}]({0}) will be a url and the {1} will be a code, e.g. 123-456{Locked=\"[{0}]({0})\"}": "Otevřete [{0}]({0}) na nové kartě a vložte svůj jednorázový kód: {1}",
			"Reload Window": "Znovu načíst okno",
			"Sign in failed: {0}": "Přihlášení se nezdařilo: {0}",
			"Sign out failed: {0}": "Odhlášení se nezdařilo: {0}",
			"Signing in to {0}.../The {0} will be a url, e.g. github.com": "Přihlašujete se k {0}...",
			"To finish authenticating, navigate to GitHub and paste in the above one-time code.": "Ověřování dokončíte tak, že přejdete na GitHub a vložíte výše uvedený jednorázový kód.",
			"To finish authenticating, navigate to GitHub to create a PAT then paste the PAT into the input box.": "Pokud chcete dokončit ověřování, přejděte na GitHub, vytvořte PAT a vložte ho do vstupního pole.",
			"Yes": "Ano",
			"You have not yet finished authorizing this extension to use GitHub. Would you like to try a different way? ({0})": "Ještě jste nedokončili autorizaci tohoto rozšíření pro používání GitHubu. Chcete zkusit jiný způsob? ({0})",
			"Your Code: {0}/The {0} will be a code, e.g. 123-456": "Váš kód: {0}",
			"device code": "kód zařízení",
			"local server": "místní server",
			"personal access token": "token PAT",
			"url handler": "obslužná rutina adresy URL"
		},
		"package": {
			"config.github-authentication.preferDeviceCodeFlow.description": "Pokud je nastaveno na true, upřednostní se při ověřování tok s kódem zařízení před ostatními dostupnými toky. To je užitečné v prostředích, jako je WSL, kde místní server nebo toky zpracování adres URL nemusí fungovat podle očekávání.",
			"config.github-authentication.useElectronFetch.description": "Při hodnotě true se pro požadavky HTTP používá integrovaná funkce načítání od Společnosti Electron. Když je nastaveno na false, používá globální funkci fetch Node.js. Toto nastavení platí pouze při spuštění v prostředí Electron. **Poznámka:** Pro projev tohoto nastavení je nutné restartovat počítač.",
			"config.github-enterprise.title": "ověřování serveru GHE.com & GitHub Enterprise",
			"config.github-enterprise.uri.description": "Identifikátor URI pro instanci GHE.com nebo GitHub Enterprise Serveru\r\n\r\nPříklady:\r\n* GHE.com: 'https://octocat.ghe.com`\r\n* GitHub Enterprise Server: 'https://github.octocat.com`\r\n\r\n> **Poznámka:** Tato hodnota by _neměla_ být nastavena na identifikátor URI GitHub.com. Pokud váš účet existuje na GitHub.com nebo je GitHub Enterprise spravovaný uživatel, nepotřebujete žádnou další konfiguraci a můžete se jednoduše přihlásit ke GitHubu.",
			"description": "Zprostředkovatel ověřování GitHubu",
			"displayName": "Ověřování GitHubu"
		}
	}
}