{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Data URLs are not a valid image source.": "Adresy URL dat nepředstavují platný zdroj obrázků.",
			"Embedded SVGs are not a valid image source.": "Vložené soubory SVG nepředstavují platný zdroj obrázků.",
			"Error parsing the when-clause:": "Při analýze klauzule „when“ došlo k chybě:",
			"Images must use the HTTPS protocol.": "Obrázky musí používat protokol HTTPS.",
			"Language specific editor settings": "Nastavení editoru specifická pro daný jazyk",
			"Override editor settings for language": "Přepsat nastavení editoru pro daný jazyk",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Relativní adresy URL odznáčků vyžadují úložiště s protokolem HTTPS uvedené v tomto souboru package.json.",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Relativní adresy URL obrázků vyžadují úložiště s protokolem HTTPS uvedené v tomto souboru package.json.",
			"Remove activation event": "Odebrat aktivační událost",
			"SVGs are not a valid image source.": "Obrázky SVG nepředstavují platný zdroj obrázků.",
			"This activation event can be removed as VS Code generates these automatically from your package.json contribution declarations.": "Tuto aktivační událost můžete odebrat, protože VS Code je automaticky generuje z deklarací příspěvku package.json.",
			"This activation event can be removed for extensions targeting engine version ^1.75 as VS Code will generate these automatically from your package.json contribution declarations.": "Tuto aktivační událost je možné odebrat pro rozšíření, která cílí na verzi modulu ^1.75, protože VS Code je automaticky vygeneruje z deklarací příspěvku package.json.",
			"This activation event cannot be explicitly listed by your extension.": "Tuto aktivační událost nemůže vaše rozšíření explicitně uvést.",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Tento návrh nejde použít, protože produkt definuje pro toto rozšíření pevnou sadu návrhů rozhraní API. Rozšíření můžete otestovat, ale před publikováním se MUSÍTE spojit s týmem VS Code.",
			"Using '*' activation is usually a bad idea as it impacts performance.": "Použití aktivace * je obvykle špatný nápad, protože ovlivňuje výkon."
		},
		"package": {
			"description": "Poskytuje možnosti lintování pro vytváření rozšíření.",
			"displayName": "Vytváření rozšíření"
		}
	}
}