{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Cannot validate since a PHP installation could not be found. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "Nelze provést ověřování, protože instalace PHP nebyla nalezena. Pomocí nastavení php.validate.executablePath nakonfigurujte spustitelný soubor PHP.",
			"Cannot validate since no PHP executable is set. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "Nelze ověřit, protože není nastaven žádný spustitelný soubor PHP. Nakonfigurujte spustitelný soubor PHP pomocí nastavení php.validate.executablePath.",
			"Cannot validate since {0} is not a valid php executable. Use the setting 'php.validate.executablePath' to configure the PHP executable.": "Nelze ověřit, protože {0} není platný spustitelný soubor php. Nakonfigurujte spustitelný soubor PHP pomocí nastavení php.validate.executablePath.",
			"Failed to run php using path: {0}. Reason is unknown.": "Nepodařilo se spustit soubor php pomocí cesty {0}. Důvod je neznámý.",
			"Open Settings": "Otevřít nastavení"
		},
		"package": {
			"command.untrustValidationExecutable": "Zakázat spustitelný soubor pro ověření PHP (definováno jako nastavení pracovního prostoru)",
			"commands.categroy.php": "PHP",
			"configuration.suggest.basic": "Určuje, jestli jsou povoleny integrované návrhy jazyka PHP. Podpora nabízí návrhy globálních hodnot a proměnných PHP.",
			"configuration.title": "PHP",
			"configuration.validate.enable": "Umožňuje povolit nebo zakázat integrované ověřování PHP.",
			"configuration.validate.executablePath": "Odkazuje na spustitelný soubor PHP.",
			"configuration.validate.run": "Určuje, jestli se linter spustí při uložení nebo při psaní.",
			"description": "Poskytuje rozšířenou podporu jazyka pro soubory PHP.",
			"displayName": "Funkce jazyka PHP",
			"workspaceTrust": "Rozšíření vyžaduje vztah důvěryhodnosti pracovního prostoru, když nastavení php.validate.executablePath načte verzi PHP v pracovním prostoru."
		}
	}
}