{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"An icon requires a repository with HTTPS protocol to be specified in this package.json.": "Այս պատկերակի համար դուք պետք է նշեք փաթեթի ֆայլում:json պահոց, որի մուտքն իրականացվում է HTTPS արձանագրության միջոցով:",
			"Data URLs are not a valid image source.": "Տվյալների URL-ները պատկերների վավեր աղբյուր չեն:",
			"Embedded SVGs are not a valid image source.": "Ներկառուցված SVG ֆայլերը պատկերների վավեր աղբյուր չեն:",
			"Images must use the HTTPS protocol.": "Պատկերները պետք է օգտագործեն HTTPS արձանագրությունը:",
			"Language specific editor settings": "Լեզվով սահմանված խմբագրի ընտրանքները",
			"Override editor settings for language": "Վերացնել խմբագրի ընտրանքները լեզվի համար",
			"Relative badge URLs require a repository with HTTPS protocol to be specified in this package.json.": "Emblem-ի հարաբերական URL-ները օգտագործելու համար դուք պետք է նշեք փաթեթի ֆայլում:json պահոց, որի մուտքն իրականացվում է HTTPS արձանագրության միջոցով: ",
			"Relative image URLs require a repository with HTTPS protocol to be specified in the package.json.": "Հարաբերական պատկերի URL-ները օգտագործելու համար դուք պետք է նշեք փաթեթի ֆայլում:json պահոց, որի մուտքն իրականացվում է HTTPS արձանագրության միջոցով:",
			"SVGs are not a valid image source.": "SVG ֆայլերը պատկերների վավեր աղբյուր չեն:",
			"This activation event cannot be explicitly listed by your extension.": "Այս ակտիվացման իրադարձությունը չի կարող հստակ թվարկվել Ձեր ընդլայնման կողմից:",
			"This proposal cannot be used because for this extension the product defines a fixed set of API proposals. You can test your extension but before publishing you MUST reach out to the VS Code team.": "Այս առաջարկը հնարավոր չէ օգտագործել, քանի որ արտադրանքը այս ընդլայնման համար սահմանում է API առաջարկների ֆիքսված շարք: Կարող եք փորձարկել ընդլայնումը, բայց Փակցնելուց առաջ անհրաժեշտ է կապվել VS Code թիմի հետ:"
		},
		"package": {
			"description": "Ընդարձակումներ մշակելու համար ապահովում է ժանրի առանձնահատկություններ:",
			"displayName": "Ընդլայնման մշակում"
		}
	}
}