{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"Example": "Օրինակ",
			"Files by Extension": "Ֆայլեր ըստ ընդլայնման",
			"Files with Extension": "Ֆայլեր ընդլայնմամբ",
			"Files with Multiple Extensions": "Բազմաթիվ ընդլայնումներով ֆայլեր",
			"Files with Path": "Ֆայլեր ճանապարհով",
			"Files with Siblings by Name": "Ֆայլեր նույն մակարդակի տարրերով անունով",
			"Folder by Name (Any Location)": "Թղթապանակ անունով (ցանկացած վայր)",
			"Folder by Name (Top Level)": "Թղթապանակ անունով (վերին մակարդակ)",
			"Folders with Multiple Names (Top Level)": "Բազմաթիվ անունների պանակներ (վերին մակարդակ)",
			"Map all files matching the absolute path glob pattern in their path to the language with the given identifier.": "Քարտեզագրեք բոլոր ֆայլերը, որոնք համապատասխանում են ստանդարտ դիմակին բացարձակ ճանապարհով, նշված ID-ով լեզվին:",
			"Map all files matching the glob pattern in their filename to the language with the given identifier.": "Համապատասխանեցրեք բոլոր ֆայլերը, որոնք համապատասխանում են ֆայլի անվան ստանդարտ դիմակին, նշված ID-ով լեզվին:",
			"Match a folder with a specific name in any location.": "Թղթապանակը քարտեզագրելով որոշակի անունով ցանկացած վայրում:",
			"Match a top level folder with a specific name.": "Վերին մակարդակի թղթապանակի քարտեզագրում որոշակի անունով:",
			"Match all files of a specific file extension.": "Քարտեզագրելով բոլոր ֆայլերը որոշակի ընդլայնմամբ:",
			"Match all files with any of the file extensions.": "Քարտեզագրեք բոլոր ֆայլերը ֆայլի ընդլայնումներից որևէ մեկի հետ:",
			"Match files that have siblings with the same name but a different extension.": "Ֆայլերի քարտեզագրում peer-to-peer տարրերով նույն անունով, բայց տարբեր ընդլայնումներով:",
			"Match multiple top level folders.": "Վերին մակարդակի բազմաթիվ պանակների քարտեզագրում:",
			"The character used by the operating system to separate components in file paths": "Նիշ, որն օգտագործվում է օպերացիոն համակարգի կողմից ՝ ֆայլերի ուղիներում բաղադրիչներն առանձնացնելու համար:",
			"The current opened file": "Ընթացիկ բաց ֆայլ",
			"The current opened file relative to ${workspaceFolder}": "Ընթացիկ բաց ֆայլը ${workspaceFolder} - ի համեմատ",
			"The current opened file's basename": "Ընթացիկ բաց ֆայլի հիմնական անունը",
			"The current opened file's basename with no file extension": "Ընթացիկ բաց ֆայլի հիմնական անունն առանց ընդլայնման",
			"The current opened file's dirname": "Ընթացիկ բաց ֆայլի գրացուցակի անվանումը",
			"The current opened file's dirname relative to ${workspaceFolder}": "Ընթացիկ բաց ֆայլի գրացուցակի անվանումը ${workspaceFolder} - ի նկատմամբ",
			"The current opened file's extension": "Ընթացիկ բաց ֆայլի ընդլայնում",
			"The current selected line number in the active file": "Ընթացիկ ընտրված տողի համարը ակտիվ ֆայլում",
			"The current selected text in the active file": "Ընթացիկ ընտրված տեքստը ակտիվ ֆայլում ",
			"The name of the default build task. If there is not a single default build task then a quick pick is shown to choose the build task.": "Կառուցեք առաջադրանքի լռելյայն անվանումը: Եթե կառուցման լռելյայն առաջադրանքները բացակայում են, արագ ընտրության ընտրացանկը ցուցադրվում է ՝ կառուցման առաջադրանքը ընտրելու համար:",
			"The name of the folder opened in VS Code without any slashes (/)": "VS կոդով բացված թղթապանակի անունը ՝ առանց որևէ կտրվածքի (/)",
			"The path of the folder opened in VS Code": "Թղթապանակի ուղին բաց է VS կոդով",
			"The path where an an extension is installed.": "Ուղին, որով տեղադրված է ընդլայնումը:",
			"The task runner's current working directory on startup": "Գործարկման առաջադրանքի գործարկման ընթացիկ աշխատանքային գրացուցակը",
			"Use the language of the currently active text editor if any": "Օգտագործեք ակտիվ տեքստի խմբագրի լեզուն, եթե այդպիսիք կան",
			"a conditional separator (' - ') that only shows when surrounded by variables with values": "պայմանական բաժանարար ( - ), որը ցուցադրվում է միայն այն դեպքում, եթե շրջապատված է արժեքներով փոփոխականներով",
			"an indicator for when the active editor has unsaved changes": "նշում է, երբ ակտիվ խմբագրում կան չպահված փոփոխություններ",
			"e.g. SSH": "օրինակ ՝ SSH",
			"e.g. VS Code": "օրինակ ՝ VS Code",
			"file path of the workspace (e.g. /Users/Development/myWorkspace)": "ուղի դեպի աշխատանքային տարածք (օրինակ ՝ / Users/Development/myWorkspace)",
			"file path of the workspace folder the file is contained in (e.g. /Users/Development/myFolder)": "աշխատանքային տարածքի թղթապանակի ուղին, որը պարունակում է ֆայլը (օրինակ ՝ / Users/Development/myFolder)",
			"name of the workspace folder the file is contained in (e.g. myFolder)": "աշխատանքային տարածքի թղթապանակի անունը, որը պարունակում է ֆայլը (օրինակ ՝ myFolder)",
			"name of the workspace with optional remote name and workspace indicator if applicable (e.g. myFolder, myRemoteFolder [SSH] or myWorkspace (Workspace))": "աշխատանքային տարածքի անվանումը ընտրովի հեռավոր անունով և աշխատանքային տարածքի ցուցիչով, եթե կիրառելի է (օրինակ ՝ myFolder, myRemoteFolder [SSH] կամ myWorkspace (workspace))",
			"shortened name of the workspace without suffixes (e.g. myFolder or myWorkspace)": "կրճատված աշխատանքային տարածքի անուն ՝ առանց վերջածանցների (օրինակ ՝ myFolder կամ myWorkspace)",
			"the file name (e.g. myFile.txt)": "ֆայլի անունը (օրինակ ՝ myFile.txt)",
			"the full path of the file (e.g. /Users/Development/myFolder/myFileFolder/myFile.txt)": "ֆայլի ամբողջական ուղին (օրինակ ՝ / Users/Development/myFolder/myFileFolder / myFile.txt)",
			"the full path of the folder the file is contained in (e.g. /Users/Development/myFolder/myFileFolder)": "թղթապանակի ամբողջական ուղին, որտեղ գտնվում է ֆայլը (օրինակ ՝ / Users/Development/myFolder / myFileFolder)",
			"the name of the folder the file is contained in (e.g. myFileFolder)": "թղթապանակի անունը, որտեղ գտնվում է ֆայլը (օրինակ ՝ myFileFolder)",
			"the path of the file relative to the workspace folder (e.g. myFolder/myFileFolder/myFile.txt)": "ֆայլի ուղին ՝ կապված աշխատանքային տարածքի թղթապանակի հետ (օրինակ ՝ myFolder / myFileFolder / myFile.txt)",
			"the path of the folder the file is contained in, relative to the workspace folder (e.g. myFolder/myFileFolder)": "թղթապանակի ուղին, որտեղ գտնվում է ֆայլը, համեմատած աշխատանքային տարածքի թղթապանակի հետ (օրինակ ՝ myFolder / myFileFolder)"
		},
		"package": {
			"description": "Ապահովում է առանձնահատկություններ (ինչպիսիք են IntelliSense-ը և ավտոմատ շտկումը) կազմաձևման ֆայլերի համար, ինչպիսիք են պարամետրերի ֆայլերը, գործարկման ֆայլերը և ընդարձակման առաջարկությունների ֆայլերը:",
			"displayName": "Կազմաձևման փոփոխություն"
		}
	}
}