{
	"": [
		"--------------------------------------------------------------------------------------------",
		"Copyright (c) Microsoft Corporation. All rights reserved.",
		"Licensed under the MIT License. See License.txt in the project root for license information.",
		"--------------------------------------------------------------------------------------------",
		"Do not edit this file. It is machine generated."
	],
	"version": "1.0.0",
	"contents": {
		"bundle": {
			"\"store\" a boolean test for later evaluation in a guard or if().": "\"խանութ\" - տրամաբանական թեստ ' հետագա գնահատման համար guard կամ if () գործառույթում:",
			"'from' expected": "սպասվում Է \"from\"",
			"'in' expected": "Սպասվում է \"ներս\"",
			"'through' or 'to' expected": "Պահանջվում է\" միջոցով \"կամ\"դեպի\"",
			"'{0}'": "\"{0}\"",
			"( expected": "(սպասվում է",
			") expected": "Սպասվում է \")\"",
			"@font-face": "@font-face",
			"@font-face rule must define 'src' and 'font-family' properties": "@Font-face Կանոնում պետք է սահմանվեն \"src\" և \"font-family\"հատկությունները:",
			"@keyframes {0}": "@keyframes {0}",
			"A list of properties that are not validated against the `unknownProperties` rule.": "Հատկությունների ցուցակ, որոնց համար \"unknownProperties\" կանոնը չի ստուգվում: ",
			"Adds quotes to a string.": "Տողի վրա չակերտներ է ավելացնում:",
			"Also define the standard property '{0}' for compatibility": "Համատեղելիության համար սահմանեք նաև \"{0} \" ստանդարտ հատկությունը",
			"Always define standard rule '@keyframes' when defining keyframes.": "Միշտ սահմանել ստանդարտ կանոն \"@keyframes\", երբ սահմանելիս աջակցության շրջանակները.",
			"Always include all vendor specific properties: Missing: {0}": "Միշտ Ներառեք մատակարարի բոլոր հատկությունները. բացակայում է՝ {0}",
			"Always include all vendor specific rules: Missing: {0}": "Միշտ Ներառեք մատակարարի կողմից սահմանված բոլոր կանոնները. բացակայում է: {0}",
			"Appends a single value onto the end of a list.": "Ցուցակի վերջում ավելացնում է մեկ արժեք:",
			"Appends selectors to one another without spaces in between.": "Ընտրիչներ է ավելացնում միմյանց՝ առանց դրանց միջև տարածությունների:",
			"Avoid using !important. It is an indication that the specificity of the entire CSS has gotten out of control and needs to be refactored.": "Փորձեք չօգտագործել :կարևոր, քանի որ դա ցույց է տալիս, որ CSS-ի ամբողջ ծածկագիրը դարձել է անկառավարելի և պետք է վերամշակվի:",
			"Avoid using 'float'. Floats lead to fragile CSS that is easy to break if one aspect of the layout changes.": "Փորձեք չօգտագործել \"float\" տարրերը: \"Float\" տարրերը կարող են կոտրել CSS ծածկագիրը, Եթե փոխեք նշագրման ասպեկտներից մեկը:",
			"CSS Language Server": "CSS լեզվի սերվեր",
			"CSS fix is outdated and can\\'t be applied to the document.": "CSS-ի ուղղումը հնացած է և չի կարող կիրառվել փաստաթղթի վրա:",
			"Causes one or more rules to be emitted at the root of the document.": "Առաջացնում է փաստաթղթի արմատում մեկ կամ մի քանի կանոնների ստեղծում:",
			"Changes one or more properties of a color.": "Փոխում է գույնի մեկ կամ մի քանի հատկություններ:",
			"Changes the alpha component for a color.": "Փոխում է ալֆա բաղադրիչը գույնի համար:",
			"Changes the hue of a color.": "Փոխում է գույնի երանգը:",
			"Combines several lists into a single multidimensional list.": "Միավորում է բազմաթիվ ցուցակներ մեկ բազմաչափ ցուցակի մեջ:",
			"Converts a color into the format understood by IE filters.": "Գույնը վերածում է ձևաչափի, որը հասկանալի է IE ֆիլտրերի համար:",
			"Converts a color to grayscale.": "Գույնը վերածում է մոխրագույնի:",
			"Converts a string to lower case.": "Տողը վերածում է փոքրատառի:",
			"Converts a string to upper case.": "Տողը վերածում է մեծատառի:",
			"Converts a unitless number to a percentage.": "Առանց միավորների թիվը վերածում է տոկոսային արժեքի:",
			"Creates a Color from hue, saturation, and lightness values.": "Ստեղծում է գույն՝ հիմնվելով երանգի, հագեցվածության և լուսավորության արժեքների վրա:",
			"Creates a Color from hue, saturation, lightness, and alpha values.": "Ստեղծում է գույն՝ հիմնվելով երանգի արժեքների, հագեցվածության, լուսավորության և ալֆա գործոնների վրա:",
			"Creates a Color from hue, white and black.": "Գույն է ստեղծում երանգից՝ Սպիտակ և Սև:",
			"Creates a Color from red, green, and blue values.": "Ստեղծում է գույն կարմիր, կանաչ և կապույտ արժեքներից:",
			"Creates a Color from red, green, blue, and alpha values.": "Ստեղծում է գույն կարմիր, կանաչ, կապույտ և ալֆա արժեքներից:",
			"Defines complex operations that can be re-used throughout stylesheets.": "Սահմանում է բարդ գործողություններ, որոնք կարող են կրկին օգտագործվել բոլոր ոճաթերթերում:",
			"Defines styles that can be re-used throughout the stylesheet with `@include`.": "Սահմանում է այն ոճերը, որոնք կարող են կրկին օգտագործվել ամբողջ ոճաթերթում՝ օգտագործելով \"@include \" տարբերակը:",
			"Do not use duplicate style definitions": "Մի օգտագործեք կրկնօրինակ ոճի սահմանումներ:",
			"Do not use empty rulesets": "Մի օգտագործեք դատարկ կանոնների հավաքածուներ",
			"Do not use width or height when using padding or border": "Լրացրեք կամ եզրագիծ օգտագործելիս մի օգտագործեք լայնություն կամ height",
			"Dynamically calls a Sass function.": "Դինամիկ կերպով կանչում է Sass գործառույթը:",
			"Each loop that sets `$var` to each item in the list or map, then outputs the styles it contains using that value of `$var`.": "Յուրաքանչյուր հանգույց, որը կարգավորում է\" $var \"ցուցակի կամ քարտեզագրման յուրաքանչյուր կետի համար, այնուհետև դուրս է բերում իր պարունակած ոճերը՝ օգտագործելով\"$var \" արժեքը:",
			"Exposes the details of Sass’s inner workings.": "Disուցադրում է Sass-ի ներքին աշխատանքի մանրամասները:",
			"Extends $extendee with $extender within $selector.": "$Extendee ընդլայնում $extender - ից $selector:",
			"Extracts a substring from $string.": "$ String-ից հանում է ենթաշերտը:",
			"Failed to apply CSS fix to the document. Please consider opening an issue with steps to reproduce.": "Չհաջողվեց կիրառել CSS-ի ուղղումը փաստաթղթի վրա: Մտածեք հարցը բացելու մասին՝ նվագարկման հրահանգներով:",
			"Finds the maximum of several numbers.": "Գտնում է մի քանի թվերի առավելագույնը:",
			"Finds the minimum of several numbers.": "Գտնում է մի քանի թվերի նվազագույնը:",
			"Fluidly scales one or more properties of a color.": "Սահուն սանդղակում է մեկ կամ մի քանի գունային հատկություններ:",
			"Folding Region End": "Ծալման տարածքի ավարտը",
			"Folding Region Start": "Փլուզվող շրջանի սկիզբը",
			"For loop that repeatedly outputs a set of styles for each `$var` in the `from/through` or `from/to` clause.": "Համար հանգույց, որը կրկին դուրս է բերում յուրաքանչյուր \"$var \"- ի համար մի շարք ոճեր \"from/through\" կամ \"from/to\" նախադասություններում:",
			"Generates new colors based on existing ones, making it easy to build color themes.": "Գոյություն ունեցող գույների հիման վրա ստեղծում է նոր գույներ՝ հեշտացնելով գունային թեմաների հավաքումը:",
			"Gets the blue component of a color.": "Ստանում է գույնի կապույտ բաղադրիչ:",
			"Gets the green component of a color.": "Ստանում է գույնի կանաչ բաղադրիչ:",
			"Gets the hue component of a color.": "Ստանում է գույնի կապույտ բաղադրիչ:",
			"Gets the lightness component of a color.": "Ստանում է գույնի լուսավորության բաղադրիչ:",
			"Gets the opacity component of a color.": "Ստանում է գույնի անթափանցիկության բաղադրիչ:",
			"Gets the red component of a color.": "Ստանում է գույնի կարմիր բաղադրիչ:",
			"Gets the saturation component of a color.": "Ստանում է գույնի հագեցվածության բաղադրիչ:",
			"Hex colors must consist of three, four, six or eight hex numbers": "Hexadecimal գույները պետք է լինեն երեք, չորս, վեց կամ ութ hexadecimal թվեր:",
			"IE hacks are only necessary when supporting IE7 and older": "Internet Explorer-ի օգտակար խորհուրդները պահանջվում են միայն Internet Explorer 7-ի և ավելի վաղ տարբերակների աջակցությամբ",
			"Import statements do not load in parallel": "Ներմուծման հայտարարությունները զուգահեռ չեն բեռնվում",
			"Includes the body if the expression does not evaluate to `false` or `null`.": "Ներառում է հաղորդագրության տեքստը, եթե արտահայտությունը չունի \"կեղծ\" կամ \"զրո\" արժեք:",
			"Includes the styles defined by another mixin into the current rule.": "Ներկայիս Կանոնում ներառում է այլ կեղտով սահմանված ոճեր:",
			"Increases or decreases one or more components of a color.": "Մեծացնում կամ նվազեցնում է գույնի մեկ կամ մի քանի բաղադրիչ:",
			"Inherits the styles of another selector.": "Ժառանգում է մեկ այլ ընտրողի ոճերը:",
			"Inserts $insert into $string at $index.": "Տեղադրում է $insert - ը $string-ում $index-ում:",
			"Invalid number of parameters": "Պարամետրերի սխալ քանակը",
			"Joins together two lists into one.": "Միավորում է երկու ցուցակ մեկի մեջ:",
			"Lets you access and modify values in lists.": "Թույլ է տալիս մուտք գործել և փոխել արժեքները ցուցակներում:",
			"Loads a Sass stylesheet and makes its mixins, functions, and variables available when this stylesheet is loaded with the @use rule.": "Բեռնում է Sass ոճաթերթը և հասանելի է դարձնում դրա կեղտերը, գործառույթները և փոփոխականները, երբ այս ոճաթերթը բեռնվում է @use կանոնի միջոցով:",
			"Loads mixins, functions, and variables from other Sass stylesheets as 'modules', and combines CSS from multiple stylesheets together.": "Բեռնում է կեղտերը, գործառույթները և փոփոխականները Sass-ի այլ ոճաթերթերից որպես \"մոդուլներ\" և միավորում է CSS-ը բազմաթիվ ոճաթերթերից միասին:",
			"Makes a color darker.": "Գույնը դարձնում է ավելի մուգ:",
			"Makes a color less saturated.": "Գույնը դարձնում է ավելի քիչ հագեցած:",
			"Makes a color lighter.": "Գույնը թեթեւացնում է:",
			"Makes a color more opaque.": "Մեծացնում է գույնի անթափանցիկությունը:",
			"Makes a color more saturated.": "Գույնը դարձնում է ավելի հագեցած:",
			"Makes a color more transparent.": "Գույնը դարձնում է ավելի թափանցիկ:",
			"Makes it easy to combine, search, or split apart strings.": "Թույլ է տալիս հեշտությամբ միավորել, որոնել և բաժանել տողերը:",
			"Makes it possible to look up the value associated with a key in a map, and much more.": "Թույլ է տալիս որոնել քարտեզի վրա ստեղնի հետ կապված արժեքը և ավելին:",
			"Merges two maps together into a new map.": "Երկու քարտերը համատեղում է նոր քարտի մեջ:",
			"Mixes two colors together.": "Խառնում է երկու գույները:",
			"Nests selector beneath one another like they would be nested in the stylesheet.": "Ընտրիչները դնում է միմյանց տակ, կարծես դրանք տեղադրված են ոճաթերթում:",
			"No unit for zero needed": "Զրոյի համար չափման միավոր չի պահանջվում",
			"Parses a selector into the format returned by &.": "Ընտրիչը վերափոխում է վերադարձված ձևաչափի &.",
			"Prints the value of an expression to the standard error output stream. Useful for debugging complicated Sass files.": "Տպում է արտահայտության արժեքը ստանդարտ սխալի ելքային հոսքի մեջ: Օգտակար է բարդ Sass ֆայլերը կարգաբերելու համար:",
			"Prints the value of an expression to the standard error output stream. Useful for libraries that need to warn users of deprecations or recovering from minor mixin usage mistakes. Warnings can be turned off with the `--quiet` command-line option or the `:quiet` Sass option.": "Տպում է արտահայտության արժեքը ստանդարտ սխալի ելքային հոսքի մեջ: Օգտակար է գրադարանների համար, որոնք պետք է նախազգուշացնեն օգտվողներին հնացման կամ վերականգնման մասին ' կեղտաջրերի օգտագործման աննշան սխալներից հետո: Նախազգուշացումները կարող են անջատվել՝ օգտագործելով \"--quiet\" հրամանի տողի տարբերակը կամ \":quiet\" Sass տարբերակը:",
			"Property is ignored due to the display.": "Գույքը անտեսվում է ցուցադրման պատճառով:",
			"Property is ignored due to the display. With 'display: block', vertical-align should not be used.": "Գույքը անտեսվում է ցուցադրման պատճառով: \"Display: block\" տարբերակով դուք չպետք է Օգտագործեք ուղղահայաց հավասարեցում:",
			"Provides access to Sass’s powerful selector engine.": "Ապահովում է մուտք դեպի հզոր Sass ընտրության կառավարիչ:",
			"Provides functions that operate on numbers.": "Ապահովում է գործառույթներ, որոնք աշխատում են թվերի հետ:",
			"Removes quotes from a string.": "Հեռացնում է չակերտները տողից:",
			"Rename to '{0}'": "Անունը փոխեք \" {0}\"",
			"Replaces $original with $replacement within $selector.": "$Բնօրինակը փոխարինում է $selector-ում $ replacement-ով:",
			"Replaces the nth item in a list.": "Փոխարինում է ցուցակի n-րդ կետը:",
			"Returns a list of all keys in a map.": "Վերադարձնում է քարտեզի բոլոր բանալիների ցուցակը:",
			"Returns a list of all values in a map.": "Վերադարձնում է քարտեզի բոլոր արժեքների ցուցակը:",
			"Returns a new map with keys removed.": "Վերադարձնում է նոր քարտ՝ ջնջված բանալիներով:",
			"Returns a random number.": "Վերադարձնում է պատահական թիվ:",
			"Returns a specific item in a list.": "Վերադարձնում է ցուցակի որոշակի տարր:",
			"Returns the absolute value of a number.": "Վերադարձնում է թվի բացարձակ արժեքը:",
			"Returns the complement of a color.": "Վերադարձնում է գույնի լրացում:",
			"Returns the index of the first occurance of $substring in $string.": "Վերադարձնում է $substring-ի առաջին դեպքի ինդեքսը $string-ին:",
			"Returns the inverse of a color.": "Վերադարձնում է հակառակ գույնը:",
			"Returns the keywords passed to a function that takes variable arguments.": "Վերադարձնում է փոփոխական փաստարկներ ընդունող գործառույթին փոխանցված հիմնաբառերը:",
			"Returns the length of a list.": "Վերադարձնում է ցուցակի երկարությունը:",
			"Returns the number of characters in a string.": "Վերադարձնում է տողի նիշերի քանակը:",
			"Returns the position of a value within a list.": "Վերադարձնում է արժեքի դիրքը ցուցակում:",
			"Returns the separator of a list.": "Վերադարձնում է ցուցակի բաժանարարը:",
			"Returns the simple selectors that comprise a compound selector.": "Վերադարձնում է պարզ ընտրիչներ, որոնք կազմում են կոմպոզիտային ընտրիչը:",
			"Returns the string representation of a value as it would be represented in Sass.": "Վերադարձնում է արժեքի լարային ներկայացում, քանի որ այն կներկայացվի Sass-ում:",
			"Returns the type of a value.": "Վերադարձնում է արժեքի տեսակը:",
			"Returns the unit(s) associated with a number.": "Վերադարձնում է թվի հետ կապված միավորները:",
			"Returns the value in a map associated with a given key.": "Վերադարձնում է արժեքը տվյալ ստեղնի հետ կապված քարտեզագրման մեջ:",
			"Returns whether $super matches all the elements $sub does, and possibly more.": "Վերադարձնում է, թե արդյոք $super-ը համապատասխանում է $sub-ի կատարած բոլոր տարրերին և, հնարավոր է, ավելին:",
			"Returns whether a feature exists in the current Sass runtime.": "Նշում է, թե արդյոք գործառույթը գոյություն ունի ընթացիկ Sass Runtime-ում:",
			"Returns whether a function with the given name exists.": "Պատմում է, թե արդյոք գոյություն ունի նշված անունով գործառույթ:",
			"Returns whether a map has a value associated with a given key.": "Պատմում է, թե արդյոք քարտը ունի տվյալ ստեղնի հետ կապված արժեք:",
			"Returns whether a mixin with the given name exists.": "Պատմում է, թե արդյոք գոյություն ունի նշված անունով խառնուրդ:",
			"Returns whether a number has units.": "Նշում է, թե արդյոք թիվը պարունակում է չափման միավորներ:",
			"Returns whether a variable with the given name exists in the current scope.": "Վերադարձնում է, թե արդյոք գոյություն ունի տվյալ անունով փոփոխական ընթացիկ տարածքում:",
			"Returns whether a variable with the given name exists in the global scope.": "Պատմում է, թե արդյոք տվյալ անունով փոփոխական գոյություն ունի գլոբալ տիրույթում:",
			"Returns whether two numbers can be added, subtracted, or compared.": "Վերադարձնում է, թե արդյոք երկու թվերը կարող են գումարվել, հանվել կամ համեմատվել:",
			"Rounds a number down to the previous whole number.": "Կլորացնում է թիվը նախորդ ամբողջ թվին:",
			"Rounds a number to the nearest whole number.": "Կլորացնում է թիվը մոտակա ամբողջ թվին:",
			"Rounds a number up to the next whole number.": "Կլորացնում է թիվը մինչև հաջորդ ամբողջ թիվը:",
			"Sass documentation": "Sass փաստաթղթեր",
			"Selectors should not contain IDs because these rules are too tightly coupled with the HTML.": "Ընտրողները չպետք է պարունակեն նույնացուցիչներ, քանի որ այդ կանոնները չափազանց սերտորեն կապված են HTML-ի հետ:",
			"The universal selector (*) is known to be slow": "Հայտնի է, որ համընդհանուր ընտրիչը (*) դանդաղ է",
			"Throws the value of an expression as a fatal error with stack trace. Useful for validating arguments to mixins and functions.": "Տալիս է արտահայտության արժեքը որպես ճակատագրական սխալ ' stack tracing - ով: Օգտակար է կեղտերի և գործառույթների փաստարկները ստուգելու համար:",
			"URI expected": "Սպասվում է URI",
			"URL encodes a string": "URL-ը կոդավորում է տողը",
			"Unifies two selectors to produce a selector that matches elements matched by both.": "Համատեղում է երկու ընտրիչ՝ ստեղծելու ընտրիչ, որը համապատասխանում է երկուսին էլ համապատասխանող տարրերին:",
			"Unknown at-rule.": "Անհայտ կանոն at.",
			"Unknown property.": "Անհայտ հատկություն:",
			"Unknown property: '{0}'": "Անհայտ հատկություն՝ ' {0}'",
			"Unknown vendor specific property.": "Մատակարարի անհայտ գույքը:",
			"When using a vendor-specific prefix also include the standard property": "Մատակարարի նախածանց օգտագործելիս նշեք նաև ստանդարտ հատկությունը",
			"When using a vendor-specific prefix make sure to also include all other vendor-specific properties": "Մատակարարի նախածանց օգտագործելիս նշեք նաև մատակարարի մնացած հատկությունները",
			"While loop that takes an expression and repeatedly outputs the nested styles until the statement evaluates to `false`.": "Մինչդեռ հանգույց, որն ընդունում է արտահայտությունը և բազմիցս դուրս է բերում բնադրված ոճերը, մինչև արտահայտությունը գնահատվի որպես \"կեղծ\":",
			"[ expected": "[սպասվում է",
			"[Selector Specificity](https://developer.mozilla.org/en-US/docs/Web/CSS/Specificity): ({0}, {1}, {2})": "[Ընտրողի առանձնահատկությունը](https://developer.mozilla.org/en-US/docs/Web/CSS/Specificity): ({0}, {1}, {2})",
			"] expected": "Սպասվում ]",
			"absolute value of a number": "թվի բացարձակ արժեքը",
			"arccosine - inverse of cosine function": "արկկոսինուս-կոսինուսի հակադարձ գործառույթ",
			"arcsine - inverse of sine function": "arxine-սինուսի հակադարձ գործառույթ",
			"arctangent - inverse of tangent function": "arctangent-տանգենտի հակադարձ գործառույթ",
			"argument from \\'{0}\\'": "փաստարկ \\'{0}\\ ' - ից",
			"at-rule or selector expected": "ակնկալվում է AT-rule օպերատոր կամ ընտրիչ",
			"at-rule unknown": "անհայտ at-rule օպերատոր",
			"bind the evaluation of a ruleset to each member of a list.": "կապել մի շարք կանոնների գնահատումը ցուցակի յուրաքանչյուր անդամի հետ:",
			"calculates square root of a number": "հաշվարկում է համարի քառակուսի արմատը",
			"colon expected": "սպասվում է հաստ աղիք",
			"comma expected": "սպասվում է ստորակետ",
			"condition expected": "պայմանը սպասվում է",
			"converts numbers from one type into another": "փոխակերպում է թվերը մի տեսակից մյուսը",
			"converts to a %, e.g. 0.5 > 50%": "փոխարկվում է % - ի, օրինակ՝ 0.5 &gt; 50%",
			"cosine function": "կոսինուսի գործառույթը",
			"creates a #AARRGGBB": "ստեղծում է #AARRGGBB",
			"creates a color": "ստեղծում է գույն",
			"dot expected": "սպասվում է կետ",
			"escape string content": "փախուստի տողի պարունակությունը",
			"expression expected": "ակնկալվում է արտահայտություն",
			"first argument modulus second argument": "առաջին փաստարկի մոդուլի երկրորդ փաստարկը",
			"first argument raised to the power of the second argument": "առաջին փաստարկը բարձրացվեց երկրորդ փաստարկի հզորության",
			"generate a list spanning a range of values": "Ստեղծեք ցուցակ, որն ընդգրկում է մի շարք արժեքներ",
			"identifier expected": "ID-ն սպասվում էր",
			"identifier or variable expected": "ակնկալվում է նույնացուցիչ կամ փոփոխական",
			"identifier or wildcard expected": "ակնկալվում է նույնացուցիչ կամ վայրի քարտ",
			"inline-block is ignored due to the float. If 'float' has a value other than 'none', the box is floated and 'display' is treated as 'block'": "ներկառուցված միավորը անտեսվում է շնորհիվ հետ լողացող կետի համարներ. Եթե \"float\" տարբերակը դրված է \"ոչ\" - ից բացի այլ արժեքի վրա, դաշտը կդառնա լողացող, իսկ \"display\" - ը կվերաբերվի որպես \"block\"",
			"inlines a resource and falls back to `url()`": "ներդնում է ռեսուրսը և վերադառնում է \"url ()\"",
			"media query expected": "ակնկալվում է մուլտիմեդիա հարցում",
			"number expected": "սպասվում է թիվ",
			"operator expected": "սպասվում է օպերատոր",
			"page directive or declaraton expected": "ակնկալվում է էջի հրահանգ կամ հայտարարագիր",
			"parses a string to a color": "վերլուծում է տողը ըստ գույնի",
			"percentage expected": "տոկոսը Սպասվում է",
			"property value expected": "գույքի արժեքը սպասվում է",
			"remove or change the unit of a dimension": "չափման միավորի հեռացում կամ փոփոխություն",
			"return `@color` 10% points darker": "վերադարձ \"@color\" - ը 10-ով ավելի մուգ է %",
			"return `@color` 10% points less saturated": "վերադարձ \"@color\"՝ 10% - ով Կրճատված հագեցվածությամբ",
			"return `@color` 10% points less transparent": "\"@color \" - ի վերադարձը 10% - ով պակաս թափանցիկ է",
			"return `@color` 10% points lighter": "\"@color\" վերադարձը 10% թեթև է",
			"return `@color` 10% points more saturated": "վերադարձ \"@color\"՝ 10% հագեցվածությամբ",
			"return `@color` 10% points more transparent": "վերադարձ \"@color\"՝ 10-ով Ավելացված թափանցիկությամբ%",
			"return `@color` with 50% transparency": "վերադարձեք \"@գույնը \" 50 թափանցիկությամբ%",
			"return `@color` with a 10 degree larger in hue": "վերադարձ \"@color\"՝ 10 աստիճանով Ավելացված երանգով",
			"return `@darkcolor` if `@color1 is> 43% luma` otherwise return `@lightcolor`, see notes": "վերադարձ \"@darkcolor\", եթե \"@color1 &gt; 43% luma\": Հակառակ դեպքում վերադարձը \"@lightcolor \" է: Տես նշումները",
			"return a mix of `@color1` and `@color2`": "վերադարձնում է \"@color1\" և \"@color2\"համադրությունը",
			"returns a grey, 100% desaturated color": "վերադարձնում է մոխրագույն, 100% չհագեցած գույն",
			"returns a value at the specified position in the list": "վերադարձնում է արժեքը նշված դիրքում ցուցակում",
			"returns one of two values depending on a condition.": "վերադարձնում է երկու արժեքներից մեկը՝ կախված պայմանից:",
			"returns pi": "վերադարձնում է Pi-ն",
			"returns the `alpha` channel of `@color`": "վերադարձնում է \"alpha\" ալիքը \"@color\" - ի համար",
			"returns the `blue` channel of `@color`": "վերադարձնում է \"blue\" ալիքը \"@color\" - ի համար",
			"returns the `green` channel of `@color`": "վերադարձնում է \"green\" ալիքը \"@color\"",
			"returns the `hue` channel of `@color` in the HSL space": "վերադարձնում է \"hue\" ալիքը HSL տարածքում \"@color\" - ի համար",
			"returns the `hue` channel of `@color` in the HSV space": "վերադարձնում է \"hue\" ալիքը HSV տարածքում \"@color\" - ի համար",
			"returns the `lightness` channel of `@color` in the HSL space": "վերադարձնում է \"lightness \" ալիքը \"@color\" - ի համար HSL տարածքում",
			"returns the `luma` value (perceptual brightness) of `@color`": "վերադարձնում է \"luma\" (ընկալման պայծառություն) արժեքը \"@color\" - ի համար",
			"returns the `red` channel of `@color`": "վերադարձնում է \"red\" ալիքը \"@color\"",
			"returns the `saturation` channel of `@color` in the HSL space": "վերադարձնում է \"հագեցվածություն\" ալիքը \"@color\" - ի համար HSL տարածքում",
			"returns the `saturation` channel of `@color` in the HSV space": "վերադարձնում է \"հագեցվածություն\" ալիքը \"@color\" - ի համար HSV տարածքում",
			"returns the `value` channel of `@color` in the HSV space": "վերադարձնում է \"արժեք\" ալիքը \"@color\" - ի համար HSV տարածքում",
			"returns the lowest of one or more values": "վերադարձնում է մեկ կամ մի քանի արժեքներից ամենափոքրը",
			"returns the number of elements in a value list": "վերադարձնում է արժեքների ցուցակի տարրերի քանակը",
			"rounds a number to a number of places": "կլորացնում է թիվը որոշակի թվով նիշերի",
			"rounds down to an integer": "կլորացվում է ամբողջից ներքև",
			"rounds up to an integer": "կլորացնում է ամբողջ թիվը",
			"selector expected": "սպասվում է ընտրիչ",
			"semi-colon expected": "սպասվում է ստորակետ",
			"sine function": "սինուսի գործառույթը",
			"string literal expected": "սպասվում էր լարային բառացի",
			"string replace": "լարային փոխարինում",
			"tangent function": "տանգենս-գործառույթ",
			"term expected": "սպասվում է տերմին",
			"unknown keyword": "անհայտ հիմնաբառ",
			"uri or string expected": "սպասվում է URI կամ լարային",
			"variable name expected": "սպասվում է փոփոխական անուն",
			"variable value expected": "ակնկալվում է փոփոխականի արժեքը",
			"whitespace expected": "բացը սպասվում է",
			"wildcard expected": "սպասվում է վայրի քարտ",
			"{ expected": "Պահանջվում {",
			"{0}, '{1}'": "{0}, '{1}'",
			"} expected": "Պահանջվում է }"
		},
		"package": {
			"css.colorDecorators.enable.deprecationMessage": "Պարամետր \"css.colorDecorators.միացնել\" - ը հնացած է: Այժմ դրա փոխարեն օգտագործվում է \"editor.colorDecorators\". ",
			"css.completion.completePropertyWithSemicolon.desc": "CSS հատկությունները լրացնելիս տողի վերջում տեղադրեք ստորակետ:",
			"css.completion.triggerPropertyValueCompletion.desc": "Լռելյայնորեն, VS Code-ը ակտիվացնում է գույքի արժեքի ավարտը CSS հատկությունն ընտրելուց հետո: Օգտագործեք այս տարբերակը՝ այս վարքագիծն անջատելու համար:",
			"css.customData.desc": "JSON ֆայլերի հարաբերական ուղիների ցուցակ, որոնց դիմաց նշված է [օգտագործողի տվյալների ձևաչափը](https://github.com/microsoft/vscode-css-languageservice/blob/master/docs/customData.md):\r\n\r\nVS Code-ը բեռնում է օգտագործողի տվյալները գործարկման ժամանակ՝ CSS-ի աջակցությունն ընդլայնելու համար՝ ներառելով CSS-ի հատուկ հատկությունները, at հրահանգները, կեղծ դասերը և կեղծ տարրերը, որոնք նշված են JSON ֆայլերում:.\r\n\r\nՖայլի ուղիները սահմանվում են աշխատանքային տարածքի համեմատ, և հաշվի են առնվում միայն աշխատանքային տարածքի թղթապանակի ընտրանքները:",
			"css.format.braceStyle.desc": "Տեղադրեք գանգուր փակագծերը նույն տողի վրա, ինչ կանոնները ('collapse) կամ տեղադրեք գանգուր փակագծերը իրենց սեփական տողի վրա (`ընդլայնել'):",
			"css.format.enable.desc": "Միացնել / անջատել ստանդարտ CSS ձևաչափիչը:",
			"css.format.maxPreserveNewLines.desc": "Մեկ բլոկում պահված տողերի ընդմիջումների առավելագույն քանակը, եթե միացված է `#css տարբերակը:format.preserveNewLines#`.",
			"css.format.newlineBetweenRules.desc": "Բաժանել կանոնների հավաքածուները դատարկ տողով:",
			"css.format.newlineBetweenSelectors.desc": "Ընտրողներին բաժանեք նոր տողով:",
			"css.format.preserveNewLines.desc": "Պետք է պահպանել գոյություն ունեցող տողերի ընդմիջումները տարրերից առաջ:",
			"css.format.spaceAroundSelectorSeparator.desc": "Համոզվեք, որ ընտրիչի բաժանարարների շուրջ տարածություններ կան\"&gt;\", \"+\", \"~\" (Օրինակ, ' a &gt; b`):",
			"css.hover.documentation": "Ցուցադրել պիտակի և հատկանիշի փաստաթղթերը, երբ մկնիկը սավառնում եք CSS-ում:",
			"css.hover.references": "Displayուցադրել MDN-ի հղումները, երբ մկնիկը սավառնում եք CSS-ում:",
			"css.lint.argumentsInColorFunction.desc": "Պարամետրերի սխալ քանակը:",
			"css.lint.boxModel.desc": "Մի օգտագործեք \"լայնություն\" կամ \"height\" ընտրանքները \"padding\" կամ \"border\" պարամետրերը նշելիս: ",
			"css.lint.compatibleVendorPrefixes.desc": "Մատակարարի նախածանցն օգտագործելիս նշեք նաև մատակարարի մնացած հատկությունները:",
			"css.lint.duplicateProperties.desc": "Մի օգտագործեք կրկնօրինակ ոճի սահմանումներ:",
			"css.lint.emptyRules.desc": "Մի օգտագործեք դատարկ կանոնների հավաքածուներ:",
			"css.lint.float.desc": "Փորձեք չօգտագործել \"float\" տարրերը: \"Float\" տարրերը կարող են կոտրել CSS ծածկագիրը, Եթե փոխեք նշագրման ասպեկտներից մեկը:",
			"css.lint.fontFaceProperties.desc": "\"@Font-face \" կանոնը պետք է սահմանի \"src\" և \"font-family\"հատկությունները: ",
			"css.lint.hexColorLength.desc": "Տասնվեցական ձևաչափով գույները պետք է պարունակեն երեք կամ վեց տասնվեցական թվեր:",
			"css.lint.idSelector.desc": "Ընտրողները չպետք է պարունակեն նույնացուցիչներ, քանի որ այդ կանոնները չափազանց սերտորեն կապված են HTML-ի հետ:",
			"css.lint.ieHack.desc": "Internet Explorer-ի օգտակար խորհուրդները պահանջվում են միայն Internet Explorer 7-ի և ավելի վաղ տարբերակների աջակցությամբ:",
			"css.lint.importStatement.desc": "Ներմուծման հայտարարությունները զուգահեռ չեն բեռնվում:",
			"css.lint.important.desc": "Փորձեք չօգտագործել :կարևոր, քանի որ դա ցույց է տալիս, որ CSS-ի ամբողջ ծածկագիրը դարձել է անկառավարելի և պետք է վերամշակվի:",
			"css.lint.propertyIgnoredDueToDisplay.desc": "Գույքը անտեսվել է \"displayուցադրել\" պարամետրի արժեքի պատճառով: Inline \" արժեքը նշելիս, օրինակ, \"width\", \"height\", \"margin-top\", \"margin-bottom\" և \"float\" հատկությունները չեն գործում:",
			"css.lint.universalSelector.desc": "Ունիվերսալ ընտրիչը (*) դանդաղ է աշխատում:",
			"css.lint.unknownAtRules.desc": "Անհայտ կանոն at.",
			"css.lint.unknownProperties.desc": "Անհայտ հատկություն:",
			"css.lint.unknownVendorSpecificProperties.desc": "Մատակարարի անհայտ գույքը:",
			"css.lint.validProperties.desc": "Հատկությունների ցուցակ, որոնց համար \"unknownProperties\" կանոնը չի ստուգվում: ",
			"css.lint.vendorPrefix.desc": "Մատակարարի նախածանցն օգտագործելիս նշեք նաև ստանդարտ հատկությունը:",
			"css.lint.zeroUnits.desc": "Զրոյի համար չափման միավոր չի պահանջվում:",
			"css.title": "CSS",
			"css.trace.server.desc": "Վերահսկում է VS Code-ի և CSS լեզվի սերվերի միջև տվյալների փոխանակումը:",
			"css.validate.desc": "Միացնում կամ անջատում է բոլոր ստուգումները:",
			"css.validate.title": "Կառավարում է CSS վավերացումը և խնդիրների լրջությունը:",
			"description": "Ապահովում է լեզվի լայն աջակցություն CSS, LESS և SCSS ֆայլերի համար:",
			"displayName": "CSS լեզվի առանձնահատկությունները",
			"less.colorDecorators.enable.deprecationMessage": "Պարամետր \"less.colorDecorators.enable\" - ը հնացած է: Այժմ դրա փոխարեն օգտագործվում է \"editor.colorDecorators\". ",
			"less.completion.completePropertyWithSemicolon.desc": "CSS հատկությունները լրացնելիս տողի վերջում տեղադրեք ստորակետ:",
			"less.completion.triggerPropertyValueCompletion.desc": "Լռելյայնորեն, VS Code-ը ակտիվացնում է գույքի արժեքի ավարտը CSS հատկությունն ընտրելուց հետո: Օգտագործեք այս տարբերակը՝ այս վարքագիծն անջատելու համար:",
			"less.format.braceStyle.desc": "Տեղադրեք գանգուր փակագծերը նույն տողի վրա, ինչ կանոնները ('collapse) կամ տեղադրեք գանգուր փակագծերը իրենց սեփական տողի վրա (`ընդլայնել'):",
			"less.format.enable.desc": "Միացնել / անջատել ստանդարտ LESS ձևաչափիչը:",
			"less.format.maxPreserveNewLines.desc": "Մեկ բլոկում պահված գծերի ընդմիջումների առավելագույն քանակը, եթե \"`#less.format.preserveNewLines#`.",
			"less.format.newlineBetweenRules.desc": "Բաժանել կանոնների հավաքածուները դատարկ տողով:",
			"less.format.newlineBetweenSelectors.desc": "Ընտրողներին բաժանեք նոր տողով:",
			"less.format.preserveNewLines.desc": "Պետք է պահպանել գոյություն ունեցող տողերի ընդմիջումները տարրերից առաջ:",
			"less.format.spaceAroundSelectorSeparator.desc": "Համոզվեք, որ ընտրիչի բաժանարարների շուրջ տարածություններ կան \"&gt;\", \"+\", \"~\" (Օրինակ, `a &gt; b`):",
			"less.hover.documentation": "Displayուցադրել պիտակի և հատկանիշի փաստաթղթերը, երբ մկնիկը սավառնում եք LESS-ում:",
			"less.hover.references": "Displayուցադրել MDN-ի հղումները, երբ մկնիկը սավառնում եք LESS-ում:",
			"less.lint.argumentsInColorFunction.desc": "Պարամետրերի սխալ քանակը:",
			"less.lint.boxModel.desc": "Մի օգտագործեք \"width\" կամ \"height\" ընտրանքները \"padding\" կամ \"border\" պարամետրերը նշելիս: ",
			"less.lint.compatibleVendorPrefixes.desc": "Մատակարարի նախածանցն օգտագործելիս նշեք նաև մատակարարի մնացած հատկությունները:",
			"less.lint.duplicateProperties.desc": "Մի օգտագործեք կրկնօրինակ ոճի սահմանումներ:",
			"less.lint.emptyRules.desc": "Մի օգտագործեք դատարկ կանոնների հավաքածուներ:",
			"less.lint.float.desc": "Փորձեք չօգտագործել \"float\" տարրերը: \"Float\" տարրերը կարող են կոտրել CSS ծածկագիրը, Եթե փոխեք նշագրման ասպեկտներից մեկը:",
			"less.lint.fontFaceProperties.desc": "\"@font-face\" կանոնը պետք է սահմանի \"src\" և \"font-family\"հատկությունները: ",
			"less.lint.hexColorLength.desc": "Տասնվեցական ձևաչափով գույները պետք է պարունակեն երեք կամ վեց տասնվեցական թվեր:",
			"less.lint.idSelector.desc": "Ընտրողները չպետք է պարունակեն նույնացուցիչներ, քանի որ այդ կանոնները չափազանց սերտորեն կապված են HTML-ի հետ:",
			"less.lint.ieHack.desc": "Internet Explorer-ի օգտակար խորհուրդները պահանջվում են միայն Internet Explorer 7-ի և ավելի վաղ տարբերակների աջակցությամբ:",
			"less.lint.importStatement.desc": "Ներմուծման հայտարարությունները զուգահեռ չեն բեռնվում:",
			"less.lint.important.desc": "Փորձեք չօգտագործել :կարևոր, քանի որ դա ցույց է տալիս, որ CSS-ի ամբողջ ծածկագիրը դարձել է անկառավարելի և պետք է վերամշակվի:",
			"less.lint.propertyIgnoredDueToDisplay.desc": "Գույքը անտեսվել է \"displayուցադրել\" պարամետրի արժեքի պատճառով: Inline \" արժեքը նշելիս, օրինակ, \"width\", \"height\", \"margin-top\", \"margin-bottom\" և \"float\" հատկությունները չեն գործում:",
			"less.lint.universalSelector.desc": "Ունիվերսալ ընտրիչը (*) դանդաղ է աշխատում:",
			"less.lint.unknownAtRules.desc": "Անհայտ կանոն at.",
			"less.lint.unknownProperties.desc": "Անհայտ հատկություն:",
			"less.lint.unknownVendorSpecificProperties.desc": "Մատակարարի անհայտ գույքը:",
			"less.lint.validProperties.desc": "Հատկությունների ցուցակ, որոնց համար \"unknownProperties\" կանոնը չի ստուգվում: ",
			"less.lint.vendorPrefix.desc": "Մատակարարի նախածանցն օգտագործելիս նշեք նաև ստանդարտ հատկությունը:",
			"less.lint.zeroUnits.desc": "Զրոյի համար չափման միավոր չի պահանջվում:",
			"less.title": "LESS",
			"less.validate.desc": "Միացնում կամ անջատում է բոլոր ստուգումները:",
			"less.validate.title": "Կառավարում է LESS-ի ստուգումը և խնդիրների խստության մակարդակները: ",
			"scss.colorDecorators.enable.deprecationMessage": "Պարամետր \"scss.colorDecorators.միացնել\" - ը հնացած է: Այժմ դրա փոխարեն օգտագործվում է \"editor.colorDecorators\". ",
			"scss.completion.completePropertyWithSemicolon.desc": "CSS հատկությունները լրացնելիս տողի վերջում տեղադրեք ստորակետ:",
			"scss.completion.triggerPropertyValueCompletion.desc": "Լռելյայնորեն, VS Code-ը ակտիվացնում է գույքի արժեքի ավարտը CSS հատկությունն ընտրելուց հետո: Օգտագործեք այս տարբերակը՝ այս վարքագիծն անջատելու համար:",
			"scss.format.braceStyle.desc": "Տեղադրեք գանգուր փակագծերը նույն տողի վրա, ինչ կանոնները ('collapse') կամ տեղադրեք գանգուր փակագծերը իրենց սեփական տողի վրա (`expand'):",
			"scss.format.enable.desc": "Միացնել / անջատել ստանդարտ SCSS ձևաչափիչը:",
			"scss.format.maxPreserveNewLines.desc": "Մեկ բլոկում պահված գծերի ընդմիջումների առավելագույն քանակը, եթե `#scss.format.preserveNewLines#`.",
			"scss.format.newlineBetweenRules.desc": "Բաժանել կանոնների հավաքածուները դատարկ տողով:",
			"scss.format.newlineBetweenSelectors.desc": "Ընտրողներին բաժանեք նոր տողով:",
			"scss.format.preserveNewLines.desc": "Պետք է պահպանել գոյություն ունեցող տողերի ընդմիջումները տարրերից առաջ:",
			"scss.format.spaceAroundSelectorSeparator.desc": "Համոզվեք, որ ընտրիչի բաժանարարների շուրջ տարածություններ կան\"&gt;\", \"+\", \"~\" (Օրինակ, ' a &gt; b`):",
			"scss.hover.documentation": "Ցուցադրել պիտակի և հատկանիշի փաստաթղթերը, երբ մկնիկը սավառնում եք SCSS-ում:",
			"scss.hover.references": "Ցուցադրել MDN-ի հղումները, երբ մկնիկը սավառնում եք SCSS-ում:",
			"scss.lint.argumentsInColorFunction.desc": "Պարամետրերի սխալ քանակը:",
			"scss.lint.boxModel.desc": "Մի օգտագործեք \"width\" կամ \"height\" ընտրանքները \"padding\" կամ \"border\" պարամետրերը նշելիս: ",
			"scss.lint.compatibleVendorPrefixes.desc": "Մատակարարի նախածանցն օգտագործելիս նշեք նաև մատակարարի մնացած հատկությունները:",
			"scss.lint.duplicateProperties.desc": "Մի օգտագործեք կրկնօրինակ ոճի սահմանումներ:",
			"scss.lint.emptyRules.desc": "Մի օգտագործեք դատարկ կանոնների հավաքածուներ:",
			"scss.lint.float.desc": "Փորձեք չօգտագործել \"float\" տարրերը: \"Float\" տարրերը կարող են կոտրել CSS ծածկագիրը, Եթե փոխեք նշագրման ասպեկտներից մեկը:",
			"scss.lint.fontFaceProperties.desc": "\"@font-face\" կանոնը պետք է սահմանի \"src\" և \"font-family\" հատկությունները: ",
			"scss.lint.hexColorLength.desc": "Տասնվեցական ձևաչափով գույները պետք է պարունակեն երեք կամ վեց տասնվեցական թվեր:",
			"scss.lint.idSelector.desc": "Ընտրողները չպետք է պարունակեն նույնացուցիչներ, քանի որ այդ կանոնները չափազանց սերտորեն կապված են HTML-ի հետ:",
			"scss.lint.ieHack.desc": "Internet Explorer-ի օգտակար խորհուրդները պահանջվում են միայն Internet Explorer 7-ի և ավելի վաղ տարբերակների աջակցությամբ:",
			"scss.lint.importStatement.desc": "Ներմուծման հայտարարությունները զուգահեռ չեն բեռնվում:",
			"scss.lint.important.desc": "Փորձեք չօգտագործել :կարևոր, քանի որ դա ցույց է տալիս, որ CSS-ի ամբողջ ծածկագիրը դարձել է անկառավարելի և պետք է վերամշակվի:",
			"scss.lint.propertyIgnoredDueToDisplay.desc": "Գույքը անտեսվել է \"display\" պարամետրի արժեքի պատճառով: Inline \" արժեքը նշելիս, օրինակ, \"width\", \"height\", \"margin-top\", \"margin-bottom\" և \"float\" հատկությունները չեն գործում:",
			"scss.lint.universalSelector.desc": "Ունիվերսալ ընտրիչը (*) դանդաղ է աշխատում:",
			"scss.lint.unknownAtRules.desc": "Անհայտ կանոն at.",
			"scss.lint.unknownProperties.desc": "Անհայտ հատկություն:",
			"scss.lint.unknownVendorSpecificProperties.desc": "Մատակարարի անհայտ գույքը:",
			"scss.lint.validProperties.desc": "Հատկությունների ցուցակ, որոնց համար \"unknownProperties\" կանոնը չի ստուգվում: ",
			"scss.lint.vendorPrefix.desc": "Մատակարարի նախածանցն օգտագործելիս նշեք նաև ստանդարտ հատկությունը:",
			"scss.lint.zeroUnits.desc": "Զրոյի համար չափման միավոր չի պահանջվում:",
			"scss.title": "SCSS (SASS)",
			"scss.validate.desc": "Միացնում կամ անջատում է բոլոր ստուգումները:",
			"scss.validate.title": "Կառավարում է SCSS ստուգումը և խնդիրների խստության մակարդակները:"
		}
	}
}